["butwhat it can do or not,compared to slack?",
"video? how many people?",
"`code`?",
"there are plugins?",
"and whats their business model?",
"another gaming persona?",
"and where can I edit?",
"well in the left side dont you see icons for the servers you are logged in ?",
"*something* like this?",
"how ?",
"slow ?",
"why you did not post this in the mailing list ?",
"whats the distinction with interactive fiction ?",
"always ?",
"are the parsers custom made,or are they based on PettitParser / SmaCC ?",
"PP ?",
"why you need special app?",
"which browser ?",
"okay there is no password reset option or what ?",
"Why ?",
"So we are disecting small chat groups even more?",
"Everyones asleep?",
"How long does discord exist?",
"Are you saying  when you share a file with Dropbox you are not replicating ?",
"What has dropbox to do with a debugger?",
 "Like what? Like several people connected to one image? A couple Gems and a Stone?",
"Well,why do you say that?",
"How can we screenshare things here?",
"Doing a pharo plugin would be possible ?",
"Pharo plugin for what ?",
"Doable.  But what are the possibilities ?",
"Couldnt expose network streams ?",
"But what would be cool to integrate ? Code sharing as an image ? As strings ?",
"why?",
"That would be really cool.  BTW anybody would know how to port croquet in a PS4 ?",
"Why croquet and not Cobalt ?",
"Check PC demo entries here: ?",
"You mean a few Kbps ?",
"No engine,just code. ?",
"Yeah,you can do this stuff ?",
"Why hard ?",
"We dont have something similar ?",
"Which I assume has something to do with web dev ... No ?",
"You have Occulus ?",
"Hey  welcome,how you doing ?",
"fine,thanks,just trying this. Theres no desktop app for linux,isnt it?",
"hey guys i started a screencast test,can anyone check it and tell me if it works for you ?",
"hey guys,waz up ?",
"Sunday for paperwork ?",
"oh Phil what exactly is your job ?",
"impressive,and you use the usual suspects,java,javascript,html/css,sql ?",
"VBScript is still alive ?",
"you mean Delphi was first try ?",
"so how often you use Pharo ? is Pharo a viable way to make a living ?",
"what do you mean by desktop ?",
"really ?",
"maybe we should use it instead twitch ?",
"I proposed to do the same some time ago,do you memeber?",
"So?",
"do you talk ?",
"Hum,what went wrong with LCTV?",
"Whats the current plan?",
"anybody tried amazon clouddrive ?",
"Is anyone actually using the talk part of this?",
"anyone here evern played with shared memory mapped files ?",
"why not?",
"who is taking notes?",
"whos recording the voice chat ?",
"and windows??",
"When the new VM is out,can we get a debug version of it to help find the bug that makes it crash for us?",
"Pharo5: Will we see an updated build? E.g. on Windows we seem to ship old OpenSSL?",
"now but maybe in Pharo6)?",
"github.com/npasserini/iceberg/milestone/7?",
"who is talking?",
"Peter ?",
"cargo?",
"by the way,is this discardapp better than Slack?",
"has it screen sharing capabilities?",
"You said the freeze is early november or late november ?",
"Wizard game,what Wizard game ?",
"so mid-november ?",
 "should i stop the recording ?",
"Alex,coffee?",
  "are you going to make the recording available?",
"Are you talking about something else ?",
"Any way to get a profiling of a given test?",
"In a BaselineOfXYZ>>#baseline: can I somehow target two different versions depending on Pharo-5.0 and Pharo-6.0?",
"how it was?",
 "do you remeber  how it was to mark Smalltalk code?",
 "How do you send code? I only have a button to send a file. Or is it some markup?",
"wow,but *I* do not see mine... maybe a bug?",
"it,debugging the test just goes bonkers on the step in/over/through/run to here in GTDebugger. Not happening in SpecDebugger. Experienced that?",
"the embeding ?",
"by large you mean GBs large ?",
  "Really you did it all ?",
"for a Pharo sprint ?",
  "can i override something from #common just for #pharo6.x?",
"requests and then read both responses?",
"and mongodb might (e.g. with tailable cursor) send the result the other way around but the code would not get confused?",
 "task it for an implementation of futures?",
"handler doesnt seem to do anything. Any idea how to fileout some code?",
"What does the st handler do?",
"headless: pharo X.image st SomeScriptFilingOutWhatYouNeed.st ?",
"and?",
"What does NonInteractiveTranscript install. Transcript nextPutAll: Hi,flush. Say?",
"Or VTermOutputDriver printText: Meh,locked. say in a console?",
"What is the Pharo debuglog saying?",
 "do you have a debug snippet to kill the activeProcess()?",
"Can you try: MorphicUIManager spawnNewProcess?",
"next question. how can I open a .changes file from another image?",
"ok,so,didi you manage to salvage your work?",
"this be fixed?",
"Who is responsible for the Pharo Project Catalog?",
"How does a config end up there? Just by being able to put something in that project on STH?",
"The last Gitocello upgrade removed Pharo50 support? Was that intentional?",
"already?",
"yeah why not ?",
 "you have bindings for jira?",
"where?",
"How is working without submodules going to work out for external projects?",
  "which json package is needed?",
  "On which pharo version are you using it?",
"why you need a json object?",
"are the same that the *current* system is perfect?",
"But why not target the thing once bigger?",
"thanks for the update. could you share the audio?",
"so is the talk over ?",
"hi?",
"hey guys,how can we invite someone to discord?",
"this qualifies as TechTalk,isnt?",
 "record what ?",
"is there audio?",
"Is the BaselineOfPharoKernel the same as ?",
"Is that GitTool class available in Pharo?",
"You do tab?",
 "question: do you load always ALL packages contained in a project?",
"Why do you squash? The one commit per package?",
"other thing first. Are there well written examples of this without too much dependencies?",
"Q: where is this monticello-less stuff?",
"Then why do I have to do it twice?",
"BTW,any simple way to clone a STH/MC project into GH easily?",
"why is glamour so tied to the kernel ?",
"Ah stupid question: how do you guys name your github local directory?",
"to some sheep style choice. b/c there we are having all cloned git repos containing their own src|repository|mc|package thing. Is this kind of git-projects?",
"And github-cache seems tied to GH. Is usign Gitlab going to be storing things there too?",
"did you manage to record the techtalk ?",
"anyone else here?",
"Just checking. On the youtube channel there is an Iceberg stream from 4 hours ago.  Is that the one we are to watch?",
"everything going smoothly on the sending end?  Can we have an estimate time to start?",
"We need both? youtube and dis here?",
"Streaming is on.  Is that Nico?",
"Should I start or should I wait a little?",
"Will we see more than Nicos face?",
"so in 3 minutes?",
"so I could give the talk in spanish?",
"is it just me?",
"Is the interception just for github urls still?",
"what will happen if I reload it from remote repo?",
"Could you alternatively have a menu item in the top pane to Load via Metacello ?",
 "You mean you added something like gitlocal:// to the repository in the baseline?",
"Is it possible to show list of BaseLines in repository?",
"shouldnt be mine/ theirs ?",
"could you edit in diff panes?",
"Why do we use a working folder on disk?  Couldnt we treat the Image as the working folder and commit direct to the git database?",
"What do you think about adding a log pane where we can see the git commands (or whatever you do behind the curtains)?",
"What if we have more than one remote?",
"What about pull rebase?",
"how stable is all this?",
"can we record discord,phil?",
"if something goes wrong,what happens?",
"so,we can switch to discord and keep the track?",
 "How would you use normal git tooling with Pharo?",
 "How is Pharo 7 build going with Iceberg?",
"are you guys talking?",
"do you select TechTalk label?",
"Are U seeing Voice connected on the techtalk channel?",
"how?",
"Where can you buy a computer without a microphone?",
"Is Techtalk is bold for you?",
"what did you do?",
"do you hear sound notifications (in and out channel connections) ?",
"Ben do you use desctop client?",
"What is missing for it to be considered 1.0 ?",
"But it is stable enought for day to day use?",
"So if it breaks,is it easy to fix usually?",
"Can you make a short summary of workflow operations that Iceberg currently supports?",
"UFFI problem?",
"Do you have some reproducible cases for the callback problem?",
"Can I stop recording here?",
"Is the TechTalk now?",
"howdy guys. So I see the youtube video start and the Bloc github on screen,but no sound. Anyone talking yet?",
"to follow along you suggest installing Bloc - user or developer version?",
"should we also talk here,or do we only write?",
"what do you mean  ?",
"what units are used?",
"Why does it not re-layout when you move out things?",
"why they not fill empty freed space?",
"So you implement scrolling with velocity?",
"is pen pressure supported too?",
"OK,if it is the GC it is ok?",
"is the rope implementation specific or could be packaged in a separate package?",
"can rotate the iphone?",
"How you decide what should be in Bric. Why for example Bloc-inifinite is not in Bric?",
"Is pixel the only unit?",
"Highlighting?",
"where to load Editor?",
"Yes,where?",
"is Bloc absolute or relative coordinates?",
"highlighting?",
"Do you implement kind of MVC/MVP pattern to program new widgets?",
"invariants?",
"is the mozz packages?",
"what do you mean,stef?",
"packaged?",
"doru where is the webpage?",
"is it maintained?",
"Is there someone having a C++ to C kind of generator to ease this wrapping?",
"So do you have TravisCI to update sparta from mozila sources?",
"why the patches are not push to them?",
"Wait youre not using Sparta directly,youre getting Sparta,you patch it and that is what you use in Pharo ?",
"for what the Node is used?",
"before using it ?",
"Does it mean you maintain the modifications to Mozz2D ?",
"alex: could we use Moz2D as it is without stripping it if we would not care about size?",
"next talk?",
"alex: what about the graph extensions?",
"Following my question about MVC how you implement widgets in Bric without such abstraction?",
"inputs,they all have kind of model inside and you need to connect it to view somehow. What the current approach?",
"Are you using the pair of GTK-OSWindow instead of SDL2-OSWindow ?",
"OSWindow with something else with a greek name ?",
"Or what?",
"and explicitely ask for a redraw,cant you ?",
"OSWindow ?",
"I want to repeat my question ðŸ˜ƒ Following my question about MVC how you implement widgets in Bric without such abstraction?",
"For example Compobox,text inputs,they all have kind of model inside and you need to connect it to view somehow. What the current approach?",
"I repeat my question,too. Would you recommend using Bloc for own projects?",
"is it readonly?",
"Is there a timeframe for a stable version?",
"where is it?",
"slack?",
"yeap slack,what else ?",
",",
"why?",
"are there any rss feeds for pharo ?",
"bot for what?",
"do you guys want something specific added to the bot ?",
"Welcome julien,how are you ?",
  "I was looking at your gists idea,seems a bit inefficient for logging online chat,is there any advantage ?",
"howdy,is this the channel for the tech talk?",
"So maybe it is better when the window is active?",
"is the text readable?",
"What is voice channel TechTalk useful for?",
"does the audio work?",
"Ready to start?",
"Is the latest Metacello in Pharo6?",
"anyone else?",
"Can you share the playground?",
"Should we use the latest image (60417) to be able to reproduce what you do?",
"CompiledMethod --> ast gives ReflectiveMethod ... as GT Inspector title shows.  Correct?",
"Whatwhen image is saved? Are ast properties gone?",
"How can one activate the compiler plugins?",
"So we have ABIA  as in Smallscript -,Around,Beginning,Inner and,After method with #control:?",
"How is perforormance impacted?",
"How can one find out about all of these links?",
"And are things disappearing or not on image save/load?",
"How can I call the original method when I have a wrapper around it?",
"As this is per instance,if we have loots of objects,this is getting to baloon,right?",
"like message send logging?",
 "If you create a lot of objects it is balooning,right? What do you want the environment to do for you?",
"That would be a toolkit using Metalinks,right?",
"What are they keys goals of Reflectivity?",
"support,cool. Interception,cool. There must be other things you have in mind Marcus,and these can be great. So,what are these?",
 "Where? Dynamic one like in Babymock?",
": you should do a video on it or a medium article. Requires openPonk?",
"How is one debugging this stuff?",
"How can one get a metalink for each method of a class?",
"That would be installing Metalinks and query that from calypso?",
"I think we already show metalinks in Nautilus?",
"thenReject: #isNil) flatCollect: #yourself ] ?",
"try a new Playground  fro the metalink test (?",
 "like so ?",
"Any more questions?",
"Can we do Properties on Classes ?",
"Marcus: you briefly mentioned performance... does metalinks means just couple extra message sends or something more expensive?",
"Yes what?",
"At one point,you mentioned the usage of metalinks for 2-way associations between objects. Is this still a thing?",
"Are instance side Slots and class side slots now unified in Pharo 6?",
"Is a class property persisted with Monticello/Git source file in/out already?",
"Obsolete class,like what? anObsoleteXYZ?",
"Anymore questions here? Should we do audio here?",
"do we have some example of Slot-like access to class variables?",
"Is Seamless using Reflectivity?",
"Is there any doc on Ring BTW?",
 "is the sequence diagram something you would find immediately useful?",
"So it exports or does it visualize in Pharo directly?",
"Hmmm are discusssion now on slack and here?",
"What is the use of this annoying bot?",
 "did my last help on rpath + $ORIGIN help? Will you work on it this week?",
"so how did this fail?",
"@MEE6#4876 thank you! Level 1 is the best?",
 "block more people?",
"libssh.so.X as well. Does it?",
"howdy guys,is this affecting 32-bit linux?",
"do you mean when toggling Use Free type setting?",
"How come updating free type is slow in your image and quick in base image ? Is there a freeTypeSetting cache leaking ?",
"so this is 64-bit VM/Image?",
",SO effectively this   FreeTypeFontProvider current updateFromSystem   is taking the time?",
"this is something that clears annoying references that led to crashes in FT2. Are U sure ?",
"fly?",
"@esteban,is this commited?",
"which file?",
 "do you want a zip with the vm,so you can test?",
 "which timezone are you in?",
 "how far are we to enable unit tests as part of the pharo-vm build again?",
"with failures marked as expected failures or these were resolved?",
"Did we lose edit-in-place in GT Inspector in Pharo 6?",
",",
"what I missed or should do?",
"using Mustache??",
 "Do you know ?",
",",
"Whats the Discord etiquette? I posted Did we lose edit-in-place in GT Inspector in Pharo 6?",
"answer. Can/should one bump?",
"get the template file????  p.s. I trying to work through Chapter 14 in the Enterprise Pharo Book.  If the exclude the option: --template==yourhtmltemplate  ... of course pharo throws and exception that a template file is required??",
"Can anyone help me get sqlite set up in Pharo?",
"Pharo 5 ? Have you loaded it from the Pharo catalog ?",
"What is the exact error ?",
"Is it shown on the command line ? Is it a primitive failure in the image ?",
"OK so does the naming convention on linux not work?",
"Can I do it from the debugger?",
"You said Pharo 5 ?",
"Are you on 32 bits VM ?",
"Does it now?",
"Are you using SqLite 3 ?",
"Youve installed the version with the popup Has not been tested for Pharo 5 ?",
"Or maybe on old VMs ?",
"Any other dbs I can use?",
"Does that work with pharo well?",
"should still submit an issue to fogbugz?",
"akgrant0710#4807; is the 32 bit sqlite library really in /usr/lib/ ?",
"Pharo 6 release?",
"This is weird. I can only see online users. Shouldnt I be able to see all users?",
 "how did the rpath $ORIGIN fail in the end?",
"023145.html does anyone remember a solution for that?",
"Do you remember the symptoms?",
"and libgit2 had rpath with $ORIGIN too?",
"or did you consider linking libssh2/libssl statically?",
"now... I think the script is a valid solution for OBS too,isnt?",
"Does someone know if it is possible to add a retry to some tests with SUnit?",
"cant we put them as env. vars?",
"post/346 ?",
"from Pharo?",
"Pharo will be divided in projects?",
"travis-ci?",
"akgrant0710#4807;Is this months TechTalk on now?",
 "time for the VM or shall we postpone it?",
"I still have an hour at the airport. Your french lunch could be done?",
"If we are moving from slack to discord can we discus this bot?",
"well,@Esteban A. Maringolo#8129 ... can we put a message in Slack ?",
"did you guys noticed discord has spotter?",
"Whats the shortcut to focus on the text input?",
"why is libssh2 even part of windows vm,and why do I have to build it from scratch and not e.g. reuse existing compilate?",
"dtto for other components (I am not compiling gcc,so why should I compile pkg-config?",
"is windows dependency managament really this poor?",
"Can we have a #gsoc-students channel here ?",
"but I think you can create it,or not?",
"can we have #crying channel where I can complain about everything?",
"so  . you succeed?",
"I dunno how do it ?",
 "we can have protected channels ?",
"why?",
 "now I believe there was a way to build debug vm,right?",
"click where ?",
"or is the vm fast,and only the third-party plugins are so slow?",
"maybe you need to re-log (or restart app)?",
"can you try now?",
",why isnt the members list available?",
"joke 404 ?",
"talk+small = smalltalk?",
"How can one increase the font in this chat?",
"How to create a channel ?",
"Any idea?",
 "You can create a #Roassal channel please?",
  "you mean tabs ?",
"the list from 1 to 100,what do I wrong?",
  "what space suppose to mean ?",
"well first have you opened trascript ?",
"no,how do I do that?",
  "you made customisations to the VM or you just build it from scratch ?",
"Hi,is there a database channel like in slack already?",
"processes?",
"I see those. Are there more?",
  "here you go #databases,you want me to make you admin there ?",
"well not without their permission ðŸ˜‰   you wanna admin #databases ?",
"so on discord you are automatically subscribed to all channels and all you can do is mute them?",
"and (slack) roassal channels?",
"Why dont I see #deleted-channel?",
 "where is the hide button?",
"@everyone this is a test announcement. anyone get a popup?",
"how does nautilus decide what classes to show in italic?",
"Why disable something that users can mute for themselves?",
"Can you delete this level thing with the bot please?",
",",
"how can I help you?",
"there a way to get my code out and start with a fresh image?",
"They are ?",
"Ill have to cherry pick,then?",
"thats pharo5,not pharo6,isnt?",
"are you familiar with Git ?",
"here you go ",
"whats new in pharo 6?",
"Whats new in Pharo 6 ?",
"what is the .sources file?",
"wher can I get pharo6 source file?",
"arguments for the block. Is there a limit for the number of variables passing into a block?",
"can anyone confirm that this leads to an error?",
"limited?",
"didnt want to compute them in the block because i thought that it is to expensive. But perhaps it is not?",
"this is the block,the variables are computed outside. Perhaps move the computing inside the block?",
"would it be bad for performance of the query if I would compute the variables inside?",
"ok. what about moving all the parameters in one arrray and give just one argument,the array to the block?",
"what about move all ugly parameters into an object,not an array?",
"the parameters are inside the object?",
"So whats the plan with Slack ?",
"Is there an expiration date ?",
"not work.,Is this a limitation (or is it a problem of my code?",
"but you know that you should avoid it if possible,isnt?",
"because of the full search?",
"What is the current status of PharoExtras/ImageWorker? It uses OSProcess and the old ss3 seamless. Does that work with a Spur image?",
"how can I hide muted channels?",
"order,it is possible?",
"is Zinc natively in Pharo?",
"You think I care about zinc ? Or everyone else here ?",
"are there any plans to add namespaces to pharo?",
"whats the difference?",
"python style?",
"PharoConsole nor with headless flag will print to stdout (which I guess is Windows limitation?",
"and PharoUnstripped is what?",
"where did you got that?",
"Anyone is using Travis for project stored on SmalltalkHub (and not GitHub)?",
 "",
 "Yes,but when I commit a new .mcz in SmalltalkHub,how can I automatically trigger a new build on Travis ?",
"does this make sense?",
"might beâ€¦ but they introduced periodic builds,right ?",
"then,there will be no slice,but only pull request?",
 "can I rebuild libfreetype & ft2plugin with symbols?",
"Wasnt it you that added it?",
"Or is it the auto removal of empty protocol?",
"si there a way to paste a piece of string into comment and have it properly commented?",
"By any chance,is there a way to get Pillar fully working on Windows?",
"Why the hell is this bot not using private messages?",
"if I was asking you help with documentation would I prefer a private message ?",
"are you going to implement it in pharo eventually?",
"cool?",
"bot Is the bot cool?",
"How can I get the equivalent of mktemp in Pharo?",
"What is usually?",
"It is ?",
"Maybe this ?",
  "Why dont you implement mktemp yourself?",
"What are you missing?",
 "Yes but method is class side and works in a strange way. Agreed?",
"(Ive been using it for GitFileTree for ... 5 months already?",
"Question: how can one switch from method to method while in the code pane? Is there a shortcut?",
"More linux than Mac?",
"Do I know the right people ?",
"but where does it goes? I added it but then what?",
"everyone needign to read teh whole list,perhaps several people can start at different locations.  Could someone confirm this link give access and editing?",
"docs.google.com/spreadsheets/d/1NrCnkIJl9Ezk35B1IfpN9BC4wkhHG26C7DI-yZhLQd4/edit?",
"m yes done. But then how can I switch methods?",
"didnt you do something like editing pharo code in vim?",
"Smalltalkhub is down ?",
"it is like here: ",
"How pull request work with pharo?",
"monticello then git?",
"we need some help to generate the Pharo 6 release notes. Anyone got 10 minutes free to review just 50 lines?",
"cool. how do you find the presentation of it?",
"what does FU mean in rating?",
"cant get enough hey?",
"non-generated (or human-generated) code. Is there a best practice regarding this in Pharo?",
 "if you dont mind telling,what are you generating?",
"questions such as Do I support this input?",
 "do you need to change generated code by hand,or can you disallow that?",
"Do you actually need to generate the boilerplate,or can you possibly avoid it by meta-level programming?",
"is there a limit on the number of instance variables?",
 "Where can I find information about slots/property dictionary?",
"Do they require Pharo 6 or newer?",
"Is it known?",
"black screen is the one who is there until click?",
"What prompted the move here?",
"Wheres the emoji where its eyes and ears are bleeding and theres a pentagram behind it?",
"Looked like UFFI doesnt work natively on 64-bit Windows right now,last I looked?",
"Is that its broken and we dont know why or someone just needs to write some stuff?",
"what?",
"Is there a port that doesnt work,or has on one even started a 64-bit Windows port?",
"I am trying to get TaskIt to zork but tasks appear to not start when scheduled. Anyone using it?",
"I was wondering about that. thx for reporting.  Is this a working GUI through Xwindows? Or just command line?",
"what is your GUI chain?",
"what do you mean with gui chain?",
"which xserver are you using?",
 "can you share some shots?",
"kicks off the WSFL process that sends display back to PHARO.EXE ?",
"too hackish?",
"so for Pharo 13?",
"A question: I need to log stuff for my project. What are you guys using? Log4s? Toothpick? Beacon?",
"In TaskIt process dashboard,done tasks are still lingering around. Is this normal? How can I clean?",
"is there some major performance hurdle in a classes having hundreds of methods?",
 "I am looking for discord plugin for weechat and bitlbee,whats your preffered irc client?",
"Can it edit messages ?",
"look at discord web app,all this with Spec? or just simply compose raw Bloc Morps into something shiny?",
 "Spec is also nowhere as powerful as Morphic - can you explain a little?",
"and whats Bloc missing compared to Morphic?",
"Brick?",
"Out of curiosity can you show me some examples of what you did?",
"Anyone having fun with ProcessWrapper finalization crap?",
"any volunteers?",
"if there a way to tell filetree to not generate a .monticello-meta/version file?",
"wait,if last update on Pharo side was 2014,does that mean that it still uses NativeBoost and not UFFI?",
"or is there some automatic resolution/forwarding?",
"because it needs something more than UFFI/image can provide?",
"can I use fossil/mercurial/something else with gitfiletree?",
"what you think is lacking in pharo?",
  "Are you doing a chat client on Pharo?",
"question of lazy guy: are you writing the text by hand? or youre editing it with some kind of editor?",
"4?",
  "(btw,are there three Pavel Krivanek users here?",
"btw  ... since you are playing with that... can I ask you to prepare the welcome browser for Pharo 6?",
"where?",
"This list is filtered for GSoC no?",
"Is there some big changes that might break iceberg?",
"Also has anyone here been able to communicate with Mongo >= 3.0?",
"How do I create an empty slice to correct a bug with a post load only?",
"Remove-ConfigurationOfMooseAlgos-from-the-image),Should I add the noMonkey tag and wait an human review?",
"Do you want me to do the change?",
"too late for it?",
"whats is about?",
"was there any other output from the board meeting except theme change?",
"2 years already?",
"is it a bad practice to compile 1MB XML file into a method?",
"is there a common practice for ordering from and to attributes?",
 "`anElement addOwnedAttributesTo: aClass` ? whats the receiversresponsibility in your example ?",
"can someone give a definition to put to my pharo wiki as a test ?",
"is this something that rings a bell? Any idea to easily know which directory that was?",
"extra advice?",
 "can it be disabled all together?",
"So seems to be called by the PharoCommandLineHandler too?",
"Last time I tried,I found some problem. Have you got a chance to investigate them ?",
"dont know what to put at `spec`. Any hints?",
"in a string ?",
"What do you mean?",
"Zen. There is a way to do it?",
"Have you got a chance to investigate them ?",
"is there some other problem I dont know about?",
"what happened?",
"where should be the method?",
"how to reproduce?",
"can we have two instructions in the readme?",
 "Do you support the dark theme in OpenPonk?",
"Why to `RTElement`?",
"Maybe to `RTView`?",
"what kind of dependency on config is that ? is there domain code in configurations ?",
"I tell the mac app in the dock to open the Pharo 6 image?  Is there a better place to ask this question?",
"time.  or can it. is it possible for a Method to start up more images on the same vm?",
"error KeyNotFound:  key #NewListModel not found in SystemDictionary.  How did you load Seaside into your Pharo 6.0 image?",
"one vm opening multiple images at the same time sounds cool. what is the Method that does the opening?",
 "By method,you mean in the vm?",
"but isnt that two different vms running in two different processes each with its own image when you do it via two command lines?",
 "Thank you,kind sir.  1.  Is there a way I can reply to a post here on Discord?",
"question on the mailing list?  3.  Can I ask a question on the mailing list from Discord?",
"whats the equivalent to loading a BaselineOfXXX a la below Gofer snippet to load a ConfigOfXXX??",
"Hi,could anyone,please,help me with JSParser from SmaCC?",
"Wow Peter.  Would that be with U2F?",
"Hum... I cannot log anymone on Inrias CI. Does someone have the same problem?",
"How does one pin messages in discord I wonder?",
"Is there something you wanted pinned?",
"Wow really?",
"my pinned messages I need privileges?",
"Okay so how do I pin messages for myself like we used to in slack?",
"and did you vote also?",
"that is loaded into the system?",
"Is there a way to have more than one `SCIMetacelloLoadSpec` in `.smalltalk.ston`?",
"the value of `#loading : [ â€¦ ]` is a list,no?",
"Does anyone know of a good guide (or if its even possible) for using modern system fonts in Morphic?",
"@darth-cheney#2128 what do you mean by *modern system fonts*?",
"Or take it a step further,what if I want to use a webfont?",
"is there some documentation somewhere about Athens?",
"so what we have in pharo image to trigger CLI commands ?",
"what version are you using?",
"(of image?",
"and... ?",
"windows?",
"linux?",
"mac?",
"vm?",
"sources?",
"do you have them?",
"did you loaded something?",
"can you try with a fresh image?",
"why like that?",
"why not UFFI  ?",
"how is that possible ?",
"ctrl+c?",
"but hows that possible ?",
"keeps track of the live objects and the changes keeps track of changes to source code?",
"How would that work Phil?",
"Some do-its wouldnt make to the changes?",
"or would literals be stripped away from them?",
"Wait really?",
"Does github have a syntax highlighter for smalltalk code though?",
"so... you can add it and submit a slice ?",
"Esteban,what happens if I have installed cairo 32bit and 64 bit and the path I give answers the 32bit one first?",
"will ffi just ignore the 32bit one and go on until it finds the second one?",
"Isnt the `config` command line supposed to load a project with Metacello behind?",
"What is the preferred way of loading iceberg?",
"still?",
"issue?",
"HI! Is it possible to create #sprint channel and give me administration permissions to this channel?",
"more elegant way of executing a CLI command without waiting for it to end ?",
"anyone here has success unzipping files with Pharo ?",
"am I doing this correctly ?",
 "do I need to somehow enable git long paths for Icebergs git?",
"how can I enable it though?",
"why the pin?",
"Hi! Do you build images on Travis/OS X using Pharo 6?",
"times. Is it known issue?",
"We should post Pharo Twitter here. What do you think?",
"open?",
"I think in the team of   made something with twitter and pharo... or it was  ?",
 "does Iceberg not create `.filetree` entry?",
 "do you try it with fresh downloaded image ?",
"maybe loaded with a configuration?",
"dont we have here in discord a commit log yet?",
"with what?",
"startup by doing:  `Smalltalk vm maxExternalSemaphores: 65535`.,?",
"Hi Sabine,what is your current setting for this value if you evaluate:,?",
"creating  alot of objects at startup?",
"Is there a room I can ask about spec or Glamour or even Block?",
"What is the correct way of listening to the delete event on a Spec ComposableModel?",
 "Do you use an actual vm?",
"so you have somehow to get the window?",
"btw,maybe asking in the mailing list is better?",
"I also feel we should have a Spec room?",
  "Spec room?",
"message. I remember that  is in holiday this week?",
"really? he came back?",
"Has anyone been able to use MongoTalk or similar to successfully authenticate with a remote Mongo server running >= Mongo 3?",
"to admin it ?",
"session is dead,the code here check ... is no longer executed.,Anyone already implemented sth like this?",
"`CustomHelp`?",
"to discuss building UIs in Pharo. Or is the idea that questions of this nature should just go in general chat?",
"If I want to run an Pharo 3 and Pharo 4 images,are the latest VM versions compatible with those images?",
"Right,which of all the ones in  should I use?",
"SendsDeprecatedMethodToGlobalRule-might-be-hard-to-spot,Do you think it is easilly feasible?",
"Why does a Spec ComposableModal have both of these private variables: announcer and announceur. Whats the difference?",
"#announcer method in ComposableModal overrides that in Model and then returns a different announcer. Why so complicated?",
"since both variables get assigned the same type (:= Announcer new),why cant they share the same announcer?",
"huh?",
"basic example of what?",
"so when:do: is part of the announcement framework?",
 "also what were you using OpenPonk for?",
 "What do you mean with instance variable announcer?",
"Anybody with QMagritte background here?",
":(  .... why ???",
"How do I add contents to a file?",
"Hey Mr Bot. What is roassal ?",
"(unless you have tens of thousands of elements,then maybe?",
"care to share a scheenshot ?",
"list?",
"Currently the stable VM has the new compactor right?",
"how you managed to change the theme for GTSpotter,you hard coded it or you changed the methods ?",
 "can I pick what I am commiting in iceberg?",
"uh?",
"whats that?",
 "`estebanlm Merge branch dev-0.4` <- does this mean master should now work?",
"is a debugger?",
"Peter,just grasping at straws,do you have 32-bit pharo accessing 64-bit FT libraries?",
"or vica-versa?",
"Are there any systems tools to check?",
"starts it doesnt search for 32-bit FT ??",
"Can you search your whole system for multiple FT2Plugin.dll files?",
"or ,if we renamed our packaged one to FT2PluginPharo32.dll what would be involved in picking that up?",
"maybe something went wrong with the merge?",
"Peter,what version of Windows are you on?",
"are all FT2Plugin.dll same size and date?",
"also what virus scanners do you have installed. Perhaps (as a final option) try disabling them for a few days?",
 "is the DLL load order determinstic?  Does any of this look relevant?",
"related with Pillar,but I dont know how to load it. Any idea?",
"where do you download worklog project from?",
"has there been some work on this?",
"I need the opinion of a Pharo integration guy ðŸ˜ƒ Do you think this bugfix can go in the release or should we wait Pharo 7?",
 "what is the false positive? Maybe it is fixable?",
"just installed smalltalk,doing profstef and pharo by example 5 book. After that what would be recommended?",
"recommended smalltalk projects I might look at that may enlighten me on this journey?",
"www.youtube.com/watch?",
">FP is the opposite of OOP.,Not... really?",
"Isnt it srange that,,returns true?,,Not a number is a number?",
"But why?? Whats the point in having Not-a-Number if it is a number?",
 "what is infinity / infinity?",
"So how can I test if the value is a number?",
 "On what project do you depend to get this much problem with baselines?",
"Yeah but in the log you have Undeclared and Shadowed announcement no?",
"This is weird because if it produce the other logs,why not this one?",
"do you have a link?",
"does Seaside do model view controller like AidaWeb?",
"The Darktheme has been removed ?",
 "if I want to contribute to Iceberg... should I base my work on dev-0.5?",
"also,why is travis trying to load ssh-key when it is not needed?",
"and final question... iceberg seems to clone all repos mentioned in baseline... is it possible to tell it to load local repos instead?",
 "and a metaquestion: should I ask such questions here,in iceberg issues,ml?",
 "and the travis issue?",
 "Do you maintain the pharo.org site? How can I contribute to contribute-events page?",
"$DIR/pharo-vm/pharo $@,,Is this a common issue,or am I the only one experiencing this problem?",
 "is there anything more in stack?",
 "what do you want to do?",
 "Do you think black screen is show stopper case for releaze?",
"black screen?",
"what is that?",
"And this part is same for squeak VM?",
"Can you guys open images on mack by double clicking on them?",
 "Is it related to UFFI refactoring to make offsets platform independant?",
"Who is managing Pharo Associating registrations?",
"Can it be the issue with Roassal ?",
"But maybe this will be fixed when we will release Pharo 6 ?",
"Pharo 6?",
"Ive downloaded the version from bintray,but it gives me this error and asks to report it. Is there some known fix?",
"working version?",
"Can anyone help please?",
"download_file?",
"did you want 32-bit or 64-bit ?",
"Will it work with Pharo Launcher?",
"Do you mean call it from PharoLauncher?  Or that it will run PharoLauncher app?",
"can mac osx users confirm?",
 "you can configure PharoLauncher to use the latest vm,can you not?",
"How are actually the recordings of smalltalk meetups done?",
"bad,as it seems to be for most smalltalk related recordings on youtube?",
"so you are asking for everyone to buy professional recoding equipment because they will make a techtalk once in a whole year?",
 "when no one is using a microphone how can it be then that there are sound recordings?",
"well this is certainly not fine image ",
"what is not needed? resolution higher than 360p?",
"Has anyone done some graphing of the vm garbage collection behaviour over time?",
"Did you take a look at pony?",
"no,should I?",
 "are you sure that pony is worth a look?",
 "what do you mean with Im using Pharo for the long game?",
"how stupid is it to use global variables for singletons?",
"can I call methods directly on a Trait?",
 "Why does it tend to break the system?",
"I wondering STON do not support wide symbols?",
"How you discover changes problem?",
 "> I am putting UPPERCASE things. Uglier,but works <,Do you mean for pool variables?",
"Hi all whats the correct way to fork a process that then executes some block every XX milliseconds?",
"warning. Is there a way to provide a suggestion for correction?",
"socket?",
"are you going to be present at pharo days?",
"but is it possible to run QA on code in a scripted way?",
"Hello,How can I create a separate channel for neural networks?",
"perhaps the channel can be broader to cover genetic algorithms,and other learning systems?",
"machine-learning ?",
"Just to consider how much to be conservative about proliferation of channels,why not #polymath?",
"So my fix with no condition is correct?",
"why?",
"this is your solution?",
"Last week I was speculating about snapshot being done in a forked-VM.  A possible??",
"window via OSWindow??",
"How to use FFI in the way that image can be copied? Do you agree that we have issue now?",
"own BoundedBeacon thing?",
"Ok. So will you add startup or me?",
 "Where can one search the discord messages?",
"in the search box?",
  "here ?",
"am I misunderstanding the question?",
"So are there registered logger catching all signals and ones with ...during... doing local stufd?",
"Possible?",
"Hu? How?",
"Has anyone done a Logger for Log4s ?",
"is it possible to render markdown inside the image?",
"is there a way to move the progress bar to the center of the screen?",
"are there any rules to how many ancestors a single MCZ will remember?",
"2 questions,there are here some channel specific to newbies? and,someone knows if Magma works on Pharo? if not,alternatives?",
"Thanks  There are some alternative on Pharo?",
 "I wanted to follow up TechTalk (btw,is that brother to SmallTalk?",
"I guess at the moment pharo-vm tracks opensmalltalk-vm as a subtree?",
"hehe,did you know Pharo had such warning?",
"What are the current blockers to either forking OpenSmalltalk-VM/opensmalltalk-vm to pharo-project/opensmalltalk-vm?",
"pharo-vm?",
"Was is the purpose of having the VMMaker mirror?   Just to provide traceability for the builds?",
"you mean 70s and 80s ?",
"Anyone having experience with a Cassowary-solver based layout engine here?",
"anyone has any idea what dependencies are in MCVersions?",
"how to correct the problem?",
 "but what are they for... can I ignore them completely if the commit order is properly maintained>?",
"can we roughly estimate how many there are users of Pharo?",
"But at least I already arranged the travel (flight,train,train). Any hotel suggestions?",
"1) are you a member via the consortium?",
"marcus has the code  can you send him a mail to denker@acm.org?",
"hey guys are there docs/books anywhere for writing FFI stuff?",
"help me?",
"Could the fact that 96.7% of memory is used be the reason?",
"system?",
"Do you have code to try this out?",
"with,,Will adding more memory make it work?",
"Are you on Mac,Win,or Linux?",
"I guys. How can I convice Opal to compile a method for me without putting it in a class?",
 "Cant you do that with a BlockClosure?",
"Am I doing it wrong?",
"did you try this?",
"question: do you have a lot of inspectors open on the data?",
 "Try this thing,who knows?",
"Is this the kind of issue that should be reported?",
 "do we have fixed that?",
"drive.google.com/open?",
"Could also reproduce this locally; anything changed in the latest vm?",
 "How interesting?",
"Subscriptions hare giving leaks?",
 "if you run SystemAnnouncerLiveTest are #testNoDeadSubscriptions and #testOnlyWeakSubscriptions green?",
"changelog please?",
"What are Mirror primitives?",
"`Rename Pragma>>#selector to Pragma>>#methodSelector`==> Was it not revert?",
"how to fix it?",
"But Sista is not enable yet in Pharo,yes?",
"I assume it has to do with me clicking on Demote tp package with tag and then on Promote as package?",
"this...?",
"can I refer to the class that defined the code?",
 "UFFI porting question: what to use instead of NBExternalHandle?",
"what was that?",
"the equivallend of a Windows HANDLE?",
"Anybody working with XMLHTMLParser here?",
  "Promoting the last VM to stable... which means what? What is the supposed way to get that one?",
"locations. Is it zeroconf?",
"Or `get.pharo.org/vm60` ?",
"Any reason why the pharo-ui script on windows is calling PharoConsole.exe?What is the Pharo.exe for then?",
"you mentioned. Are HTML Entities in non-section parts even allowed by the standard?",
"How is one supposed to send stuff out in PharoConsole.exe?",
"Is site including Pharo5.0 big download buttons?",
 "We now have many class duplications around FFI. Should I choose one with FFI prefix?",
"properly?",
"What to put in the for: ?",
"Beacon instance?",
"or announcer?",
"the stream is kept open., any cool idea?",
"is there a good reason why MemoryStore lets me create folders with slashes in names?",
 "What are the things you are missing in beacon when you talk about log4s?",
"BeaconSignal.,FileLogger startFor: BeaconSignal,?",
"cant you just create `CompositeLogger` having a collection of other loggers to which it delegates?",
"them. So it is for compatibility?",
"So can we said that Pharo users should not use FFI classes without prefix FFI?",
"Is is possible to mock network in Pharo?",
"babymock?",
"spin up custom server (in a new pharo thread) and metalink out the usages?",
"how does one mock DateAndTime now?",
"reason for this behavior. Is that a feature or a bug?",
"never unstalled software from an image (and dont remember any documentation about uninstalling). How uninstall can be done?",
"is there a hotkey to move from the code editing window back to the message selector panel in the main system browser?",
"nothing else works,neither the world menu nor the keyboard shortcuts. Any idea?",
"anyone knows how to cleanly depend on GitFileTree from baseline?",
"What is profiling saying?",
"so,where can I download the sprint app?",
",You want that?",
 "how do you rate limit your tool?",
"thats apache config,isnt?",
"(..repository: github://pharo-graphics/Brick/src; load:#git:core ) should work in latest pharo 6?",
"options)) options: #(optCoerceNilToNull)      is bad?",
"Does Grafoscopio exist?",
"Is image resumption slower in Pharo6? E.g on macOS I see the beachball everytime I resume my image?",
"what is resumption?",
"can grafoscopio be somewhat be seen of as a Pharo-ification of pdf?  is it document oriented?",
"of documents?",
  "did I ddos sthub?",
"continue working on it. However,as I said I will defend soon and I have to find a job. How many job openings there are related to Pharo?",
"will work on a non pharo-related technology. Will I stick to the community?",
  "make a 1 man company that sells a result? like some kind of consulting? do you know of examples?",
  "it is using an HTML GUI from inside of Azure?",
"oh   is Asure easy?",
"Why CentOS ?",
"is there a way to deploy Pharo itself by some kind of download? is it possible to deploy virtual machine appliances?",
"to get Pharo into the Windows Store?",
"an appliance with a Pharo in it?",
"the html GUI cannot do which can only be gotten if you download the app isnt there something like that?",
"exclude such things.  they seem to insist on a certain flat Windows 10 GUI.  Like Roassal type capabilities.  Is Roassal MIT?",
"I am trying to get pillar to work under Linux. But I am facing issues when building the PDF. What are you using?",
"full TeXLive to get this working but do we need it all?",
"could you have a C# program that calls Pharo as a .dll? could one put Pharo into a .dll?",
 "is downloading all old MCZs of a project from smalltalkhub really that demaning on the server?",
 "did you see pharocloud.com?",
"do you know his full name?",
"also wasnt last year twice as many contributors?",
"Is it me or the `Halt if:` behaviour is strange in Pharo 6?",
"launching?",
"Anybody run into an issue where an image keeps freezing on *outgoing* network connections?",
 "which OS and VM?",
"Is there any way to reset the Network subsystem?",
  "pharo-vm seems  to not run tests after the build? How long is temporary?",
 "But self haltIf: works fine?",
"Anyone know the Font that was used to create the Pharo logo?",
 "What do you mean by I put bad my name ?",
"you know that you can add that to travis directly,isnt?",
"anyone with some known of Glamour here?",
  "still have a glamour question?",
"no?",
"first,a dumb question :). what do you mean by an extension to cherry peak elements?",
"do you want that elements for which the checkbox is clicked to also be selected like if the user clicked on them?",
"the  clicking on an element will deselect it (not just clicking on the checkbox)?",
"selection?",
"despite me having changed the string. What to do to reset that?",
"and I guess you are using Pharo 5?",
"Would someone with some knowledge of RPackage have a look at the ReferenceFinder package in the catalog?",
 "what if that does not happen?",
"I will try saving and repoening the image. Is there a way to do a shutdown/restart cycle without saving/quitting the image?",
"Thierry can you open a bug entry?",
"or..?",
"message i can send to it for it to tell me!?",
"There isnt a message i can send!?",
"I know that! now give me magic message to install it. Is that too much to ask!?",
"where do you get this reference?",
"someone try load ZincHTTPComponents in 64bit pharo6 and tell me if it works?",
"how did it crashed?",
"would it have been interruptable in that case?",
"oh! and this is super important: When it says save changes before quitting?",
"button to read dont save. Am I right?",
"or am i the only one stupid enough to press No when i actually want to cancel?",
"I make it a giant button saying Do NOT Save,u do know what youre doing right?",
"Pharo doesnt care what mac does,does it?",
"if newspeak is the answer,what is the question?",
"whats wrong with newspeak? What dont you like about it?",
"any idea when nicely bootstrapped image and module system might appear in the wild?",
"Is Gopher a good thing to look at to learn good smalltalk style/practice?",
"right/good?",
  "is this theme in Catalog already?",
"when did you try?",
"Im having the error I just pasted in #iceberg... thats your error?",
"but how *that* arrived to our ranch?",
"anyway. How this emerged here?",
"when commiting?",
"but what happens when there is something bad before?",
 "could you confirm if it doesnt affect git as well?",
"Has anyone done a private workaround for Opal to remove the 56 temps limitation in methods yet?",
"Also,who decided its a good idea to sub unknown super classes on import with Object,rather than raise an error???",
"Hi,how comes when I remove an instance variable that an instance method accesses my tests still pass?",
 "Could you mention those Epicea issues on the mail list for Martin to see?",
"PetitParser is not marked in catalog for pharo6? but its fine? Or are we using the new one now? pp2?",
"So use the one which supports (or youve already created a) grammar you need,I guess?",
"can I perform a compiled method on an instace?",
"Guys do we have a seaside channel here?",
"how does this work?",
 "Hi,we added a new member to Synectique team but she cannot access to our repositories. Is there a known problem?",
"Should we just wait before she can access them?",
"What the report button in the debugger is about?",
"It let me send a stack trace,but where does it send to ?",
"So,if I report my trace,this is just to help a PhD student getting data ?",
"now what?",
 "can I get from a RPackage to the IceRepository owning it?",
"wasnt there some work done around GTSpotter telemetry?",
"that?",
"robust part only theoretical?",
"as simple as it looks,can any familiar with FT packages confirm that? what are the planes for Pharo 7 regarding that ? do think that those packges should refactored and merged somehow ?",
"so basiclly  must target the Morphic-Widgets-FastTable in the first place ?",
 "does that mean that at some point i have to change/improve that Conf package?",
 "what is the plan for the location of the FastTable repo in Pharo 7?  And how to contribute to it?",
"reference.,",
"rebuild that VM - and where any hotfixes can be added?",
"smalltalkhub is dead?",
"Anyone know when smalltalkhub will be back up?",
"get error string],and when I go to settings,I see that says Freetype fonts are not available any clues?",
 "did you see the command-line options single-dash versus double-dash discussion on vm-dev?",
"both,which seems okay,but what is your opinion on --help showing only single-dash?",
"now... I just vaguelly saw the mail. Whats it about? They want to change it?",
"i never understood why double dash is used,is it because some parameters have dash inside ?",
"consistency with unix?",
 "the commit Beacon-Core-PhilippeBack.15 removed several methods from Beacon. Was that intentional?",
"missing?",
"interrupted in the middle of a `#wait`. Is anybody else experiencing this?  This might be one for you?",
"is there limit to class name?",
"if I have an array of arrays... how do I show that as a table?",
 "which Image / VM are you using (also thread-beat or itimer-beat) ?",
"happening?",
"pharo/5.0-201705091027/ . And before (February) it was flat. Was that intentional?",
"any idea why I have this behavior?",
"Good to know Sophie. Can you watch out for UI interactions when that happens?",
"Has anyone else experienced VM crash when inspecting a large doit?",
"is there a way to tell monticello to dirty everything in a given package so that it all commits to a new repository?",
"image into a new commit?",
"that? Should i create a case in Fogbugsz and submit a slice through the hub ?",
 "Im no expert,but that does seem to be the workflow. Have you seen the video demo of how to contribute?",
 "yes i am familiar with that. Let say i want to refactor some code and add some unit tests how do i do that?",
"if you are familiar with it,then I am not sure what you are asking... can you rephrase that?",
"wont they be automaticlly moved to Pharo70Inbox if they didnt make it to the P60Inbox?",
"Q: is there a way to compile a method into a dead image?",
"Isnt that related to how the automation build is configured ?",
"Hi peter what do you call a dead image?",
"right ?",
"what do you mean that on building that?",
"are epicea changes applied backwards?",
"How will work the backport of bugs correction during Pharo 7 development? Slice system or new process?",
 "What exact methods are missing?",
"me that you maybe already developed something that collects information and sends them to a server (for the QualityAssistant ?",
"or tell me where I can find it ?",
"hey . Sure,I will let you know. Yon need some kind of spy,right?",
"can you give me more details of what exactly you want to collect?",
"why not make it instance-side too then?",
"is there a plan for Calypso to replace Nautilus?",
"Maybe it is OS dependant?",
"have you tried turning it off and on again?",
"Do you thank the number plugin changed since Feb?",
"color alpha` showing?",
"is some English native speaker here to check the release changelog?",
 "Did you see my PR to it?",
"@everyone Does somebody know who is the owner of ?",
"Are you loading Beacon from smalltalkhubs pharo/ team?",
 "Is there a CI for Ghost somewhere?",
"I always had all tests green. So I not know what is your case? Maybe old VM?",
"Anyone is using Pillar ?",
"> Does somebody know who is the owner of name?",
"you mean?",
 "What is TexLive ?",
"what is this comment?",
"the docker image,how big is it??",
"3.5G just to be able to compile a pillar document?",
"But is Pillar a dead project?",
"Why would pillar be dead?",
"Do you get the ./donwload.sh working.?",
"so,how do I install the `docker` command ?",
"Are you on macOS ? (version?) or Linux (which?",
"So,got the docker command?",
"I have installed docker,what should I do to install pillar ?",
"typing `docker run --rm --tty --interactive --volume $PWD:/work dpollet/texlive:pillar COMMAND` ?",
"what should I do with $PWD/work  ?",
"alpharef = f56970a44fd4 ?",
"something like that?",
 "Did you got the download done?",
 "does fastTable presentation suppors conditional menu item?",
"Just wondering: do you find really useful to add a space after a completion occurs in Pharo?",
 "does it mean for example that rename should be shown in class menu when class is not selected?",
"Everybody: Who would like to have no space after a completion ?",
"why dont you like the space?",
"Have you tried to switch it off?",
"a space?",
"speaking of which,does it bother anyone else that autoformatting strips trailing periods or is that just me?",
"to reset all that machinery?",
"I think someone asked for reprodutible cases of execution that could not be cut with `cmd+.` some time ago?",
"confirm that you have loaded OSSubprocess into the images in which you have observed the issue?",
"Are you saying that you have both packages loaded at the same time? Or do you see the problem also with OSProcess alone?",
"Smalltalkhub is dead?",
 "Not quite yet,but hopefully close. Just to confirm: youve loaded OSProcess,*not* OSSubprocess?",
"Is there a better way to do this?",
  "why not add an extension method for what you need?",
 "Can you state what you want to achieve?",
"collection is not aCollection right?",
"loading OSSubprocess changes the scheduler from the default to the millisecond one?",
"Isnt there a remove:ifAbsent: ?",
"Hi guys,do we have an `OpenCL` API from Pharo?",
 "given that this shouldnt have anything to do with Fuel,does `3.3 basicIdentityHash` also fail?",
"do we have FIFO-fixed-size collection?",
"like a buffer?",
"nobody?",
"Is that threadsafe?",
"Why am I getting things loaded from Pharo60Metarepo when loading projects in Pharo50?",
"How did you fix it?",
"Patched Catalog?",
"How so? Isnt gopher just loading single packages?",
"How so? Isnt gopher just loading single packages?",
"will invest in that?",
"Is there a way when we have a method in an extension protocol to browser the packages entending the class in Nautilus?",
"You mean a kind of reverse link (from method to package owning it) ?",
"is there any recent bug releted to lost changes detection?",
"banana does not help.,Any idea this could be solved?",
"now have the timeouts when it worked in the past. Are the URLs not available anymore,or is the CI environment closed to outside access now?",
"network you can end up with the issues like now. And I dont know how to fix them (ask Inria?",
"Hello,has anyone get Magritte 3 to work on Pharo6?",
"I was under the impression that tests are inherited... is that incorrect?",
"display the icon in the,same column - directly beside the name? How can I do that?",
"Wer can I download PharoLauncher?",
"Which OS?",
"You are on which OS?",
"Which file?",
"I agree. But does someone know how to release it since Damien left?",
"Damien left?",
 "do you want to have a column icon?",
"Does anyone know of any work to integrate React and seaside?",
 "which presentation?",
"Do we have a morph that combines an image with a label already? In the same font as the other GT cells?",
"Morph: + addMorph:?",
"Is anyone here using Pharo to build applications for companies?",
"Alternatives?",
"maybe some garbage like this?",
"How do you add the highlighting to your snippets?",
 "did I just delete your message?",
"So everyone can delete the messages of everyone?",
"Is there a way to write classes without having to click in the browser?",
"compile is the method name?",
"Is that how you guys are writing these guys? Or are you clicking around in the browser?",
"60490 does not work with the latest VM ?",
"Someone know more?",
"so two mouse clicks I guess?",
  "But how you open playground?",
"why test?",
 "are you aware of my experiments with a modal keyboard-driven interface?",
"Ah,would be marvelous to have. Any GT booklet in the works?",
"Hello,i want to run my own monticello repository on my server,what is the requirements for HTTP repository for onticelo?",
"webpage with <li> items with packages? Can I access WebDAV directly?",
"Hi - so Ive taken the discord plunge - is there a channel for conferences like Pharo-Days? Or do we use the sprint one?",
"text color,text highlighting,fonts,and annotations. Does Pharo have anything similar?",
"Does anyone have knowledge of the system window drop shadow implementation in Squeak?",
"Is there any support for MS Word or RTF files currently in Pharo?",
"between Pharo and Microsoft Word--perhaps HTML?",
 "what is your use case?",
"call that via Pharo?",
"@Damien so youre going to ship a smalltalk image to end users?",
"Are most people using Smalltalk in cloud applications,so the user does not receive a Smalltalk image?",
"So,,with that use case--do you have any advice?",
"applications,desktop applications,mobile applications,something else?",
"Im planning to write qualitative research software--what are you working on?",
 "all images are PharoX.0 or do you mix >=5.0 and < 5.0 images?",
  "which git commit was used for pharo-linux-stable.zip?",
"Okay,different symptoms then. If you do open Other.image does it fail too?",
"files?",
"can we just load sources into the image?",
"Hi guys,what would you demo to non-smalltalk people to show the meta-programming features of smalltalk?",
"useful things that others cannot do,would be the best I think. What would you show to them?",
"maybe detecting plugins by iterating subclasses ?",
"Anyone knows how to get the list of available archetype with Pillar?",
"why?",
 "did you see the above question which SHA1 was used to build the stable pharo vm?",
 "What is the testcase for the OSProcess issue? What are the symptoms?",
 "but how does it fail? fork fails? exec fails?",
"what is about?",
"Hi guys how can I save a Form or ImageForm into a class definition?",
"rather than reading it from a file each time?",
"to do it now or wait another year or until 2024,2035,...?",
 "there is no doc or tests that explain the Pharo conventions ?",
"Great but not written somewhere in documentation ?",
 "me too. But does it matter when we scope Nautilus with a search expression?",
"There is no `MethodContext` but there is now `Context`. Still I see references to `MethodContextÂ´ in the image. Is this normal?",
"Im making my first Metacello baseline. Getting an error that I dont understand,can anybody advise?",
"Can somebody tell me what name I am supposed to use / what I am doing wrong please?",
 "Do you have defined CommandShell in your baseline?",
"No,didnt realize that I need to...?",
"(Can I skip Metacello in some practical way,btw?",
"(Is there a dedicated forum for venting frustration while learning all the tools,or is one supposed to be stoic?",
"user interface. The Regex in IceHttpRemote>>parseUrl does not match and produces an IceError object. Is this a known bug?",
"who is admin of SquareBrackets github of repo ?",
"Is this happening when you run pharo from the command line?",
"work. Why the name change?",
"Is there a list of such chores?",
"The issue tracker?",
"UTC time?",
"So what exactly do we need to download to get the right combination - is curl get.pharo.org/alpha the right way to do it?",
"are you on OSX?",
"is there a way in the current Browser to implement accessors automatically for instance variables?",
"some hint?",
"PRVacojnConfiguration is nil - what is that? Shouldnt the metacello thing load this? Also,I was expecting a configuration of moustache to load - but Im not sure its loaded either? Am I doing something wrong?",
"If I download such new vm,then I can fix the problems also? Only replacing my current vm?",
"What is the canonical way to install the latest stable NeoJSON?",
"How does the project feature of Calypso work?",
"browseâ€¦ Is it related to Cargo?",
"handling that part of the interaction,no?",
"Anyone know the best way to install docker on OS X? Homebrew or direct download?",
"Anyone have experience using `#contentWriter:` of a `ZnClient`?",
"Isnt contentWriter for output?",
"Anyone has experience with parsing JavaScript code within Pharo ?",
"Smacc doesnt work?",
 "can you ship me you dockerfile?",
"vmTLatest60 | bash `. Is this the proper image? Any clue on why this is happening?",
"what kind?",
"so perform is always avoid stub behaviour?",
"and what answer for my question?",
 "and do you use #should expressions instead of assert?",
"to be able to connect to that slave. How is one fixing that or how is one setting the slave to be a Unix or macOS thing?",
"But a bunch of slaves are kind of dead or what?",
"Is it the smalltalk hub repo mentioned in the ci page?",
"libraries could report their health?",
"Ok thanks! Is it loadable in Pharo 4? Or just 6?",
"Ok thank you. Since we load the stable version on Pharo 4Â it should now load this one?",
"How do I create a world menu that populates when  moused-over (like finds a list of likely classes)?",
"Anyone have a good example of MultiColumnList with Spec?",
"I have a strange question. how was written smalltalk 80 and its  first compliler?",
"I dont know anything about Spec but shouldnt ComposableModel>>newList return an instance of FastTableModel now?",
"Is there no FastTreeModel yet?",
"Do you know what is missing?",
"How do you log bugs in Pharo6? Is it fogbugz?",
 "hey! could you help me with the git commit of what makes up the stable pharo6 vm?",
"voluntarily?",
"Does someone have experience with encoding here?",
"change inside a file? Because if it cannot change we can maybe get it one time then use it directly after?",
"Can you give me a bit more context? What is the sender chain that leads up to `#isDigit:`?",
"at: value + 1),#NAME?",
"Can you detail a little please?",
"So save the result for each characters found?",
"with the rest?",
"suggestions and proof reading. Anyone knows the repo to create issues about for this?",
"So if I do - `curl get.pharo.org/alpha+vm | bash` - I dont need an extra PharoV60.sources file?",
"So after the curl,I can then do ./pharo-ui Pharo.image?",
"pragma,they made my day. Simple but awesome. How many other of these little gems are there?",
"any idea why I cannot add a .travis.yml to my git booklet?",
 "I guess you looked at the <script> pragma users?",
 "Do you have an invit link for the seaside slack?",
"I cannot find how to kick travis for the new booklet?",
"any idea?",
"Can you link the git repository?",
"Or is it another one?",
"are open to suggestion. Wishes are welcome! What do you want to see as a future script-of-the-day?",
"Sometimes happens here that the catalog browser is empty,and the refresh button do not solve the problem..... some hint?",
"In order to FFI it should be sufficient to have the libraries in the directory where the image lives,right?",
"better? The implementation? The readability of the code? The performances? Is there new feature?,And also what is it missing to use it as the default stream in Pharo?",
"So it reduce the memory consumption and improve the performance if it doesnt copy all the time?",
"And do you know what is missing to get it production ready?",
"What are the plans for 7.0 on that front?",
 "are PPTextHighlighter//PPShaderGrammer your classes?",
"come back in 7  is one of them in 6?",
"Have been digging into Rubric. Is there any paper about it,besides rummaging through the codebase?",
"on P6?",
"about what?",
"is there a downside or potential issue with using a global mcz package cache?",
"how can I return string from vm in cmd line?",
"Someone knows why the #timesRepeat: inlining option is not activated by default?",
"How cool is that?",
"Does anyone know where the code for the one-click image is?",
"Hard to make them work? Why?",
"But btw. what is the difference to 64bits?",
 "is there parser for TOML?",
"Is there a Beacon tutorial somewhere?",
 "What do you see belong there?",
"something with the public key?",
 "NaCl may have what you need but looks like the library files are gone?",
"are you on aleph_1 yet?",
"Hi,what is the new link for the video transmission of the Pharo TechTalk?",
"Are you using Application Security?",
"Hi. The questions for the Tech Talk are to be asked here?",
"How can I serialize some packages I made in an image so that I can import them into another image?",
"yeah so in the monticello browser can I out to a file?",
"How can I set the compiler to format the code using spaces instead of tabs?",
"with comment?",
"Oops didnt mean to pin a msg for everyone,anyone know how to info that in discord?",
"In fact,where do pins go?",
"takano32#3932;does anyone know release of Pharo 6 load-map?",
"load-map?",
"what do you mean by loadmap ? roadmap ?",
"you are using P5 in production?",
"why you have memory allocation errors appears ? You change something on your server configuration?",
"takano32#3932; Thanks for teaching me Pharo6 road map(?",
"and start initiating images dropping on them?",
"yesâ€¦ you have to add sourcesâ€¦ cant we package the with VMs?",
"What to do about that?",
"How can I disable preview of windows from the taskbar in Pharo5?",
"with icon between the text and the icons. Is it possible to contribute to the page without a special right?",
"Is it possible to disable progress bar when running code which uses #do:displayingProgress:?",
"In the gtInspector,is there a way to access bound variables on subsequent inspector tabs?",
"access x,if I navigate seconds of the date?",
"how you would solve it?",
"Does anyone have good knowledge about text rendering?",
"I mean,does normal text rendering use Cairo under the hood? Isnt that vector based?",
"Did you checked the settings for the type of rendering FT2 does?",
"Nope. Is that a system setting?",
 "And how users will access such context?",
"#myVar?",
  "it could very well explain UnixOSProcess crashes on fork?",
"Looks like it... although,why would that be related to the gcc version?",
"not?",
 "in case you still have your chroot around. Do you want to try a simple fix (to the generated code?",
"How to download a 64 bits image?",
"options while still using git submodules. What would you do in this case?",
 "can you check if latest vm has correct symlinks?",
"anyone has an example of OAuth2 authentication in Pharo?",
 "What do you mean by get-files/60/pharo-mac-latest.zip ?",
"Ill read the playground bit,it will make it move forward. Where do I put the content? Slice? What is this content?",
"store?",
 "Err,why is defaultHelpBrowser in the Pharo6 image with a test bubble? If I click on it,I get its test being run?",
"Weird. Is that a feature?",
"Where is that code?????",
"Whats a common error/bug/reason that `addMorph` to some morph would end up putting the submorph at the Worlds `0@0`?",
"its the default behavior of `addMorph` to insert at relative coordinates?",
"I presume youve seen my experiments?",
"Anyone know if you clear individual pages in the play pages dropdown in GT Playground?",
 "I think you will need to merge the dtl changes to UnixOSProcessPlugin as well?! What is the process for doing that?",
"How can I see on smalltalkhub if a project is world writable?",
"Or to ask differently ðŸ˜ƒ Can somebody add me to the cryptography team?",
 "why not?",
"because anyone can just come in and break it?",
"Can I load an individual package from a repository using metacello?",
"you mean loading a package as a dependency?",
"Hi,how can I handle a named argument (like --path=<path>) in a command line handler?",
"What is the best way to write something at the end of a file?",
"cant find any reference,project or so....someone can coment about? or point where I can read?",
"Wondering,what is the size of an array slot ?",
"`Smalltalk vm wordSize` ?",
"It should,shoultnt it?",
"any idea?",
"Similar question: what happens with Strings ?",
"annoyances. Are these known issues? Can that pane of Nautilus be replaced? What other options are out there that would not take me out of the Pharo comfort zone? I use text editors with other languages; are there any packages to incorporate Pharo editing,e.g.,into TextMate?",
"> incorporate Pharo editing,e.g.,into TextMate?",
"is there a reason why we dont have a single stable viem on filect.pharo.org?",
"I thought refresh of inspector was fixed?",
"is not the case?",
"Why is off?",
"imagine seriously that we would be all working with an editor working half of the time?",
"because this is an example?",
"If I have an abstract test class. its tests are only launched in its direct subclasses and not all the subclasses?",
"Are you sure that the test fails?",
"How car I launch the tests of a TestCase class by code?",
"how large an image can we get now with 64-bit?",
"Is smalltalkhub flaky right now?",
 "Is this in 6.0?",
  "Is it possible to switch refresh on per inspector instance or only globally?",
 "Are there plans to change that?",
"should have a generalized mechanism to do that (and it should work for the sides and bottom of the SystemWindows). What do you think?",
"announce what?",
"was not that integrated?",
"is there some extra step to getting this set up properly?",
"Is it bad form to duplicate messages on the Class side when using the singleton pattern (via uniqueInstance)?",
"class. Can someone explain this method      | pathString |,pathString := Primitives decode: Primitives imageFile. . What is the Primitive class?",
"where is the method cattegorizer?",
"elements. Right?",
"pharo/pharo-vm on github contains a copy of opensmalltalk-vm. how can I find out from which commit this was extracted?",
"What is the difference?",
"than the Pharo3 debugger?",
 "oh I didnt consider to go back. It seems slower than Pharo3 as well?",
"is there something like keysCollect: in Dictionary?",
 "what do you mean? Something like associationsSelect: aBlock  but with associationsCollect: aBlock?",
"assoc value  ]) asDictionary ``,?",
"it only collects data on non-sensitive images?",
"does Pharo have another way to write a collection pipeline besides using parens?",
"each tags includes: #nosql]),sortBy: [:a :b | a words > b words]),copyFrom: 1 to: 3,ruby,some_articles,.select{|a| a.tags.include?",
"Under which package? SortFunctions?",
"How can I publish a package loaded from MC to github using iceberg?",
"Add package to the repo no?",
"Is their a way to do so?",
"can you explain more?",
"but why you cannot just use the method dict to get the names?",
"need to know its name. Why you cant use the name directly? Why you need to call the method?",
"similar in FileSystem ?",
 "Can you have you directory as a file reference?",
"Hi,I want to write something in the log file,can someone explain me how to do this?",
"What log?",
"PharoDebug.log?",
"What does this gives?",
"What is the intent you have with this?",
"Someone knows how to remove an object from a Bag ?",
"what kind of object did you want to remove ?",
"closed? the external program does not give any hint. Can I see if the file is accessed from another program?",
"Was the change to not require HOME never merged or reverted?",
"and something on Reddit,,",
"Is there a way to disable the hardware cursor?",
"did you try loading VistaCursors from the Catalog?",
"matthew_9f49#0389;Hello! Is there a WYSIWYG document (or even better: active essay) editor available with Pharo?",
"As an old Framemaker user I know the why. Why bother with bad UI when you can have good WYSIWYG?",
"Hello,is there a way to choose which method you want to execute at the start of an image ?",
"What do you mean by which method? Do yo want to execute some code at the startup of the image?",
"someone to contact to fix it?",
"can select pie wedges or bar chart bars. In Java wed simply override paintComponent. What would you look for in Pharo?",
"Yea,I think I need a raw widget,right? I dont think theres a canvas widget already that I can extend?",
"Does any here know if its possible to add custom command handling to Spotter?",
"Meaning? I added windows to that list with an extension. But custom command is what?",
"there some way of getting Emacs keybindings in Pharo?",
 "",
"Q: when saving image,does it perform a clean write?",
"the image?",
"something like mercurial or git cant be used,since the code is stored in the image.  What is the keyword to search for to learn how this stuff works on Pharo?",
"hi all. is there a favored pastebin to put some code so I can ask a question about?",
"Can Spotter be augmented to execute do it messages?",
  "Just use my QuickAccess (load it from Catalog),,",
"type ahead functionality for defined scripts?",
"something like a mind map?  What is a unit of knowledge?",
"matthew_9f49#0389; How do they work?",
"arrrrrghâ€¦ the method categorizer is driving my nuts! Is there already a way to submit fixes to pharo?",
"responsive and its quite hard to find anything up to date... or maybe I am missing where all the activity occurs?",
"heart is still beating a little I guess,what about the rest?",
"time and space,then how can one hope to abstract it in a computer program?",
"cant be well modeled at all?",
"Does someone know if there is a tool in pharo to detect if you have an internet connexion ?",
"space,then how can one hope to abstract it in a computer program?",
"matter.  Any suggestions or useful debugging information I can provide?",
"Any idea why?",
"Is the zeroconf script for 64 bit supposed to be working?",
"Actually checking settings - it says Free Type fonts not available. They have just gone walkabout?",
 "would you know how travis-ci matrix build combines scripts:?",
"Anyone wanting to see funny deployment issues?",
"@Esteban A. Maringolo#8129 your idea is to show methods and protocols with different color for inst side and class side?",
"so you can add both class and instance methods without having to toggle the radio button?",
"9 more videos online: ",
"Is it?",
"Anybody knows something about it?",
 "Sorry--Im too naive to catch the implication of that statement...can you explain?",
"Pharo 6 VM can no longer properly open Pharo 5 right?",
"Hi,how can I close a window with Spec?",
 "Are there known primitive failures with the pharo-vm?",
"Hi   :),Do you know if there is a way to disable critiques in Calypso?",
"What version do you use?",
  "but when you last time load it?",
 "Did you load it in fresh image or in the image with old calypso version?",
"Is catalog browser down only for me?",
"OSProcess does not work on Pharo6Â ?",
"Is OSProcess usable on Pharo 6 (OSX) or should I use OSSubProcess in Pharo 6 immediately?",
"released soon?",
 "did  you try one of the snapshots to see if OSSubProcess is working there?",
"Anyone knows to deploy a .html file produced by Pillar?",
"Why is there a root link ?",
"Are Pharo images standardized? Are they usable on other variants in the Squeak family? Can they be copied between different OSes?",
"But what does standardized mean?",
 "do you know who is managing ESUG registrations?",
"On windows I have trouble to delete a lot of files and folders. Am I the only one?",
"is it possible to install Pharo 6.0 using PharoLauncher? or is Launcher not mantained any more?",
"I was unable to find a way to activate dev mode in the World Menu/Settings. Can someone point me to where to make that change?",
"Roassal layout problem - anybody got a tip?",
"I think there was a way to use Roassal to visualize a ConfigurationOf baseline. Any idea how I can find this visualization?",
"read up on this?",
"Is there a separate channel here for Spec UI?",
"Is there a central go-to documentation for it?",
"Any example for a Glamour UI with a moveable splitter between panes?",
"I think any tabulator will have that?",
"Also,anyone got any idea why I get Freetype2 primitive failed error on a fresh image?",
"And getting an invalid access to memory location when saving?",
"OS?",
"Pharo version?",
"Did you install in progam files?",
"Weird.,What does the PharoDebug.log says?",
"Do you have this: ?",
"It says FreeType not available?",
"Do I need some dependencies?",
"Is your download looking like this?",
"Do you have old pharo preferences around?",
"Umm? Are they saved outside the image folder?",
"What is your system reporter saying about the VM?",
"Inspect FT2Face allSubInstances in the playground?",
"Do you have a PATH pointing to an older thing?",
"FT2Library current gives?",
"Maybe compiled wrong or something?",
"Whad does Smalltalk vm listLoadedModules  show?",
"Do you see FT2... in the list?",
"Can you send me your image and changes?",
"Well,when an image has been executed even once,it is not the same anymore. Did you save it?",
"Are you using 32 bits Pharo?",
"What it the PATH looking like?",
"Is depends.exe showing a missing thing?",
"You mean something like InnoSetup style?",
"So?",
"Hi,what is actually the current pharo-vm repository?",
"pharo-project/pharo-vm repository or the one which esteban has cloned?",
"What do you mean?",
 "what are orthogonal packages?",
"home/?",
"t0suj4#6460;Is there any project on network transparency?",
"Isnt that cool?",
"t0suj4#6460;I mean... recently Google allowed to send map position to my phone,why it wasnt possible five years ago?",
"One last question,any info if there is some kind of alt tab inside pharo?",
"To switch between windows?",
"What is the package named  ?",
"So is it full separate windows?",
"What?",
"Or what does the TilingWindowManager do?",
"Any other productivity etc. packages that would be essential?",
"And general usability?",
  "how did the SSDP test go?",
"your use?",
  "Im not sure I get you; multicast is already supported?",
"Is something like this planned? Or is this just some byproduct?",
 "Check this out:,,",
"and this one,,",
"How could one build a terminal emulator for use within pharo?",
"(if such a thing doesnt exist already)?",
 "Are you going to host pharo community servers?",
"this,do I need to remove the link after the test?",
"t0suj4#6460;how do you debug SmaCC grammars?",
 "but do you open them from CLI or by double clicking?",
 "wow,that works. So the newly downloaded image files are in quarantine?",
"What is the best way to mix writing ascii and binary values to a stream?",
"t0suj4#6460;Create a class and let its object worry about it?",
 "what is the current repository for compiling the pharo-vm from source?",
"t0suj4#6460;Who reads the reports when I click on Report in the error pop-up?",
"And rebooting helps?",
"Should I have a special Image to run on x64?",
"Where do I need to look when I want to find out the details of the image format?",
"takano32#3932;Where should I send mail to?",
 "Is there an ETA for your git migration tool to work properly?",
"what else do you expect?",
"t0suj4#6460;Is there any roadmap for Pharo?",
"Is there a way to change font of the Spotter input field?",
"Anyone else seeing that?",
"@takano32#3932 why not?",
"takano32#3932;String 5?",
"I would like to verify if I still have a core dumping bug in writing out a compressed fuel file. Where are the latest vms?",
"t0suj4#6460;Hmm... how do you refactor code that if is wrong,breaks your image? Saving frequently?",
"t0suj4#6460;I think it is allright to use any Image? Pharo 5?",
"t0suj4#6460;so commit everything into git?",
"t0suj4#6460;creating a slice?",
"t0suj4#6460;Im looking for more books on smalltalk & friends,do you have any recommendations?",
"you know the free smalltalk bookcollection?",
"Is there any documentation about the Packages metadata API?",
"What do people do with spec recently?",
 "What is a good example of this mix?",
"t0suj4#6460;Can please someone look at the Pharo fogbugz registration SSL issue?",
"@t0suj4#6460 whats the problem?",
"is it possible to modify commit history on smalltalkhub?",
"or should I just delete the repository,create,and upload the modified mczs?",
"Is there an appropriate way to parallelize I/O operations?",
"~450 of them.,Is there a parallel version of `do:` ?",
"Is it reasonable for N=450 i.e. one process per project?",
"Or else what N would be reasonable & is there a function for partitioning?",
"Seems to be blowing up somehow. I suspect (?",
"not showing up in the catalog you mean?",
"Is there a Configuration somewhere that corresponds to the default Pharo 6 image?",
"How do you mean?",
"into an image without toching the network. Easy or hard?",
"point to the exact files that I need for NeoJSON. So maybe I need to always clean out the package cache first?",
"Is it going to download packages that are already present in the image or automatically skip those?",
"too?",
"Do you think the repeated downloads can be handled with a local caching proxy like squid?",
"dont-cache headers?",
"operation,7.7sec are in `ZnCharactesEncoder class>>newForEncoding:`.,Maybe this encoder could be saved in a variable of FilePluginPrims?",
"change no?",
"To speed it up?",
 "how is monitoring organized with files.pharo.org?",
"How is responsibily distributed between team and sysops?",
"So you run on inria delivered hardware and are totally responsible for what is installed on that?",
"oit doe not effect anyhting else... and that is not that critical?",
 "Is there a reason for Slot to have an instance variable #index instead of IndexedSlot?",
"Do I open an issue?",
 "Hi,,,Could you tell me where I should look to add new item for Quality Assistant ?",
"your ``critiques`` ?,add new rules ?",
"Thanks ,it looks better now ðŸ˜ƒ Do you happen to know how to test the exception is raised?",
"You mean in a SUnit test?",
"Must I create an exception class to test it?",
"In this case,should I create a subclass for Error,or directly for Exception ?",
"takano32#3932;?",
"foldM_#5066;hello,does phaor vm do mutl-threading yet?",
"foldM_#5066;are there any plans on 7.0 ?",
"could anyone help me close/get rid of the debug console?",
 "Is there a new status of your git migration tool?",
"Hi,Why is that when I run Smalltalk snapshot:true andQuit:false in the terminal,the writing cursor goes missing??",
"Hello,I have some problems with pharo (Im new). Specifically,I have two questions. Is it OK to ask?",
"Am I doing something wrong?",
"You mean the Playground?",
 "Are you sure it works for you?",
"characters do you see in the buffer?",
"for this. Is there a Spec component I can use to achieve this?",
"I see. That sounds primising indeed. Is there some central documentation for Spec?",
"Has anyone worked on SCRAM-SHA-1 authentication for MongoTalk?",
"Is there an alternative way to implement a simple game loop (not stepping)?",
"non-blocking delay or similar?",
"or do I need to spawn a whole process for this?",
 "which is a problem when?",
"Are you generating a lot of garbage that needs to be collected?",
"Stacktrace?",
"t0suj4#6460;Is there anything to plot math functions?",
"@here : a question: how was to force an update with Metacello?",
 "You want to update the version of ConfigurationOfXXX?",
"foldM_#5066;is the system supposed to be unusable during loading of a package?",
"t0suj4#6460;What is the correct way to test abstract classes?",
"four days to figure out. Could be avoided by a test,but how do I test method in an abstract class?",
"highlighting appliead?",
"anyway,can you try with this workaround?",
"can you report this on the mailing-list?",
"Can Pharo,Squeak both learned at a time?",
"why would you want to learn Squeak?",
"But you found my sample code?",
"There is a paper from Japan written in 1999 about 128bit CPU. ?",
 "can you state your particular use-case?",
  "Those side-commits should be separate branches,shouldnt they?",
"Is it possible with spec to add a button without changing the code of the spec browser?",
"things do not work?",
 "what is the least demanding (on Sthub) way to download old MCZs?",
"letting Monticello/Gofer do its work?",
"Somewhere-PeterUhnak.6.mcz )?",
"or some way to download the entire project?",
 "What problems do you have?",
 "Did you install from smalltalk hub or github?",
"Hi Sorry for this bad experience. How did you load VoayegMongo?",
"Can you try using the catalogBrowser?",
"unsaved changes in your image. Do you want to load the image the way it was before the crash or to load the last saved version?",
"Is your antivirus interfering there?",
"the windows behind. With the white theme,I see nothing. Does anyone have the same behavior?",
"is there some logging for Pharo that can log certain metrics?",
 "New stable VM AND cherry pick on Iceberg the same day?",
"Now the question isâ€¦ How do I do to get the latest stable Iceberg in my Pharo 6 image?",
"Is there somewhere the issues wrt SqueakSSL on 64bit win is described though?",
"I have a question about CORS in Zinc. Does anyone have a ready example or snippet that one cane use?",
 "is your repo public?",
 "is it possible to run arbitrary git commands from iceberg/pharo libgit wrapper?",
"Hi,I want to create a class that is executed at startup,but I dont know how to achieve this. Can someone help me?",
"How can I remove classes on Pharo with code (not with the GUI) ?",
 "Do you simply want to delete it or do you want to unload it,i.e. be safe?",
"Pharo 6.0  ?",
"ok who is in charge of Magritte ?",
 "Is it possible to add me to the Magritte team,I would like to made some modications ?",
"isnt it better to just add a dependency in your project on magritte and specify that you want both Core and Tests?",
"What is the best thing to use in pharo as a text editor?",
 "You mean new download and all everywhere?",
"Recovering lost changes is not cool anymore?",
"Wait,TraitBehavior and Behavior dont use TBehavior anymore?",
"can you run a server with squeakjs?",
 "any thoughts on adding support for playground-only QuickAccess scripts?",
"tried to define on a baseline using the magical pragmas is not getting picked up. any idea how to debug this magic?",
"Hi ! Yes,Metacello is a pain to debug. If your code is not private,maybe I can take a look at the configuration?",
"Maybe this is my mistake..?",
"Maybe I can use the package cache as a repo?",
"So maybe I have a typo in my pragma or something?",
"this code yet. Could that cause the version to be quietly skipped? (I would expect an error at installation time but maybe not..?",
"Oh its supposed to be on the instance side?",
"official default. But how about if just now I want to load from a local `filetree://` instead?",
"or something?",
"Is there a way using metacello to load a specific package?",
 "Cant you add multiple repositories to the same conf?",
"Hm... How do you tell it to load from Github?",
"are you using inria jenkins?",
"below is very small. I tried out the increasing font in appearance section in tools. How do I change it?",
"can ubuntu just render Pharo 4 times larger?",
"Anybody know a good webdav client?",
"values and ivar and so on). SpaceTally seems to go by instances of specific classes. Is there a way to do this?",
"Does anyone know if it is possible to add a timeout for a process ?",
"is it possible to show only data when profiling UI that has certain class in the call chain?",
"it?",
"what is `menu`?",
"is smalltalkhub running for anyone?",
"can we download a 64 bit vimage with zeco conf?",
"Is there a way to transform a string into a a string usable as a file name?",
"*cough* How about ?",
"the esug program is online: 2017?",
 "Are you going to ESUG?",
"80% probability or 80% of the congress schedule?",
"@cyril are you coming nevertheless?",
"Pharo 6. I am the only one getting problem with #ensureDelete?",
"Oh,apparently #ensureDelete is only for files and #ensureDeleteAll is for directory?",
"Is there a plan to release a new stable VM for Pharo 6?",
"question: How does Pharo handle changes in object format or methods?",
"calls,etc?",
"How can I switch a smalltalkhub project to read-only?",
 "You mean that only the owner and contributors can write on it?",
"Youre moving Beacon?",
 "did you use git-migration to move from sthub to gitlab,or something else?",
"can i ask something?",
"So,the conclusion is: it is not possible out of the box. what would you recommend?",
"and how do you keep your local repositories in sync with your gitlab repostiory? manually with scripts?",
"Is anyone here using phexample?",
"this?",
"element and go last?",
"whats the access control on STH actually like?",
"still only team members and contributors?",
"how can I remove all the metalinks from a method?",
"Is is enough to call `destroyTwin` or I have to recompile the method?",
"this?",
"anyone else run into this issue,or know anything about it?",
 "Im not aware of any such issue. Are you doing anything special in that app? Any use of sockets,FFI...?",
"Which server adaptor are you using?",
"nil slots?",
"is there a way to kill idle connections to prevent the table size from being increased?",
"Just a thought ,wouldnt it be possible to have some kind of sensible timeout on the sockets?",
"it might be OK to close a socket if no data  have been sent either way for 30 min.?",
"asTempFile` answering a filename like `/tmp/tmp.94C6Wob2Ud` that contains the string for contents. Any pointers?",
"Hey guys,is it just me or SSL plugin strictly requires libssl version 1.0.0  ?",
"are you running 32bit or 64bit?",
"How do I tell Metacello/Monticello that I want to work with a project on filetree:// rather than its real location?",
"there? (Metacello browser seems to only show the github repo where I loaded it previously...?",
"Monticello browser,you mean? Or is there a Metacello browser too?",
"a fresh image)?",
"directory I mean?",
"Iceberg... Is it a good idea for me to try that?",
"productivity... Iceberg is a bit too early for me,right?",
"usable for who though?",
"having to click my way through the directory tree in my home directory. Is there a trick to make the typing work?",
"like I have seen this before and there was a complicated explanation,but I dont remember any details :). Familiar to anybody?",
"hanging... something about processes and broken semaphores or something... that OSSubprocess somehow works around?",
"Is it possible to write in a file in a memory store in an image and to access to this file from another image?",
"where there is a will,there is a way ðŸ˜ƒ whats the use case?",
"at least from the kernel perspective... maybe its within pharo that its expensive to put it into files?",
"what do you mean by in memory file?",
 "Maybe profile? Could be that e.g. some unwanted character set encoding is going on or something like that?",
 "is it impossilbe to clone Pharo repository even if the directory is placed in root?",
"I can imagine,but have you tried to place it e.g. in d:pharo ?",
"`#packageManifestOrNil was sent to nil` WTF?",
 "What Pharo version?",
"is there no pharo launcher with pharo 7 images?",
"is there a way to integrate external projects into Pharo 7?",
"Can this be done as other contributions?",
"or there is another process?",
 "can I do this from pharo?",
"#v1.2.5),,ist this not possilbe with gitlab too?",
">  Uhnak can I do this from pharo?",
 "we should try to experiment with path prefixes ?",
"how can I even make Pharo 7 work?",
"does Pharo Launcher support 7 images?",
"so all images are now twice as big by design?",
"the condensed sources were working in past in squeak,right?",
"another question is speed... how slow woud this be?",
"Is anybody saw Pharo6 crashes due to freetype?",
 "What is this prefix?",
"downloading a Pharo project az zip from GitHub?",
"shouldnt it be 64bit?",
 "and it was changed when monticello loaded to bootstrap image?",
"you the memory overflow warning. Was it always like that?",
"or was I supposed to start from a new image ?",
"is it really well known by everyone how ifNotNil works?",
  "I tried to add `?",
"sergio_101#7383;also.. a general question.. what prompted the move here from slack?",
"Anyone knows if PharoCloud ephemerics is down?",
"Anybody had such problems?",
"But... this is 64 bit vm?",
"It has the same dependencies as 32 bit?",
"pharo,Downloading PharoV70.sources:,sources.zip,Creating starter scripts pharo and pharo-ui,On a 64-bit system?",
"do we have a vm channel of any sort?",
 "maiby we should add your simple fix for critiques in Pharo6.1?",
 "which one?",
"What the idea behind extra folder in setting browser for tools?",
"Also - are load times for images faster with the 7.0 VM (I think Sven said they were)?",
"Is there a nice way to get message sends of a method?",
"registed instead of a rule that does that?",
"Why did it fail?",
"Is it during ast computation?",
"How can I look for methods,which are sending more than one method?",
 "thank you! No possibility from the UI?",
 "is `remaining` used somewhere else ?",
"One of my student loose his password on SmalltalkHub. Who I should ask to change it ?",
"Is there a way in Calypso to add a subclass of a class?",
"what is everyone currently using for data persistence?",
"sergio_101#7383;did you have any issues?",
 "Is the fuel example so that you can read the error back in and bring up the debugger again?",
"What model is that?",
 "Is there an issue report describing the problem?",
"debugger with something that fuels out? How large are the files ?",
"Im interested from a lambda perspective - could I efficiently write out to dynamoDb or S3?",
"Am I right in thinking that with a similar local image you can read in the context and just step around?",
"dump?",
"writes it out (or wrap the start of your app in an error block?) - then cron to mail it out?",
"Is there a hook method that is called whenever something in a package is saved (eg a method updated from Nautilus or Inspector)?",
"it is valid?",
"i doing wrong?",
"repository. Any tips?",
 ": How is that different that filetree:// ?",
"what is the best way,to store exception and debug it later?",
"Ok,I figured some things out. Now my main question is: how do I keep the sender chain?",
"is there a recommended way to encrypt passwords,for example,to be stored in a db,in pharo?",
 "That really depends on your use-case. Could you tell us something about it?",
"Are there any examples of Magritte with Specs or Polymorph?",
"How can I maximize a window in Pharo and keep it maximized even when the desktop/world is resized?",
"I want to do this with GTInspector. Could be an idea to bypass the SystemWindow and put it straight onto the World even?",
"Is anyone using RFBServer with the 60 images?",
 "this the one?",
"Hi.How can I put the char in a string with Pharo ?",
"dependency?",
 "Is that version available somewhere?",
 "Can you add this line `spec for: #pharo4.x version: 2.45.` to the #stable method of StateSpecs please?",
"But what exact reason that it is not loaded there?",
"github:// url is not supported?",
"interesting why you still on pharo4?",
"you are doing sinectique,right?",
"Shouldnt it be 2.2 for Pharo 4?",
"Is there a reason why github-cache etc. are not under pharo-local/ directory?",
"And do you know the purpose of this catalog?",
 "SOmehow dlopen seems to fail for me on macos? Have you seen it before?",
 "is that known?",
"Hi.How could I print in the shell more than 20 characters with a StdioStream?",
"like a 20 character limit?",
 "I forget to tell I put also String cr and String tab in my stream.Has it an importance?",
"Is there an easy way to switch control/command keys?",
"so `shouldnt: [  ] raise: Error` in tests is considered bad?",
"ci.inria.fr is down?",
"Does anyone know how to execute code without showing Warning ?",
"wrap it in an on:do: handler?",
"I am wondering,is there a way to remove it from the startup list ?",
 "I do not understand. If I use Jenkins for what?",
"July newsletter was send out yesterday: ?",
"image. Anybod experiences the same?",
 "You mean the small window?",
"Btw. is bootstrap ready for prime time?",
"Is these kinds of situations salvagaeble,or should I just download it again?",
"Where can I find the latest Raspberry Pi VM?",
 "Can you send me a changeset of your project?",
"How do I send files to you directly?",
 "working on a game in Pharo?",
"example) I would like it to interact with the backend via a REST service.  Is this a silly idea?",
"what are the current known ways to interface C++?",
"Could you point me to a good URL where I could download a correct Pharo 6.0 changes sans CrLf ??",
"doesnt matter. key question is - does it run?",
"OK,yes,I know its udner development,but to the point of hanging the whole image?",
"the command line and pharo-ui?). I did wonder if in headless mode we simply need to set some window size variables - I havent had a chance to look? Or possibly have a window sizing script to run when launching a new headful image?",
"is there a pharo launcher that supports Pharo6?",
"Thanks,thats good to know. What OS are you running Pharo in?",
"makes 100% sure that there will be an object that insetBy can be sent to?",
"Did you try to reload the package with changes in a clean image and to see if the errors is still there?",
"Good idea,will try that. Is  the simplest way to just rename or delete my changes file?",
"Do I reanem them to just pharo.image etc. or should I keep the numbers in the filenames?",
"Did you place the new .image in the same folder as the old one?",
"What is in golgotterath.st?",
"OK,does filetree detect if files have changed (if I do a manual git pull)?",
"wrong or how I can debug this?",
"morphs open in the world?",
"draw everything again,or should I remove /delete things before drawing them?",
"Does anyone know if there is some event you get when loading a package so you can run some setup?",
"class and #startup?",
"Is there an easy to use implementation of a quadtree for Smalltalk somwhere?",
"if theres a way to see inside Pharo what might be spinning so hard?",
"how many morphs?",
"and what that morphs do?",
"Thanks,I thought so too!  Any smoking guns,or could I just start to kill processes until the list look like yours?",
"I have no idea how those got there. Can it be exceptions that have become headless in some way?",
 "how about a class side #initialize?",
"good place as packages arent actual classes (wonder if Cargo will change that?",
"How can I programmatically resize the system window/World (not exactly sure which one I want)?",
"Or maybe theres a VM startup option that does that?",
"How can I change my mouse settings in Pharo 6?",
"What kind of settings are you looking for?",
"Switch buttons? Double click action? Sensivity?",
"Hi all! Anyone knows which is the live presentation software that Alan Kay use in several sessions?",
"Pharo or there is anything to build lively presentations in Pharo?",
"What do you mean by presentation software?",
"Anybody else a consortium member here?",
"No,what is it?",
"watch?v=ubaX1Smg6pY&feature=youtu.be&t=47m5s  Its known as Frank. Anyone know something about it?",
  "Any idea why Socket newTCP would ever fail?",
 "Hi! I tried your package,but it does not contains resources. Where are the pictures?",
"you think they may be related?",
 "right now I just wonder if you have seen this before?",
"errno 22. just on macos or on other platforms too?",
"files to the package itself,is that possible?",
"Anybody knows what this means?",
"Help browser can show colors and font sizes?",
"@Esteban A. Maringolo#8129 at what point do you get this xerror?",
"Thanks   ! I will do so  as soon as I get back to the game code again. Where can I find this help?",
"Hello.How could I execute a compiled method?",
 "In aReceiver,what must I put?",
"What object should be receiver during method execution?",
"had this?",
"maybe icerberg?",
"Im not sure where the AnObsolete prefix is coming from?",
"code .  In the future,whats the best way of finding legacy references?",
 "how are you going to get to Maribor? I remember you mentioned that there are flights from Zurich?",
"what web site you are using?",
"t0suj4#6460;Is there anyone playing with Arduino?",
 "Do you have the list?",
"either. does anyone have an idea of what is going on?",
"Do we have an adaptable tree-based cherry-pick tool?",
"t0suj4#6460;How do you install a project from smalltalkhub?",
"t0suj4#6460;Does anyone have information in using smalltalk in embedded?",
"files/pharo.png asMorph openInWorld,however this fails with,Instance of StringMorph did not understand #asZnUrl,Where am I making a mistake?",
"is there really no key binding to to cycle windows?",
"Does anyone have any advice on doing a server-push in Seaside?",
"Is there a cli option for the VM to print all message sends?",
"Did you try ctrl+w or alt+w?",
"t0suj4#6460;I have a system with ARCH=armv5tel,is there support in the vm for this?",
"problem somwhere. What are the processes doing that you need to kill?",
 "Hi,sorry for that issue. Did you use latest Calypso version?",
"system?",
"I need to do something else?",
"t0suj4#6460;hmm,how well would pharo handle lack of FPU?",
"@t0suj4#6460  What do you mean by FPU? Float Processor Unit? Why do you say there is none?",
"@t0suj4#6460 it depends. First the soft float implementation in glibc is not too bad and second what do you want to do?",
"problem?",
"Does anyone know how you open a debugger on a de-fueld context? I save one out on a server and I want to try and view it?",
"Apparently I cant use Discord over VPN ?",
"Hi all. Maybe catalog.pharo.org is out of service?",
"@t0suj4#6460 if you start a project right now. Why not something more modern?",
"can discord be configured to send a mail when someone sends me a private message?",
"shouldnt there be an image version/commit id (`b1625bf`) instead of `#0`?",
"writing of the file is finished?",
"Any Scala devs here doing Pharo/st?",
"lengthy,but maybe this is what you have to do?",
 "I do some scala part-time,why?",
 "Wow? doing some paid dev with Scala?",
"hey,how can I add an inst var to an annonymous subclass?",
"Any clue why travis builds are failing by getting stuck while downloading Pharo images/vms?",
"Any idea what they do with it? Did they write small scripts?",
"whats amazing about using scala?",
"I somehow dont get,why that happens. Suggestions?",
"files.pharo.org/vm/src/vm-unix-sources/blessed/. Is 2016.07.16 the most recent one?",
"Is there any url in CI with specific version numbers,instead of stable as in ?",
 "oh neat. I redid the NixOS pharo packages recently but it hasnt landed upstream. want to try that?",
"so arbitrary?",
 "I get an error. Have you seen it before?",
 "Havent seen that. what command are you running?",
"t0suj4#6460;where can I find info about Slang?",
"talking about this slang?",
"What actor libraries are there for pharo?",
"current state of it. Maybe you know?",
"any idea what can be the problem?",
"Hello,,Could you tell me where I can find this settings file?",
"Should I also remove TUASettingsDevelopment.st?",
"Great!,Now should I remove TestsUsageAnalyser and CORA packages from System Browser or from Iceberg?",
"Have you disabled TUA from system menu before ?",
"How exactly can I disable it here?",
"Any ideas?",
"Which OS?",
"does anyone have the slightest idea how to change the font size of any TreeModel?",
"Since MultiByteFileStream has been deprecated,what should we use?",
"Did someone did performances tests to ensure it will not take longer to use the new stuff?",
 "the changes sits in a read-only directory?",
 "was it reproducable?",
"version (blabla.876 for example) from the playground/a program execution ?",
"Hello,Im getting this error when trying to push a commit,Can someone help me with is?",
"and its not clear whether following the instructions actually helps anything in practice?",
"this?",
"purge those specific sessions)?",
"huh,it is possible to have multiple different classes with the same name in the system?",
"How come that is a problem though?",
"than adequate for cmd-dot?",
"than preemptive-at-millisecond-granularity threading?",
"Lambda I cant adjust anything,and as I was getting that error msg in the logs I switched to the  timer?",
"in whichever is fastest in a non interactive environment - but I cant see much written about performance difference? Any tips or pointers to docs?",
"Hi,is there anyone who uses Spec frequently?",
"below)...does anyone know what the problem might be?",
"something?",
"ehm how can i recover stuff from .changes ?",
"is there a way to apply all changes?",
": Did you write an own spec method on the class side called #defaultSpec specifying how the UI should look like?",
"how can i access attributes of the context in the debugger?",
"Hi guys,what are some packages that deal with probability? Or is this built in somewhere?",
"Also are there any packages/objects that deal with motion in a confined 2d space?",
"Hi. I would like to run a verification on a file,but only after the writing process on it has ended. How can I make this?",
"Humâ€¦ Can you be more specific?",
"works with Pharo 6?",
"browser shows the cant  find pharo.org,do you want to retry?",
"Is it supposed to be correct that sender is nil in findNextHandlerContext?",
"ehm is there a way to check that an objects understands a specific message?",
"canUnderstand: ?",
"well what do you mean by file writing is done?",
"but thats the same,why sign a failed write-out?",
 "so part of the notebook saving is exporting all the formats?",
"Are you actually registered?",
"fix the calling code?",
"package implementations,RPackage and MCPackage - Ive tried both but not convinced Im doing it right as I dont see my image shrink?",
"Theres a fair amount of caching going on,maybe it doesnt update correctly when you unload?",
"Is there anyone with a good understanding of SmaCC here ?",
"and how exactly does pharo work on lambda?",
"it has some url and pharo creates some (e.g. html) output?",
"ended,calculate the checksum to put into the second one. How can I make this?",
"Anyone knows if there is a sanitize url library in Pharo?",
 "`ZnUrl>>encode:on:`?",
"what exactly do you mean under sanitize?",
"Why weird?",
"there is any way to remove it?",
"is there some kind of tool that can generate a print documentation of an object in simiar fashion to the ST-80 Blue Book?",
"How could the vm interact with java?",
"how can one do a trivial regex replacement?",
"I grab an appropriate image/VM for that?",
"is there any working markdown parser?",
"matters ?",
"and let the other process continue consuming the queue?",
"anyone knows whats the reason for such slow downloads of pharo images?",
"solution?",
"If I am thinking right and wait/signal is really capture continuation/reschedule,how do I do the mechanics of continuations?",
"t0suj4#6460;what is the best introduction to gui in pharo?",
"does Pharo have SVG -> PNG converter?",
 "do you know how can I canvert it to form?",
"or do I have to (manually) create canvas,render it there,extract the morph and convert it to form?",
"btw,the Athens project is still managed on smalltalkhub,or on github repo now?",
 "I find your stuff interesting bit hard to follow. Can you give detail information what you are trying to achieve?",
"What gets in a queue? What are to conditions of suspension? How are conditions ar met? In order to do what?",
 "are you looking to do something similar to select-based non-blocking sockets?",
 "do you also know if the opposite is possible? Taking a AthensCanvas/Surface and converting it into SVG?",
"ZnInvalidUTF8: Illegal leading byte for utf-8 encoding. Is there a way around it?",
"t0suj4#6460;Is there any project that inerfaces with serialization libraries?",
"Morphic/Bloc?",
"t0suj4#6460;Where can I get ARM build?",
"missing is how to save each package in that repo from the image onto disk?",
"How hard would it be to cross compile the vm source to apple swift or java?",
"to browse all the methods in the image that are members of that category (e.g. to correct the spelling of a category)?",
"my mentality was... nautilus shows this list when Im adding a protocol... where does nautilus gets the list?",
"string>`,but that doesnt work when the message is keyword. There is any other way to tell an object to execute a message contained in a string ?",
"Is  there any downside to downloading the 64 bit pharo-6.1 version for Mac Os?",
"there?",
"Why not then just use iceberg or gitfiketrre?",
"You could take a look at the export itself maybe?",
"btw is Iceberg happy talking with a local git repo? or does it need to talk with github?",
"I have seen references to needing to use ssh pubkey authentication and stuff. Is that only if you want to push to a remote?",
"Is there a special plugin or it only needs to find the .so file?",
"find that file at a special location relative to the VM or something?",
 "what platform is that?",
"not able to build on a regular unix box then deploy there?",
"Is it possible to totally replace the content of a method with metalink?",
"I think this is possible with metalink. Do you confirm/have a snippet to show how to do that?",
"In some methods I would also like to just add pragmas. Is that also possible?",
"aargh,how do I edit?",
"is there an interest in having a tech talk on Artificial Intelligence?",
"would you like to have it?",
"is it done with pharo?",
"the week before maybe?",
"anyone knows where the dollar-variables come from in the travis/bintray file for uploading builds ?",
"Do you have an example?",
 "I am not sure but do you have access to Pharos travis?",
  "Do you have an example for ifCpp Pharo in a plugin?",
  "And what is your approach for pharo-vm -> opensmalltalk-vm?",
 "So <option: PharoVM> makes a primitive only available for Pharo?",
"Searching for Pharo in it doesnt reveal anything?",
 "did you ever look at the diff of the generated code between pharo-vm and OpenSmalltalk-vm pre-generated one?",
"explain the difference?",
 "yes but return type sqInt vs. sqUint should be deterministic?",
"Hi everyone,Im glad to present you the trailer of SmartTest for ESUG,",
 "do you see it?",
"differences?",
"Whats your opinion on the rising trend for safety features in programming languages?",
"And is nil in smalltalk also the one-billion-mistake of Tony Hoare?",
"latest version of Pharo on Windows that I cant reproduce on my side. Do you know what it could be? ?",
"anyone here knows pillar architecture/internals?",
 "do you have a moment?",
"the ~latest changes) by aligning it with CM?",
 "do you mean chance ?",
"Hi. How can I convert the HTML word: Cap&iacute;tulo: Difundir datos to CapÃ­tulo: Difundir datos in Pharo?",
 "how do you mean?",
"What is the state of fuel in 64bit?",
"So is it a vm problem?",
"Not only vm. I dont know if the float problems are solved yet?",
"The pragma syntax changed in Pharo 6?",
"hook into the compiler and transform it pre-compilation?",
"What is actually the need for pilar?",
"what happened on github?",
"fork & fix?",
"well,you just apply the same script,but with different target,no?",
"how is that different from forking a repo?",
"otherwise the whole open source thing is kinda pointless,no ?",
"A question: Do you know some Pharo applications that have some benchmarks?",
"Who wrote some benchmark ?",
"Cyril did not report your crash to the mailing-list?",
"anyone using OSSubprocess or OSProcess/CommandShell on pharo6 64bits? anything to watch out for?",
"Is there an easy way to rename a method in a class?",
"Is this normal? does everybody else use a bigger screen? or are there some tricks?",
"On 12 youd fit just a single Nautilus/Calypso window,no?",
"(Just wondering: How come Nautilus is still default? will Calypso replace it some day?",
"stuck?",
 "Thanks. Surprised its not a one-liner though? Surely there is a bunch of stuff in the image doing such things?",
"Next question if I may :-). Is there anything like printf in Pharo?",
"anybody?",
"Maybe check the Cairo libs present at locations listed in unix32ModuleName arent 64bit or something?",
"There is no GTinspector for FFTableMorph ?",
"What was the class shown on todays talk that created a separate OS windows for pharo?",
"what platform?",
 "you never go to PharoDayss/ESUGs?",
"When is ESUG 2018 planned?",
"Want to try Pharo on Linux Mint. Looks like libgit2.so is missing. But git is installed.,,Where can I get it?",
"From myself?",
"which sublevel of version hell are we in?",
"Hi,Pharo for Windows has stable 64bits version?",
"Exists some 64 bits version?",
 "Is that an example file in the format?",
"why not cypress?",
"#isCritique`,related with Renraku. Monticello show me that Im at the last version. Any ideas?",
"So,anyone knows at least how to disable code critic?",
"Also I have a red message that breaks the flow constantly. Is really annoying. How can I go back to sane defaults in Pharo 6.1 ?",
"understand #sorted:`. Should I open an issue in the book repository or am I missing something?",
"How slow is pharo really compared to other languages?",
"now,are there any other issues regarding the critique system?",
 "how can I reproduce the Instance of ReTrivialCritique did not understand #isCritique?",
"A new Pharo success story:   Contestia,,Anyone knows more? Do they use Seaside or Teapot or other?",
"Hello,Can you suggest some good tools for building UML diagrams?",
"Pharo?,,,could you recommend something?",
 "what is your plan?",
"what is the status of the OntoUML support ?",
"you have teaching materials about that ?",
"OntoUML?",
"you have a configuration somewhere regarding what you have done for CORMAS ?",
 "you mean it was done before moving to OpenPonk ?",
"This change something for generating CORMAS classes ?",
"Do you have a ConfigurationOfXXX to include as a dependancy in my ConfigurationOfCORMAS ?",
 "as in... they stopped looking,or havent found nothing yet?",
"so I guess it is just using the fact that latest vm can somehow launch previous images enough to get the version?",
"requires some code modifications. Are you working on Launcher currently?",
"Hi. There is some way to stay reading the output of a process,executed by OS-Windows without exit the process?",
"),value: recurse ] ],,Category Theory for programmers by Bartosz Milewski,",
"is there a tool to detect (pharo) code duplication?",
"in some channel here I saw a graph of various Renraku rule violations in grapher... but I cant seem to find it... anyone knows?",
 "Critic Browser now uses Renraku,correct?",
 "with the graph do you mean the thing I showed at IWST or there was something else?",
"themes,a Pharo-version would be nice. Are themes easily made?",
 "maybe theres a better api to get this?",
"What is the SelectRuleBrowser?",
"critique... why?",
"HI all! Do you think Pharo would be a good environment to try some ideas related with computer vision?",
"libraries or bindings available out there?",
 "Why is your stuff 180 times slower?",
 "is there a meaningful reason why stable/latest Pharo 60 VM cannot use the 61 VM instead?",
"but is there backward compatibility issue?",
"and cant 61 images be labeled as Pharo 61?",
"or should every tool have hacks in their code to work around about this non-version?",
 "but the bottom line is... this wont be changed,correct?",
"is the block parameter assignment no longer allowed since opal?",
"that was ever possible?",
"did it propagate outside?",
"Did you talk with Ronie, ?",
"I dont think so,Whos Ronie?",
"on the other hand,so we need to implement machine learning in Pharo?",
"Hey guys,is there any literature on smalltalk bytecode/compilation/IR?",
 "any suggestions?",
"But is there anything available now just to get a hint or where to dig?",
"is there something like `detectLast:` ?",
"or do I have to use `(select: [ ... ]) last`?",
"Is there still not a way to get REPL-like functionality using `stdin`?",
"Whatre the recommended ways of interacting with a DB from Pharo?",
"Do we actually have a Refactoring Browser?",
"added for SmallLint. But what happend to the Refactoring **Browser**?",
"because of the version of LibC. At Synectique we will really soon to deploy on this kind of server,is there a tutorial somewhere with a workaround?",
 "Could you specify old red hat?",
"better to instantiate a new one for each request?",
"Does someone know if Pharo 6.1 works fine on Solaris?",
  "Thatd be svenvc and P3,right?",
"is there a tool that can tell me the real runtime dependencies of a project?",
  "are you reading this?",
"Is there mail sending available on pharocloud, ?",
"Does someone already saw something like this?",
"Did I miss an announcement re Petit Parser 2?",
"what we should all be using now? Is it now the Pharo standard?",
 "Is it backward compatible? Any reason one would *not* move to PP2?",
"way (if any) to handle a `git add -A; git commit; git push origin master` from inside a Pharo 6.1 image?",
"Which of 32 or 64-bit is current default on Mac OS X?",
"can you hear me?",
"Arent we supposed to write in #techtalk ??",
 "Do you use Pharo 6 or 7 for it? On which platform?",
"60510?",
"Is it running in an own window or inside the Pharo window?",
"how do I get the version number of a specific package?",
 "Maybe version is still up to date?",
"is there a graphics channel or similar for morphic/bloc chat?",
"Does anyone know if the ESUG 2017 presentations will be available as video?",
"is there a way to profile metacello loading?",
"files?",
"Torsten do you use the categoriser?",
 "can I treat WinShell as an actual shell?",
 "and to get stdout/stderr Ill need to read up on UFFI and WinApi?",
"this command also creates pharo-local... is that a bug or a feature?",
"does anyone has digged into the fuel-serialising-float-on-64bit problem?",
"maybe   knows?",
"you have a stream of commands?",
"Nick where are you from?",
"what is the exact input you get?",
"are they args or stdin?",
"commands.txt asFileReference readStream?",
"Can you give me the name email of your prof?",
"are you the real prof stef?",
"so i will email you my profs name and email then?",
  "didnt  say float serialization with fuel works (with the latest changes)?",
"but last commit from martin hasnt been integrated,isnt?",
"No,I dont think so. I reported back to him. So a new version is needed for you to integrate?",
"Why isnt bloc using Nile as a back end?",
"to the reproducible VM crash?",
  "can you see the new categories on the left side ?",
"#polymath is an internal project?",
"Hi! Do you know any quality analysis tool I could use to generate quality metrics and  reports in a CI pipeline?",
"look to Renraku?",
"I put polymath to internal projects ?",
 "you are an Amiga fan ?",
"why?",
"devtools),and have it run fullscreen. Is there prior art on this? Documentation?",
"seem like that might all be INTERMITTENT types of channels??",
"welcome...,,Maybe someone has done this before?",
"Hi,can anyone help me with some basic questions for a small project?",
"I assume thats less of a problem in Pharo?",
"Which one?",
"So,what is the strategic roadmap?",
"For our application?",
"Silly question how do I iterate a collection 2 elements by 2 elements?",
"sequencable?",
"(y also see that there is no mc directory,could that be related?",
"that front?",
"How do we launch an image in headless mode on OSX?",
"Whats the correct incantation to declare Seaside as a dependency in my Metacello setup?",
"How do you version things on Github?",
"Just Monticello,or other stuff?",
"Although why would you want to use SVN?",
"Hi people,how are you?",
"there is anything done or must be done?",
"Do I have to verify my account or something first?",
"You did register on the website?",
"So maybe my session is borked?",
"Does anyone uses Cargo for managing projects?",
"Is Christoph Demarey using discord?",
 "Cool which university?",
 "are the improvements to FastTable ready for review?",
 "National University of Quilmes,Argentina. Where is that wiki you are talking about?",
"what is the select the username?",
"But why you really need to look inside the mock?",
"Whats the recommended pattern for handling application-wide stuff like a database connection?",
"Just shove it in a global variable,or is there something better?",
"general? [Language Shootout](?lang=vw&lang2=racket)  only lists  `VisualWorksÂ® Personal Use Edition Release 8.2 of July 15,2016 ` so wonder how does Pharo -6.x/64bit compare with it?",
 "any estimation how faster is Pharos vm than VW Smalltalk??",
 "can i assume that in your use-cases,you do not see problem with Pharos performance in real-world apps?",
"how do you deploy apps to end-users?",
"Rackets is able to pack app+runtime as stand-alone executable,what about Pharo?",
 "do you know why IceBerg wants to have owner and projectName for remote projects?",
 "youre the author of  [this](article?",
"what_do_you_do_with_pharosqueak/) so wonder is it still relevant today since I only found some old(er) posts in regard?",
"ive downloaded Pharo.1-64.image (Linux),but when i launch it I see that Welcome still shows 6.0?",
"how does Pharo stand with i18n/l11n and Unicode (utf-8) support in general?",
"first batch of videos of ESUG17: ",
 "wouldnt it be nice to have something to automatically strip deployed app from the extra developers add-on?",
 "wow.. I only remember they crossed the 100mb barrier...Any idea how big their compiled php binary is?",
"how does pharo behave in regard to concurrency+parallelism,iow. in utilizing multi-core cpus in todays machines?",
"there is something in the pipeline for 7.0?",
"so,in general,you dont find that pharo is slow?",
"stuff is easily (FSVO of easy) accessible in a stock Pharo?",
"However,now languages like Python and Ruby have become dominant,and,for example,?",
"Racket (?",
 "how are you satisfied with Pharos FFI?",
"settled down since in the past,iirc,there were several options with no clear winner at that time?",
"explain...I thought it is almost impossible to obfuscate Smalltalk/Pharo code?",
"install 64bit VMs?",
"something which can be done in Python by using CFFI or Cython?",
"more than required...id like e.g. to map double* consisting of e.g. 6 double values to the record in Pharo,etc.?",
"what about memory management?",
"iow,just bind 3rd aprty C lib and use it from within Pharo?",
"ok,but considering that C code (lib) is mature and (relatively) safe product?",
"Which C library ?",
 "what do you mean: It will install a 64-bit vm when needed.  ?",
"else?",
 "btw,how do you manage to produce quite-like line when replying?",
"thats not supported?",
"but i do not get yellow vertical line at the front?",
 "does 64 bit VM offer anything more than access to more memory ?",
"l11n and Unicode (utf-8) support in general?",
"help you out as I tried to keep theory as limited as possible --> ",
"why does this forum report the above URL as 404?",
"Pillar export ?",
"what do you mean ?",
"you mean org-mode does not export to Pillar ?",
"using Pillar-mode?",
"i saw that,but not sure whether it still does work with Emacs-25.x?",
"pillar-mode or shampoo ?",
"now youve replaced Emacs OS with Pharo?",
"but there are lot of kbd shortcuts available in Pharo for the most common stuff,right?",
"Pharos methods are usually smaller bites of code,right?",
"@darth-cheney#2128 what issue is that exactly ?",
"Anyone knows the status of the new Git-friendly file format ?",
"Would it be possible to create a channel #IA ?",
"any idea ?",
"How can I load MUDClient ?",
"and how to do that?",
 "your youtube videos are still mostly relevant?",
"which of the following makes the most sense to you?",
"Also is there an english version of the pharo tutorial?",
"with Pharo tutorial you mean the MOOC?",
"it uses ?",
"is sqlite still a thing?",
"any idea?",
"side questino: what is Ombu?",
"persistant mechanism ?",
"Do I have to reset a cache or something ?",
"deleting *-cache file on the disk ?",
"but you already sorted that,isnt?",
 "can I use tonel in P61?",
"did you executed the script completely?",
"which script? Updating Iceberg?",
"you do not get this error ?",
"should I compare with case insensitive ?",
"in P7 it works directly,or do I also need to update everything?",
"maybe a problem when downloading?",
"did updating iceberg cleaned up my settings?",
"value objects?",
"cloning) should fail,no?",
"anyone try highsierra mac os with Pharo ?",
"btw... is high-sierra released?",
"so... to backport or not to backport metacello/iceberg 0.6 ?",
"or zeroconf is broken?",
"the problem is defender putting it in the vault?",
"so... what to do?",
"What is the link the download that Defender doesnt like?",
"is the ssl issue with P6 or P7?",
"link?",
"I use a mightmouse on OSX. Scrolling is a nightmare. Is there a way to completely disable mouse wheel events?",
 "is the OpenSSL recent or a vulnerable release?",
"eh?",
 "in regard to the windows defender and squeak ssl. Do we ship a vulnerable version of OpenSSL?",
"which one we need?",
"where to find MADescription builder ?",
 "should i rebase against another iceberg branch?",
"pins,webcam,and if possible audio?",
"Is there a 64bit vm  for win10 available?",
"continue to run so one can select another VM etc. any hint what might be wrong?",
"btw,which projects from those listed here  were accepted (and realized)?",
"Before I go about reinventing too many wheels,what kind of interfaces exist already to the OpenSSL bundled with Pharo?",
"set-up of TLS. Crypto NACL from the catalog (doesnt load in Pharo6 but works in Pharo5) is using libsodium/NaCl. Maybe that is an alternative for libcrypto?",
"Are there any more or less canonical docs for UFFI,though?",
"can I detect an index using block?",
 "Thats awesome! Gimme a prod when youve got it up somewhere?",
"for what?",
"for being you?",
"suggestions?",
"Hey,did anybody try to do some Facebook analysis in Pharo?",
"Maybe someone did some scraping/modeling with FB?",
"We need to have build numbers back in Pharo Launcher for Pharo 7 too. Anyone?",
"from?",
"Im guessing because its metadata-less. Is that right?",
"Pro Tip?",
"Anyone having experience using Amazon SNS with Pharo?",
"Shouldnt this code log finished after 100ms?",
"Am I doing something wrong,or is the Monitor/Delay broken?",
"on fogbugz for Pharo right?",
"can someone point me at a doc on pharo/squeak differences?",
"noha/aws-sdk-smalltalk/tree/sns-support?",
"Would I be better off playing with Bloc in Pharo 6.x or 7?",
"How would I test if a particular BaselineOf project is loaded in the image?",
"`MetacelloProjectRegistration registry baselineRegistry includesKey: #BaselineOfWhatever` ?",
"do we have reverse index search?",
"Im trying to get Pharo running on Ubuntu linux. Where could I find some resources on that?",
"the Moldable Editor presentation at ESUG was not recorded?",
"we are at 20: ",
 "is there a problem with Pharo on OSX?",
"solved your issue,could you tell me how you did it?",
"what is the meaning of `10d2`?",
"Something I dont understand at todays Pharo: what is the relation of Bloc and Morphic and Athens ?",
"will exist also in future,but in cleaner and better Implementation . Something like this ?",
 "does my integration failure look random? What is the next step?",
"I dont know... make another try?",
 "> 7:22 AM] aryeh: Can someone contrast MVC,Bloc,Morphic and Athens?",
"ObjectWorks Smalltalk programmer use today?,,I asked this in #learning-help earlier. Should I ask these questions in the #general channel instead?",
"I am playing aroung with Spec,and I am having issues with layouting. How do I align models?",
"with width 1 and the buttons with toolbarHeight,but the model is the too big. How do I do this right?",
 "can we at least ignore remotes that are not supported (until the support is added),instead of breaking down?",
"which remote is not supported?",
 "Was Nile/Gezira ever considered for Bloc?",
"RSD?",
"Is there a good future implementation in pharo?",
"RFBServer is working on P6?",
 "is 480p the best quality for ESUG videos,or is higher one still being processed by youtube?",
"Anyone in Vancouver next week ?",
"If see right there is no GUI or graphics related channel.  Would it be good to have one ?",
"For windows Pharo -headless is pharoConsole.exe  in order to running without GUI,is this correct ?",
"speaking of graphics: The Bloc Hands-On video (from esug) is now online: ",
 "I just dl-ed your Discord client. How does one get the initial webhook id and token?",
"Which library or combination of libraries should I focus on if I want to create a gui?",
"Hello,Is there a way to wrap glamour UI object in a Spec widget?",
"Another video from the ESUG17 conference: ",
"plan ?",
  "thx for your answer. Do you refer to the 6.1 64 bit Linux Mac VM ?",
"should I ignore the invoce?",
"Hi all! Where can I read something about the new bootstrapped images,hermes,etc.?",
 "are you familiar with C++?",
"fuse313#3827;why pharo6.1 is very unstable on mac os sierra?",
"what problems are you experiencing?",
"home/?",
"Do you have the writing rights in the Pharo folder?",
"@fuse313#3827 looks like you are on a recent Mac OS and havent moved Pharo to Applications?",
"fuse313#3827;I use a japanese environment. is  this related to the problem?",
"image being spawned. Does anyone know any sources for more information on this?",
"systems.,,Is Pharo a solution to both? Im curious as to thoughts about headless and the future?",
"me. ðŸ˜ƒ what do you have in mind when you say headless?",
"another name for that?",
"I have a question what are these supposed to be funny messages?",
"How to build a VM for iOS?",
"I am trying to compile pharo by example. Does this look familiar to anyone?",
"If I do a TestCase runAllAndLogResult in a remote playground,my client locks up. How do I avoid that with telePharo?",
 "what this method do?",
"class side?",
"not?",
"Or do I understand that wrong?",
"is there a way to change screen size when Pharo is started in headless and accessed via VNC  (RFB) ?",
 "Why should a remote playground act differently then a local one?",
 "And you want operate on many machines having open a playground per remote machine?",
"Does someone have experience with ProcessWrapper?",
 "how many telepharo clients on different images can connect to the same telepharo server?",
"oh,when I go remoteObject inspect and doit I get hang,no inspector,(because it tries to come up on remote image?",
 "What is brittle?",
 "Isnt it a question how you synchronize state if the behaviour is not sync?",
"And how do you consume a result of the remote operation?",
"In the same way as Id now have to do with evaluateAsync: .  Shouldnt that be the default?",
"this option. Do you know how to activate this option or why has dissappeared?",
"www.humane-assessment.com/blog/communicating-changes-in-pharo-3-0/ My question is if CodeCity supports a Linux platform or only MacOS ?",
"Are there keyboard shortcuts in Calypso to toggle between class/instance,method/instVar,flat/hier?",
"alreaded added a baseline package in the repository. I dont know what went wrong. How to solve this problem?",
"thats because Pharo has to run into an  isolated VM by company IT policy). How can I manage in this use case dependencies and last stable version ?",
 "was that a recent commit?",
"I just received a segmentation fault  with a stack trace. Where is the best place to submit this as a bug?",
"The VM crash is at ",
"spam?",
 "sorry to bother you... can that be restricted on discord?",
"Has anyone used websockets with teapot ?",
"#(1 2 3 4) sizeInMemory  -> 32   (its ok)  but why  2017 sizeInMemory  -> 0  ?",
"Hi all,the file server at files.pharo.org  has been super slow recently. When is this going to be fixed?",
"Hi,I would like to migrate a SmalltalkHub repository to  github with all package history,how can I do ?",
"How to uninstall Calypso package?",
"package before a debugging session and file it back in when the loop gets killed. Is there a better way to stop these  loops?",
 "Do you need to actually uninstall?",
"is it a personal style choice?",
"it. Anyone has experience with this or any best practices related with publishing Pharo software on Zenodo to get a DOI?",
 "and why not just a tar.gz of your code from the repo ?",
"perception that Pharo is quite good at data display. Is that perception accurate?",
"Is this what Roassal offers?",
"That looks usable and interesting. Is there a tutorial in English?",
"Pharo?",
"work.  So I look at the system browser,then google,and finally here. ðŸ˜ƒ  Is there a place other than that I should look?",
"How does the community handle contributions ?",
"to not match the philosophy of the more experienced author. Have I really the chance to contribute valuable code ?",
"Refactoring,discussion ...?",
 "can you explain to us what you want to do?",
"Did you try to run the critics browser?",
"In general development of Pharo and big things (Roassal seaside System components etc ..... are now on Github (iceberg )?",
 "what is Teapot? Do you think it may run on top of ParrotTalk?",
"HTML,or PDF? I am interested in documenting ParrotTalk and Hubbub and eLinda. Would using Grafoscopio itself be a good approach? What did you use for your user manual. DO you have a source doc I could start with as a template for my own documentation?",
"Is there a STON port to Java?",
"How hard would it be to port STON to Java?",
"What do you think? Doable?",
"What is the location of the Pharo preferences under linux and windows?",
 "are you on linux?",
"grafoscopio/dir?",
"Do you know the preferences folder location?",
"and pharo?",
 "Did those VSE ports include VSEs WindowBuilder GUI stuff?",
"yes,but the vm is shipped with the artifact no?",
"How to inspect any object in Pharo?",
"anybody how to fix that?",
 "Is the booklet creation possible on Windows?",
 "do you have make on Windows?",
"What is WLS?",
"The make on Windows require cygwin I think?",
"Cyril do you have docker?",
"that,in addition to supporting substitution.,,My question is which serialization would be best for this layer 6 distributed objects?",
"How does Fuel go about that?",
"messages with `self subclassResponsibility` ?",
"right place?",
"add this without breaking Linux support?",
"And also: How can I get 64bit images of Pharo7 so I can base my patches on this?",
"the wrong libc.so name for my system. Is there a way for me to correct this?",
"Ah found a workaround by adding a symbolic link in /usr/lib but is there a general solution to this?",
"Hi folks,is there a way to load a FreeType font into the image using data from a bytearray rather than a file on disk?",
"you might use to feed the FT2 plugin with your type?",
"uhm,ok?",
"hey everyone. Development of Pharo still works on the `development` branch?",
"annonymousClassCreator ?",
"How do I get the file path to a git repository from a class/package from within Pharo?",
"#MyClass) packageName]]?",
"Just wondering,is there an easy way to convert a digit into a binary representation?",
"How fast can I expect replaying 49341 epicea events to be?",
 "did you ever save the image?",
"Anyone know why they would be hanging around,even though theyre empty?",
"be?",
"sure about Seaside its not actively developed. What other options are there for routing frameworks?",
"why having low activity means people doubt using it?",
"About activity: is github the right place to look?",
 "so zeroconf will be migrated to the mirror?",
"Welcome! Who is your teacher? Are you participating the Smalltalk conference?",
"You are lucky because you got great teachers. BTW did you look at the mooc?",
 "how production ready are Slots? are they being actively used anywhere?",
 "and unrelated to that,would you consider this to be a good use,or abuse of slots?",
"For now you would have to do that yourself,but could we do better?",
"e.g. both property slot and boolean slot store in a shared ivar. How to compose those?",
"sure you donâ€™t hold references to the sockets from somewhere else?",
"why is `#readSlotNamed:`/`#writeSlotNamed:value:` almost twice as fast (4.2M vs 2.4M) than `#instVarNamed:`/`#instVarNamed:put:`?",
"then checking that every ML was triggered) the most appropriate solution?",
"Maybe a silly question: Do I need to pay for any license fees if I want to build a product with Pharo and make a profit out of it?",
"Is there any package to use Pharo for automated testing on web apps with Selenium or the like?",
"testing,right?",
"isnt?",
"pass it to `onig_func`?",
"is it currently possible to have in Pharo text with images,or is Moldable Editor the first one to provide such a capability?",
"function from my previous post?",
"ok,but how does UFFI figure out,which of the structures I want it to point to?",
"is there a way to define the maximum usable memory for the vm,something like -xmx in java?",
"in C,i just reference it,,and I have it,how do I do that in Pharo?",
"item?id=15536500) Do you know if the session was recorded and where can I found the video?",
 "is the Onig library ready? or just early WIP?",
 "is the Onig library ready? or just early WIP?",
"correct? *yes* confusing?",
  "do you have the script for the flow text around an image?",
"marked with a grey selection bar even if I select another protocol?",
"ExternalAddress which can do pointer arithmetics. (edit: yeah this works),,Is this the right way or is there something I missed?",
 "do you remember where did you find out that the IntelliJ idea icons license?",
"Heres one:  what is the equivalent of right click on the Mac?",
"current tutorial says I should get.  Is there anywhere a solid mac oriented overview of all the pharo gui options?",
 "I have been having some issues with pharo on mac too... does the backspace key crash your image?",
"watch 5 times like riding a tour bus in a strange city??",
"specific tour in English could eventually be worked into the docs?",
 "is your problem only related to Windows VM?",
 "Where did you work with VSE,if I may ask?",
"Thats interesting. Whats the common ancestor?",
"experienced that! Which OS X? Which Pharo image? Which VM? How did you download?",
 "You here?",
"In summary,Iâ€™m confused. Can I have some suggestions on which package to use?",
 "have you tried `XMLDOMParser`?",
"possible with the current FileReference API?",
"Did it work for you?",
"BlInfiniteDataSourceItemRangeChanged. Could someone explain to me what are these and if its important for the problem Im trying to figure out?",
"write anything on transcript and the debugger didnt flag out anything. What is wrong? Is the TAB key reserved? Is it detected differently?",
"Will Spec be able to specify Brick layouts of widgets?",
"@Aliaksei do you have a bloc image ready to download?",
"Did you connect bloc travis with bintray?",
"Ok so the catalog is working?",
"does it support baselines?",
"of his charachter to anywhere on the map or being able to change the health of a unit.  Are there easy ways to implement this behavior in pharo?",
"just implement the messages the player has access to?",
"case of dictionaries. I think the idea is to not raise an error in case that the key is not present. Isnt it?",
"happen should be empty?",
"techtallk is starting: ",
 "thanks ðŸ˜ƒ Is it documented somewhere?",
"The rule is then to use either Monticello or git,not mix them up?",
"That document mentions committing your changes to Monticello first and then commuting in git... !?",
"which document?",
"Can you please help me?",
"How does a point (800@600) makes sense for a size?",
"Oh,ok. Is there an updated documentation for working with BaselineOf and Iceberg?",
 "What you want to do is a array of array?",
"Do you know how to read the comments on the class?",
 "in the system browser find the class Matrix. Once you have selected it,click on the button labeled  â€œ?",
"Hi all,I have a small query Ive been trying to figure out. How do you schedule a periodic activity?",
"for the same purpose or how to use it. More importantly,how would I implement a scheduler in Pharo?",
 "Which exception do you get? Which version do you use?",
"saving?",
"Woudl it make sense to add a UI for this to the code changes UI?",
"I would find that useful. Is this a little bit like Squeaks changeset-oriented development model?",
"Maybe even a World menu item reload changes from previous session?",
"Is there a package that helps me deal with talking to a serial device (UART)?",
"IT dept. so they can have a look?",
 "Is there a way to mirror catalog.pharo.org as well?",
"Pharo 7 does not use the Dark Theme anymore ?",
"Did it work before?",
"Do you have any idea why this is giving me error ifNil was sent to nil?",
"your ssh-agent should be handling this,what operating system are you running?",
"How do I execute mothod if some confition is true?",
"well,but in case,hasMonsta,(monsta isNil),ifTrue: [ true ],ifFalse: [ false ].,it should return last command,not?",
"oh,i guess,this should wortk aswelll?",
"Hi,Does anyone know how to specify in the baseline a git repository with a specific tag ?",
 "Do you have git integration on?",
"AADYlZWeQoNDrjAsjxmImG5Ua?",
"But shouldnt this be documented ?",
"Can someone browse for implementors in Pharo 7?",
"Is this a bug or was it a decision ?",
"hi. How do I load a file to Pharo?",
 "what is the 3d engine that is used in your videos?",
"strings),so that you can easily see where they differ?",
 "is StateSpecs meant primarily for testing? Or does it work well when used in regular runtime?",
"does it change code? or thats just Mocketry?",
"Is there a way to ask the user for a file using UIManager **BUT** specifying the starting directory?",
"implemented a test to capture it. How do I submit it?",
"whats pharo-extras?",
"work? (Do other people do this?",
 "What was the bug?",
"Am I the only one thinking that RBShoudntRaiseErrorRule is not such a nice rule?",
 "I guess at some point well have PharoExtras moved to GitHub. Or well we have separate repos?",
"hello,how do I create independent (deep) copy of object?",
"How do you do an fficall with a function which takes pointers  to ints for storing its result?",
  "Thats amazing,thank you,can you explain me the difference between deepCopy and veryDeepCopy please?",
"construct: (self getVariables) count: 1).,,instead of getting it from database,it works...how is that possible?",
"storeMajorInto: major storeMinorInto: minor storePatchLevelInto: level suggestions on naming it more readable?",
"any idea how the lookup works ?",
 "Is it a recent or old Pharo 7 version?",
"[,hello,].,And lets say that A returns true. Then,,Pharo evaluates B aswell. How do we stop pharo from evaluating it?",
"have multiple IFs inside each other.,Is it even possible? Please?",
"well so the second code evaluates A B C D E as foe example C++,right?",
"akgrant0710#4807; if youre still confused,why not just try evaluating the expression in the debugger (using step into)?",
"that Beeper code need to be updated?",
",do you have any idea what to do,please?",
"Is it possible in nautilus to see the protocols of super classes?",
"well time for you to switch to Calypso?",
"Calypso does it?",
"iirc calypso can show protocols/methods from parent classes?",
"Is it known issue?",
"directly on the Traits users. Is that the wanted behaviour?",
"Anyone else at AWS re:Invent 2017?",
"Hi. Just noticed the OSSubProcess package on the catalog for Pharo 6. Is it meant as a replacement to OSProcess?",
"what does `ZnEasy get: you?",
 "I just checked on Pharo 6.1 image. Works there. What Image? What VM? What OS?",
"So there is no solutions to my problem for the moment ?",
"Hi! Please,how can I compile and/or parse a code snippet?",
"thanks! Why is it not possible to evaluate it?",
"Hi! Please,may you help me?",
"Does anybody have experience with design by contract in Pharo?",
"IceCompiler,but it notes to be a POC only. Are there any battle-proof implementations?",
 "and how can I extract classes?",
"anyone making website with aidaweb or seaside?",
"is discord done in pharo?",
"link to live presentation? stepharo?",
"is the new run of the mooc still going on?",
"How is one opening the selected expression in GTPlayground? Like it done here ",
"any idea?",
"Spec? I know Spec can have Morphs embedded so when should that be used? Do you need Morphic when using Spec? Are there things you can do in Morphic that you cant in Spec?",
"class?",
"Is there an easy way to fileOut all of the current code changes in my image?",
  "can you,please try to provide more concrete description how to reproduce?",
"I didnt think to scroll all the way down to below the named changesets (from Monticello?",
 "So if I wanted to make custom widgets in Spec,do I need to know Morphic?",
"Wow,good to know. Do you mean file names? Or file contents?",
"Great! Why not to improve MemoryStore in Pharo 7 accordingly?",
"Is there any reason to keep current the MemoryStore implementation?",
"significant changes between Squeak an d Pharo regarding how they handle finalization??",
"How could I do finalization in Pharo?",
"Anyone awake?",
"where do I find recent linux vms?",
"Where is something newer than end of august?",
"include $/.  Do you know where I could find code in Pharo that url encodes ages?",
"Is it the same as Squeak?",
"My needs are to encode key->value pairs in the form,,cap://127.0.1.1:10011?",
"detect environment and make the right calls. By chance is this a part of Bootstrap?",
"if I want a group of yes/no (boolean) settings from a dictionary... do I need to create setter/getter for each individual option?",
"or is there some read and write to this dictionary option?",
"form,,cap://127.0.1.1:10011?",
"I find I have another question for yall,Is there a way to fork a Squeak process from Pharo?",
"What should I load in Pharo to get OSProcess/OSSubprocess? How about in Squeak?",
"Java?",
"Perhaps STON is a good place to implement a common protocol to do URL encoding/decoding.  Is it possible?",
"Hi all. General question ... What is the right way to generate code in my image  by executing code in Pharo?",
"making the #NameOfSubclass variable,but when I run this code my whole Pharo image gets slow. Any idea of what might be happening?",
"practice?",
"I guess it might be because the class Im trying to generate already exists. Maybe its that?",
"What are the current best-practices in defining unixModuleName for unified FFI (UFFI) libraries?",
"libgit2.so or doing some elaborate looking up mechanism?",
"that added?",
"is there a clean approach to sending one method in Pharo X,and sending another one in Pharo Y?",
"versions I want to support. This often involves adding missing classes and methods. Is that what you are asking?",
"so then in Baseline I load for specific versions specific packages?",
"6.1 RubPluggableTextMorph is used instead. How do I do the following?",
"Any hint?",
"jirovad1#9748;Hi,I have a question about XPath. Is there any way to find node by its specific string value?",
"key=scopeName])?",
"in ways the non-native process expects?",
"window,and using smalltalk code we could interact with it. Is that possible?",
"how. Does anyone have any clues for a complete noob to get started?",
"sure how to do that. Am I on the right track?",
"How can I remove such message?",
"Yes. This is related with SmartTest Package. How can I remove a package in Pharo?",
"Does anyone know how to remove a class (and possibly the package containing it) from the system at runtime?",
"registration/login ... was it always like that or is it a new problem (or feature)?",
"I guess I cannot specify extension methods for package tags?",
"description?",
"Is there a simple idiomatic way to memozie a function using a weak table?",
"Can somebody tell me what to click to get back the same code that I had in the previous image that I started?",
 "are you implementing SSL?",
"Which ASN.1 are you using?",
 "were you aware the Cryptography package has X509 inside?",
"Hi. Any mac user here who can tell me what is the output of `Smalltalk platformName` ?",
"What magic was performed to speed up searching Source in the Finder apparently by a factor of about 1,0,000?",
 "do you mean the current committed value or the one in the memento?",
"`Ideas?",
"is there a way for a setting to trigger update of all the settings?",
 "are there docs?",
"I was using the debugger to step through code (very useful) but is there a way to step back?",
"is anybody working on pier?",
"What is,and Where is NAFileUploadConfigurator?",
"created are never visited again. Any idea what happens?",
 "is it a consistent crash,or a one-time thing?",
"how that could be?",
"And what returns `GAScriptOfTheDayPlugin superclass`?",
"@CyrilFerlicot can you ask clement about it?",
 "That does not sound quite correct. Are you creating new classes or new instances of a class?",
"What would you say is the best way to create a class diagram in pharo? openponk?",
 "by create you mean generate? draw?",
 "OpenPonk is your baby,right?",
 "OpenPonk is only drawing?",
 "Im a mac user so I take the ?",
 "So I can generate the meta model from my code and this enables me to display e.g. a class diagram?",
"Or what would be the preferred way?",
"You mean my class -> uml metamodel?",
"Ok,that is perfect. And how is the model made into a diagram?",
"Does Spec support drag and drop?",
 "Is there soemthing that helps creating UML structure or is the following the only way to do?",
"not to introduce a proper error window in Iceberg?",
"Hi! Is there any way to make class abstract?",
"preexisting ones. An extensible `MAMultipleOptionDescription` would seem to provide the functionality,but just feels wrong conceptually. Any thoughts?",
"Owned?",
"â€žI want the option...â€œ means graphically?",
"the code back into my image after a crash. Clues?",
"Is it possible to select multiple files in a FDOpenFileDialog?",
  "How did you like the old way?",
"and an uncleaned class mock ?",
"how do I open RubTextEditor?",
"How do I get a cursor position from RubScrolledTextMorph/RubEditingArea?",
"So... how can you unbreak an image which got broken by your dabbling around with UFFI?",
"Any suggestions?",
  "you mean when you save your image pharo crashes?",
"does also provide a CI server,Gitlab CI.,My question is: what shall we take,Jenkins or GitlabCI?",
"other (for dev with Pharo)?",
"And another question: Can someone who has a jenkins server running help me?",
"code in the Build entry?",
"Yes it is. You mean chmod?",
"understand you wrong?,No one having a script as a code snippet for me?",
"have to install one of those packages:,gnu-linux-installation,Can you tell me,which one?",
"Im having a surprisingly hard time working out how to convert a ByteArray containing ascii values into a string?",
"what does the inspector show (tab bytes)?",
"action Ive done that I can correlate it to. Has anyone else experienced this? Did I inadvertently ask Pharo to perform some action that does this?",
"We can evaluate `3 years`,but not `3 months`. Weird?",
"even more problematic with months (should it be 30 days,31 days,30.4375 days...?",
 "Why > days?",
"not be capitalized,or that a method has too many selectors,or is too long. Is the coding style/standard that Pharo follows documented anywhere?",
"Hi! Does anybody know how to catch key press event from keyboard?",
"I have a UFFI question: how can I define an `FFIExternalStructure` (struct) that contains `unsigned char some_var`?",
"Mustache question: Any way to use the value of a section variable in the section itself?",
"how unsafe is it to override `size` method on inst size?",
"Is there a way to set a max size for the Pharo windows?",
 "The main window or SystemWindow objects?",
"What platform?",
"What if you change DisplayScreen >> #startUp ?",
"Has anyone else had any weird behaviour with the 6.1 Epicea changes browser in Windows?",
"you can see in the image,534 events selected but only 500 get added?",
"from this point X to this point Y even if they are in different snapshots (which is I guess whats happening?",
"Is it possible to change the background color of a window with Spec?",
"Also,I would like to display an image I have as png. How can I do that in Spec?",
"Hello - newbie question here. Is the regex implememtation meant to handle negative lookbehind,or is that out of scope?",
"like (?",
"something different?",
"rabbit hole?",
"Hi! Can anyone help me to make input from keyboard work in Bloc?",
"redownloading Pharo?",
"No,I do not want to use new image. I want my old image where is my saved code that is not pushed on git yet. Is it possible?",
"your image is broken ?",
"What can I do to not download libraries again and write my code again? If I rewrite image with original one,all this disappears,doesnt it?",
"Did you lost a lot of code?",
"Can you reload your code?",
"one newer.  Latest non-empty nightly build is from 20170619 which has the old libgit ?",
"where are you looking for your vms?",
"Launcher dls since last night have slowed to a crawl like before the recent overhaul. Did something change?",
"again froze Pharo. Any idea how i can install it on 6.1?",
"Is there somewhere a doc of the ast rewriting syntax?",
 "Which is a bug? The Iceberg thing?",
"Ah,okay. I hacked a fix but cant remember how to submit for 6.1 ha ha. Git or slice?",
"now),and provide the same QueryBuildingBlock to both object and SQL proxy backends?",
"database scheme to reflect that?",
"If not,how do you then perform queries on models stored using â€œoldâ€ Moose versions?",
"RBParseTreeRewriter allow you to verify if you are in a  instance variable and replace only  in this case no ?",
"`Metacello-Bitbucket`?",
"PhLDirectoryBasedImageRepository#copyImageName:to:).  Is this a known problem?  Where do I report it?",
"Hi - not which channel is appropriate for my annoying beginner questions?",
 "So for 6.1,contribute to Iceberg via git and Metacello/core via slice?",
  "Got it. What about core packages?",
"obviously not explaining it well,ha ha: Does one contribute to Pharo 6.1 core via Slice/git/something-else?",
"managed as a normal external project)?",
"Hey dudes,whats the status on Zinc Websockets?",
"Are those objects still supported and,if so,where can one get them?",
"Did you check the configuration @darth-cheney#2128?",
"No what should I be looking for?",
"Has anyone here ever embedded Sciter into Pharo?",
"Whats the difference between `#isMeta` and `#isClassSide` ?",
"Anyone around here with a mac and PharoLauncher?",
 "HTML,CSS and script,or do you mean a concrete library?",
"Did you try to wrap it already?",
"Does someone know how to disable drag n drop of file in Pharo?",
"am I the only one?",
"what about to send USR1 signal to the process to see where it hangs?",
"didnt get through...any ideas what is happening?",
"Is Zinc the only way to access REST APIs?",
"KuanHulio what is the problem you have with Zinc?",
 "I assume you can override the dropping support in the WorldMorph?",
"demo video on how to use this  thing?",
"ok. but not for 6.1?",
"Because who cares about these logs unless when it crashes really?",
 "Do you have a link for downoading Pharo Launcher for Windows?",
 "I am not sure what Zeroconf is,this is my first programming language. So is Pharo just outdated?",
"even needed?",
"Zeroconf is a dialect right? when you say command line version?",
"Oh ok. Well you said sure,is that to the first thing I said or the second thing?",
"ðŸ˜ƒ So you like Smalltalk better than Python?",
"Great,why is this language so obscure?",
"Do you know how to start the catalog browser in Pharo?",
">Do you know how to start the catalog browser in Pharo?",
"Can you start Pharo?",
"Can you open the World menu?",
"Did you got a prompt from Windows firewall when first running Pharo catalog?",
"Are you behind a proxy?",
"So,you get the list in the catalog?",
"Works?",
"ah,do you take notes when learning to program? Or is it integrated?",
"Do this in the source?",
"to this one: x := DateAndTime now asDate. ?",
"Got it?",
"what are cascades used for?",
"Grok it?",
"medium will?",
"EVERYTHING in smalltalk is an object?",
"w label ]) ifNotEmpty: [ :windows | windows anyOne activate ] ifEmpty: [ Transcript open ]``?",
"akgrant0710#4807; What happens if you take out the second package: Workflow?",
"Is it possible to resize the VMs window (not sure of the term) from inside Pharo?",
"Who is in charge of gsoc.pharo.org website ?",
"So maybe someone did it manualy?",
 "whats the problem?",
"Is there a command line based repl(i.e python,irb) exists for Pharo?",
 "I dont think Ive seen anything like that.... what is your use case? why do you need CLI-based REPL?",
 "Definitely a cool tool. Need to try out. Working on Windows?",
"so how/where would you specify the VM variant ?",
"can you try my function above,before I push that fix ?",
"Any repo I can try it with?",
"anyone using Teapot?",
 "What is hte logic of the pharo.<random thing>.* ?",
"So?",
"strangeâ€¦ could that be the limit on path length of windows ?",
"so ?",
"Is clap-st okay with a 70?",
"will mean lagging behind. So,what would you advise me to do?",
  "can you do something for GSOC ?",
"Does anyone remember how it works?",
 "could you please enable myself?",
"ST code?",
"do we have a UI component that requests information from the user but performs validation on top of it?",
"Do you mean like a simple line of text or a full form?",
 "does calypso have nautilus-equivalent shortcuts yet?",
  "What would you say is the balance in Squeak,own work versus repairs?",
 "is there a list of all unresolved issues that cause VM crash? (and maybe their frequency..?",
"Are you using a recent opensmalltalk vm,?",
 "I guess not that many people use Calypso on Windows yet?",
 "have you considered switching to tonel soon?",
"group?",
 "Do you use Pharo 6 on Windows?",
 "what is the difference from regular Pharo VMs? why does pharo have separate vms?",
"It has more plugin no?",
"Does anyone where I can find Hiedra from Martin Diaz? Is it hosted on github or SThub?",
  "comments on the update to fari with subcommands ?",
 "is it possible to have a custom tab in Calypso?",
"first method in the list is the currently selected class?",
"not sure what is the point of `belongsToCurrentBrowserContext`... in what situation would that trigger?",
"screenshots of what?",
"what you are doing?",
"is it class diagram?",
"A roassal view can be embedded in Calypso?",
"when will it replace Nautilus ?",
"any date planned?",
"the difference of NEC/NOC completion etc. I saw a post by  that last year Lukas was working on improving code completion,is he on discord?",
"A question,what is the best way to interact with Python from Pharo ?",
",is there any documentation around for Atlas?  Also how would Atlas fit a comms package like signalr?",
"this one?",
"Web devs call this micro service ?",
"so has something leaked cross-package into Atlas,or am I missing something the Configuration should have loaded?",
"Is there an easy way to convert a hex represention like `FD FF FF FF` to a byte array?",
"Where can I find documentation on FFI that includes examples of audio/video/USB input and output?",
"How do you cleanly uninstall a package like seaside from pharo?",
 "Why wouldnt it work for you?",
"Is there a stepping debugger / mode for pharo?",
"properly/thoroughly use the debugger?",
"`aByteArray hex` returns a string with lowercase `a-f`. Isnt uppercase pretty standard with hex?",
"custom cookie  in the case of successful login?",
"use of ZnServer?) Regarding,the session object is there a way to make it persist server restarts?",
"Is there an easy way to round a DateAndTime to quarter of an hour?",
"Thats not very different to mine above,right?",
"going crazy,ZnCurrentServerSession does not have a setter for modified,only a getter. Does zinc cookies?",
"zinc-sso-paper.md? If not,where I can read about how to set it up?",
"How do I install package: Zinc-SSO-OAuth1-Core?",
"is there no way to hook into `DialogWindow`s `ok` action?",
"What kind of problems does pharo is great for?  Is it great for concurrent programming?",
 "whats is a evolving program and Moldable tools?",
"Does it mean that Pharo could be good for data analysis?,What to you think, ?",
 "is it possible to have a method editor tool opened for multiple methods at once?",
"open multiple tabs?",
 "Wouldnt it be cool to activate slot templates by default in Pharo 7?",
 "how much should I bother you with nice to have changes?",
"anyone knows of examples of querying objects either by name or by identity ?",
"is it in principle possible to load pre-compiled code?",
"how (un)stable is Pharo64bit for linux compared to 32?",
"are there windows builds?",
"I use a 64bits VM ?",
"is there a graceful way to deal with multiple exception types?",
"Do we have a Pharo 6.1 64 bit image with Iceberg ?",
"60528 is 6.1 yes?",
"Where did you get rhe image from?",
"How can I get Pharo to recompile a Unified FFI method?",
"is it possible to access the original exception from Debugger/DebuggerSession?",
"but I dont see if there was an answer to that question?",
"Any suggestions?",
"Does Pharo maintainers generate  Zeroconf Script after every next version manually?",
 "so zerconf site contain all the major releases since the fork?",
"and whats Threaded and Timer Heartbeat  kind of alpha,beta releases?",
"something that can be done?",
"Anybody have a glue what is wrong here?",
"I think the help phrase is: Did you try turn it off and on again?",
">  Uhnak so zerconf site contain all the major releases since the fork?, since what fork?",
"> and whats Threaded and Timer Heartbeat  kind of alpha,beta releases?",
"> and whats Threaded and Timer Heartbeat  kind of alpha,beta releases?",
 "are you on linux?",
"the OpenDBX driver of Garage because it relies on Native Boost?",
"> I guess we donâ€™t have a dedicated â€œdatabasesâ€ channel, you mean #databases ?",
"Anyone as an idea on how to fix this ?",
"but... ?",
"because of 64bits VM or CLang 5.0 ?",
"It is possible to have a binding working for 32 and 64 bits API ?",
"I found references to NBExternalAddress in libclang binding,can I replace them with ExternalAddress ?",
"so everytime I have uint32 you have to transform to uint64 ?",
"unsigned == uint32 ?",
"so unsigned should be replaced by uint64 in a 64bits VM ?",
"I guess,if I use long (FFILong) their size will depend on the platform ?",
"I should fix uint32 with long ?",
"Should I use a FFITypeArrayType instead ?",
"I was expecting something like that,what should I use ?",
"how is getPresumedLocation: self,filename: fileValue,line: line,column: column.?",
"it crashes where?",
"in the call?",
"why not strange ?",
"There is no way to attach a gdb when it crash or have some log info ?",
"> There is no way to attach a gdb when it crash or have some log info ?",
"A class  with class variables that has been initialized is consuming memory until the class is deleted,right?",
"Is there a way to warn class that there is no more instance?",
 "and how many of them hold things of any significant size?",
"or asking differently... how large is whatever you are trying to free?",
"How junk is handled in the long term?",
"How class variables shall be initialized? by the first instance in new or by the class itself (in initialize)?",
"for one way being used in one case and the other way being used in the other?",
"appear in the object hierarchy?",
"tool for var?",
"Thanks Cyril -where do find the variable button?",
"Peter - Calypso?",
"hello everyone. I experience Pharo hanging when I try to remove a class. Thats Pharo 7 32 bit. Is it a known bug?",
"report it,if not?",
   "ahaâ€¦ should I attach the image?",
"been reported already?). Should I attach an image?",
"Which class are you removing,is Pharo crashing or just unresponsive for some seconds?",
"Are you removing a class that is still expected to be alive?",
"Any good implementations of URIs for pharo?",
"what are your requirements ?",
"do you have precise use-cases where its incorrect ?",
"OK yep. In this example (LOGame) why would LOCell use direct access and LOGame  go with the setter?",
"ðŸ¤· laziness,lack of perfectionism ?",
"but most patterns are not purely symbolicâ€¦ how would you detect that the dozen `String >> trim` methods are related and how ?",
 "Calypso and refactoring,what is the state of things at this point?",
"is there a (visual) tool in Pharo for comparing two strings?",
"changes),but how to open it (the best one) on a couple of string?",
"according to SystemAnnouncer comment...,> BEWARE: You should not need to subclass me.,,Why?",
"SystemAnnouncer to fire my event that are releavant only to certain packages?",
"â€¦btw,I can fantasize of a comparison tool for arbitrary objectsâ€¦ just by chance,does it exist?",
"way of Glamorous Toolkit,no?",
"Hi! Is there a relevant channel to talk about Calypso?",
"which do not fit)?",
"How to set/change the text color of a morphic button?",
"Hi,is there a way to debug memory leaks in FFI?",
"Does anyone knw wherre the ssh plugin for the amrv6 (R Pi) version of v6.1 is?",
"Is there a Pharo-based browser for the posts at forum.world.st?",
"whats a Matrix client?",
"Is there any way to get to browse the class and not Object in this case when doing a Browse full?",
"is that not correct?",
"Phil Can you open a bug entry?",
"good. Not to be found on the play cache. Is there any way to get some undo/redo?",
"Any idea on how to have less of that?",
"but then slows noticeably. Is it the code-completion which causes this noticeable lag?",
"Damn. Rational given?",
"Time for a PSoC? aka Pharo Summer of Code?",
"How much are we talking about?",
"t0suj4#6460;What do you guys think about Self?",
"@t0suj4#6460 what is Self?,Could you provide some link?",
"Do we have three state checkbox?",
 "what is your long-term vision for scale? is it something you plan to support going forward?",
"or was it more of an experiment?",
"You want something like (true,FALSE,nil)?",
"an unresponsive image,that gets working again only after closing chrome (and produces a `Connection timeout message`). Should Pharo Chrome froze the Pharo image?",
"not supposed to be launched as a separate process that you can control inside the image?",
"btw.: Why smacc? Why petit parser? What is good for what task?",
"Is there a new 64 bit Mac vm somewhere?",
"structure that I am trying to call?",
"so apparently moving classes between packages create their AnObsolete twins?",
"is there a way to automatically fix the obsolete nonsense?",
"What are the ways  that the Pharo image can talk to,the underlying OS?",
"because is not finished?",
 "Hi! What is the difference between a Breakpoint and a Watchpoint?",
"There is no FFI channel ?",
"What is the difference between ExternalData and FFIExternalObject ?",
"UFFI does not work with 64bits VM ?",
"Do you know difference between ExternalData and FFIExternalObject   ?",
"Do we have examples of complex bindings using Pharo (that works) ?",
 "what do you mean ?",
"what are your use cases that you deem complex?",
"we know the structure of FFIExternalObject ?",
"About FFIOpaqueObject what can we say ? They are used instead of FFIExternalObject when the C structure is not know ?",
"OpenSSL is working in 64bits VM ?",
"BTW,why sometimes C structure are opaque ? For encapsulation purpose ?",
"there is a booklet?",
"Anyone use TalkFFI to build bindings ?",
"you dont use them for having a high-level API instead of using directly the StropheLib  instance ?",
"some caching,maybe ?",
"Is this a bug?",
"I guess thats part of Zinc?",
"acceleration ?",
"Where can I find the Zinc-Websocket package?",
 "did you try the 7.0 in 32bit in the Tree view?",
"Can I see who wrote a certain piece of code in Pharo?",
"Can I use inline LaTeX math in pillar?",
"html file?",
 "are you using the docker image?",
"did the latex failed?",
"what is the contents of the tex file?",
"Which one?",
"Can you try in running text first,?",
"Whats running text?",
"look for the R3CubeShape,R3WallLayout,and UberPresenter  classes...,1 request:  please include the example classes in the suggested pharo version?",
"cool I wanted to jump in and experiment,but....,Is the code available somewhere for that example?",
"Screenshot%202018-02-19%2012.09.22.jpeg?",
 "you should ask me ?",
"About Pillar?",
"Or about SVD?",
"is there a way to have a styled label morph?",
"what is styled?",
"do I need to do something special to reindent a XML file?",
"Is there a place we can post issues with XMLDOMParser?",
"What it dependency?",
 "why we didnt replace our file dialog with yours?",
"Hmm... but will that ever be done?",
"So is this not an instance of the Squeak disease? (Not doing the next step because one could do better?",
"is there a way to have it as an external project,or would it be incorporated into pharo core code?",
 "is there a way to have it as an external project? does it become part of pharo?",
"git subtree or submodule maybe so it works in the current setup,but still keeps it separate?",
 "so what is the bottom line here in regards to external projects?",
"overriding methods... because I have no idea where it should be replaced properly.... UITheme (which of itself is a very confusing name for me)?",
"I havent used P7 in a long time,so maybe I need to do something special somewhere?",
"anyone experienced this?",
"Im generating a method,and it gets assembled by several messages/objects. Whats the best way to generate formatted code?",
"sprint with Pablo. Do you know the state of this?",
"Where would I specify that (other than maybe putting a preLoadDoIt in *every* baseline I write)?",
"CI Question #2: What is the most painless Linux flavor on which to install Pharo?",
"Why gitlab:// and github://? Or psql://?",
"Well,why is gitlab/github used? What sense does it make to hardcode these websites in uri schemes?",
  "what do you mean it works without any git?",
"does that work? wouldnt that try to look for .mcz ?",
"Ok,I checked not with monticello. So is the reason for that is actually monticello?",
"Can I do that?",
 "do you have some instructions (documentation or tutorial) on how this can be done?",
"in the Pharo ast,is there some kind of node that can represent a reference to an existing object?",
"ah,so it needs the reflectivity compiler?",
"intermittent ?",
"ok cool  you sure they wont pollute ?",
"would it be ugly to define a `#ifEmpty:ifSingle:ifSeveral:` conditional on collections ?",
"I still have some problems with UFFI. I have error messages like: Cannot use integer as pointer. What does that mean ?",
"is there a way to profile how long various dependencies took to load?",
"personal load scripts,I do `onConflict: [ :ex | ex allow ];`,but how do I overcome this w smalltalkCI?",
"Hi ,could you open a smalltalkCI issue with some details on your load script?",
"is there a spreadsheet-like widget in Pharo?",
"that took me an hour?",
"Hi,is there some tool for plists?",
 "what kind of tools you have in mind?",
"people are being too active?",
"it is getting a bit insane... uhm,interesting? good?",
"I dont really know how well private git repositories are supported in Iceberg or Metacello,are they at all?",
 "Great! Maybe we could compare notes?",
"gitlab-smalltalk-ci). Is it similar to what youre doing?",
 "How did you handle artifacts? I havent addressed that yet?",
"error stack?",
"Is there a way to get Metacello to put more verbose output to the console?",
"are you adding class instance variables,or class (shared) variables?",
"Does anyone know whats the status with pharocloud?",
"And it requires that container will be with BlGridLayout?",
"Where is the glue code that connects Travis CI and smalltalkCI?",
"hrmmâ€¦ for which reason could `Author fullName: me` be ineffective when called from a script.st ?",
 "You have dependencies and formulas between the cells like in a real spreadsheet already?",
"Does someone knows why TestCoverage inherits from ProtoObject and not Object?",
"is it possible to prevent the same image from being opened twice?",
 "do you know the cause of that?",
"I dont know how to proceed. There is a file called Spur32CogVM in the download. Is this the vm to use?",
"display driver. can anyone tell me what to do?",
"is there some filewatcher component in Pharo? or do I need to create a new thread in which I manually check an external file change?",
"I have a question. Is there something as an Attribute tree in OOP?",
"birthdaypartieswithbooze ?",
"what is an attribute tree?",
"does that work when I use metalinks in tests (as a cheap alternative to mocks/stubs)?",
"also,is this a bug or a feature?",
"Is there a a simple way to fileout a package which uses Cypress format (metadataless) ?",
"Againâ€¦ any clue why `Author fullName: me` would not have any effect with the `st` commandline handler?",
 "iirc moving the image resets `Author`,so maybe thats whats happening?",
"its a feature... I guess in a startup initialization?",
"explain how /bin/mv is supposed to know about that ?",
"Have anyone  installed the original Smalltalk-80?",
"theres one running on an actual Alto at the computer history museum ",
"I guess Windows also support signing. Do you plan it?",
 "how much of that is opensource? (I guess wooden is?) ... also do you know what kind of VR it is?",
"handles HTC Vive?",
"Mini vMac emulator with Mac Plus yet. Do there exist any more version that I can use,maybe one for Windows?",
"There is an Oculus CV1 over here to try whatever  Now are ghe bindings in a 64 bit lowcode VM on Windows?",
",> Im pretty sure smalltalkCI explicitly disables this,Disables what?",
"because it is a metacello protocol and not an iceberg protocol?",
 "Is there a way to have smalltalkCI split the loading and testing between two CI build stages?",
"Hi all! Someone with knowledge or experience with Hapao coverage tool?",
"What is ",
"what does that mean? How/where are they used? Can they be used for other purposes? What is the license?",
 "How does one skip testing in smalltalkCI?",
 "ah,okay. I was hoping to avoid an extra STON file because Iâ€™d have to copy it into every repo,no?",
"@Marcus how does one use Pharo Docker? Are they hosted somewhere like Docker Hub?",
"Hapao?",
"Can somebody recommend the right Pharo framework for me?",
"backend to execute,etc.),Question is which framework will be most convenient for this work (Bloc? Roassal? Roassal3D?) and what would be the most relevant examples to learn from?",
 "Thanks! Is there an example of a Bloc multi-step animation anywhere?",
"seconds,then do this other thing for 10 seconds?",
"is it generally recommended to use 32bit vm?",
"@vivus-ignis#9641 are you using debian8?",
"can I add a morph into an arbitrary position,ignoring the layout ?",
"is there a way to mount a network disk ?",
"or otherwise anyone using OSProcees on Windows?",
"that is strange... are you sure that the tests that should test the class-side methods are in the packages matching the patterns?",
"Maybe the problem is not the class-side but my tests are extending from BabyMock2TestCase insted of directly from TestCase?",
"Maybe the method instrumentalized by Hapao does not maintain the original pragmas?",
 "Where can I get ATS ?",
"How can I install it ?",
 "Are you sure that the packages you are matching have unit tests?",
"OSSubprocess must use a threaded heartbeat VM. Does OSProcess also must use a threaded heartbeat VM?",
"If you have a playground and use cmd-g I open a second pane with the value. Is it possible to close that pane again?",
"Is there a Phratch package / implementation which works with the actual Pharo release?",
"how do I convert a morph into a form?",
"imageForm ?",
"Ñan you check if it is related to shortcuts settings which I introduced?",
 "Is that normal that I see a world menu entry family contact book from commander?",
"Is that normal that: `#aSymbol allButLast ==> aSymbo? Shouldnt it return a Symbol instead of a String?",
"In the screenshots,what are the windows being used for displaying code?",
"in the system (perhaps a Bloc-based workspace?",
 "do you know how (un)usable this is?",
"did you stop adopting because it was too complex/too broken?",
"<rant>how the &$#@ I attach a cmd+s key binding to a rubric component?",
"older versions of Windows?",
 "how slow do you think would be using metalinks as run-time asserts?",
"Why not just test it out on a partition of your code and profile it to see what the overhead is?",
 "so if the price would be too high,then the alterntive would be to change the bytecode I guess?",
"or what would you do?",
"is accessing all the variables better?",
 "Would the Null Pattern help?",
"Hi all. Im starting a project which Id like to use in both Pharo and Cuis. Are there any pointers to best practices for this?",
"Share some experience? Or is this a very stupid thing to do?",
"Why would you want to do a project with both Cuis and Pharo ?",
"Pharo). But Cuis and Pharo cover the same use-case,so what is the point ? Is it a non-technical reason such as you want to use both to please your manager ?",
"as members just were removed from it). Is there a way this can be fixed?",
"can add us back?",
"what you mean by history ? also what you mean by private ?",
"I guess the server is back?",
"what was kilons bot doing,btw ?",
"for what ?",
 "The vm problem I detected last week seems corrected. Can you confirm so that we close the issue?",
"Hum... Then why our build are green ?",
 "Will you revert to the old stable vm?",
"caches or something?",
"If it is planned to release Pharo 7Â with another theme maybe this theme should be changed now?",
"suggestions?",
 "Loading of the libgit2 library fails for some reason. Do you have `otool` or `nm`?",
"what exactly? substraction date by string?",
"`UUID new asString`?",
"also,why DOS timestamp? why not UNIX? or just the datetime itself?",
 "started writing this software in .. uh ... 1999? 1998?",
"anyone ever played with adding pharo support for sonarqube?",
"Does telepharo have any relationship with TeaTime/TObject that came from Croquet?",
"You mean as in discuss it with people here and be open in development?",
"declared here?",
"be installed maybe so havent been declared as dependencies?",
"is it possible to prevent pharo from opening the same image twice on pharo level?",
 "do you know if theres a calypso extension that adds a method group for methods that contain metalinks?",
 "is it possible to select multiple methods,so I can see the code of all of them?",
"BTW why you are using named: ?",
"stability by making the tests more rigid?",
"define brittle... that when you change the contract the tests break?",
"to do this a few years ago with Java and it just became too complicated.   ",
"do you use to store image in synced drives ?",
"yes was my impression...   chunking image binary files isnt possible ?",
"so we may take that into considerations and change the default image folder to be ... ?",
"if image file is reopen send a signal ?",
"PharoLauncher says cannot detect Pharo executable in  (on windows,obviously). Any one recognizes that?",
"Students got the problem during the past week apparently.  ?",
"Maybe I dont have the problem because I launch as admin by default?",
"a raspberry maybe ?",
"A Linux?",
"what is the simplest linux distro today in terms of pharo installation ?   Ubuntu ?",
"do they virtualize it ?",
"its debian not ubuntu ?",
"if I want a small linux installation,what would you recommend ... still ok with Pharo ?",
"Xubuntu ?",
"akgrant0710#4807;Has anyone tried running the linux version of Pharo on Windows Subsystem for Linux?",
"But it was some month ago. Maybe it is implemented now?",
"#offtopic  seems to still be there under PHARO category. What happens if you click on the hashtag in this post?",
"dont know is the relation to SPEC. If I want (in the future) cool bloc based UI (hey they just look great).. Do I have to do my UI in SPEC ?",
"directly in Bloc ?",
"so this is the plan ?",
"Roassal integrates with Spec ?",
"Why are there both `StHub/PharoExtras/Phexample` and `StHub/Phexample/Phexample`?",
"Also,is there a `PharoExtras` equivalent on GitHub?",
 "I guess the `PharoExtras` team would become a GitHub organization separate from `Pharo`,right?",
  "Do we really need PharoExtras if we have catalog?",
"repo. So what the purpose of separate PharoExtras ?",
"how can i build a baseline that loads packages inside a github subdirectory?",
"any project doing the same so i can look at its baseline?",
"required package is only loaded once?",
"Hey everyone,what is the status of the TinyBlog tutorial?",
"source?",
"Hi there. Is anybody aware of any socks5 proxy support in ZnClient or other pharo libraries?",
"urrh. Recovering lost changes is broken?",
"can anyone advise how to get back a class and a few methods from the ombu mess ?",
"XMLHTTPExeception: (ZdcPlunginMissing) SSL/TLS plugin initailization failed (VM plugin missing? OS libraries missing ?",
"OK,I got it working on 6.1. Do you have ZincHTTPComponents installed?",
"Hey guys! Is the Catalog supposed to be working?",
"might have been network timeout. close and reopen catalog and wait a minute?",
"valid,it execute some other code,,Do you know if someone has already done this ? Or if there is some work I can look into to create this tool  ?",
"Was the pragma `<localClassMethod>` a way to get private methods?",
"I submit a bug or something ?",
"side question: no way to do it from the image ?",
"any clue why Epicea would fail loading code changes even if I take an image from before the file stream breakage ?",
"We should have something to prepare and ease bug report. No ?",
"does it mean the ombu files themselves have been corrupted ?",
 "how can I globally disable some rules for entire image?",
"maybe its just for Pharo 7?",
"I see... so deleting the class is the only option in P6?",
"Is there some kind of working Mongo Browser that can do simply CRUD operations?",
"is there a way to force close all file descriptors?",
"like to free some IO?",
 "How are Metacello conflicts dealt with in smalltalkCI?",
"any other. I work primarily in Web Dev,and was curious how difficult it would be to build a simple CRUD JSON API in Pharo?",
"Has anyone else seen this?",
 "IOW delete my local clone of statespecs?",
"build,no?",
"I heard a while back that Pharo 7 might support android. Is this still a thing?",
"Are there any tricks to getting the pharo uninstaller to work on win10?",
"out?",
"future?",
 "have you tried implementing a custom reader?",
"Im still learning my way around Pharo.,,Is there a nice way of jumping from a method to a test?",
 "Hi,what is a custom reader?",
"representation class (e.g. Task)?",
"Is there a migration guide for the new traits?",
"(how can i send a code zone in discord ?",
"Hi - Im wondering if there is anything  Dictionary related that helps with jumping down JSON structures as returned from NeoJson?",
"I missing some obvious trick?",
"go about finding out,within the Pharo environment,which classes it uses?",
"Does anyone know a pharo API to access facebook graph?",
  "how you enable suggestions?",
"> In latest version it is replaced by Calypso Commander based menu., is that latest `master` or `dev`?",
"Did you see problems?",
"Pharo-Launcher 1.1 use a 64 bits VM but apparently you can manage only 32 bits VM and images ?",
"How can I make a Spec TextModel scroll to the end?",
"How about making a Spec window close when a key is pressed (e.g. space or escape)?",
"How do I hook on the key events though? do I need to drill down into morphic?",
"of focus. Where should I bind the key events to make them work most consistently?",
"(On the text area,the button,the window,or all of them? Or pick one and give it focus?",
"iirc they are always bound to the top window regardless of where you bind them in spec?",
 "did you download Pharo 6.0 for Windows? And it does not work?",
"action for the GTInspector. Should I expect the `inform:` messages to appear smoothly while this is running or will my computation block the UI updates until the end?",
"(Perhaps there is a way to tell the world to update itself?",
"Why you dont use a Transcript instead of UIManager ?",
"(there is no flush-like command in UIManager... you are using the MorphicUIManager ?",
 "cant you just use `path/to/file asFileReference` ?",
"have you tried OSSubProcess?",
"(the new is not working ?",
"cant use it for streaming from files on disk?",
 "is that true for Pharo though?",
"Hello,,Do you think thats a problem with DataFrame or NeoCSV?,Could you create an issue?",
"akgrant0710#4807; have you tried OSSubProcess?",
"Is git good enough to allow this? considering the kind of change we do?",
"but doing all change like that?",
 "I recently re-watched Linuss old google tech talk about Git from 2007 ",
"akgrant0710#4807;Is there a tech talk today?",
"The question is: could you not have that feedback loop in the same language/community?",
"On Windows,I seem unable to use those GTExample shortcuts. Normal?",
"What is the simplest way to parse XML files ?",
"Can can the result of a parsing equals the parser itself?",
"> What is the simplest way to parse XML files ?",
"is this the canonical way to sum numbers?",
"no such method,I guess P7 only?",
"Is Christophe Demarey online,or anyone sharing an office with him?",
"google drive? s3?",
"Could you be more specific about what hasnt worked out?",
"Ah,thanks .  are you on Windows as well?",
"Hi,Is it possible to prepare minimal image from my pharo instance with only my module and dependiences?",
"run it on my server instance without gui and connect into it with another pharo image for debugging and profilling (like in Erlang world)?",
"Nice to hear. Do you consider to add some new concurency model for example akka...like in Scala?",
"where can i find examples of source code decoration in the class browser ?",
"Is there anything like this already?",
"So the VM give us right now the biggest restrictions on concurency? It is impossible to create light threads like in Erlang ?",
 "Do you know ImageWorker?",
 "how to deprecate a class?",
"do we have something like a partition method?",
"Is it on a clean image?",
"Character class,but these are individual characters,and I can only add strings to the stream. So how can I create a string from an individual character?",
"Is there a way to search for a pattern in the whole Pharo image?",
"For example is it possible to look for all methods containing two times in a row the same message in a cascade?",
"I didnâ€™t see any on a quick google,but do we have a protocol buffers implementation that people like?",
 "maybe rewrite rules could be adapted for such task?",
"is there a way to jump to the end of the line in the system browser other than pressing end?",
 "is it possible to limit commander activation only for class in a specific hierarchy?",
"Hello,Can I restore the image after Pharo stopped responding and was force quit?",
 "how well does Commander play if I want to override/remove certain action?",
"Can I load the saved version into the image?",
"I guess it would require some kind of composition of `canBeExecutedInContext:` methods?",
"but this is all-or-nothing?",
"is there some where a monokai theme for pharo I can download?",
"is there a XSLT library for pharo?",
"how come ?",
 "would it be possible to interactively create editors on a specific selected context?",
 "Is the XML editor available in Moose? Or is it a tool extension from Pharos XML package?",
"to get **GLMXMLDocumentHighlighterTextStylerDecorator**?",
 "do you have XMLParser installed?",
"> in Pharo 7,maybe XMLParser loads different packages in Pharo7?",
"create the channel? Any admin out there?",
"Anyone remember this?",
"SystemCommands project?",
"sergio_101#7383;does anyone know if its possible to use telepharo (server?",
"sergio_101#7383;also,is it possible to turn telepharo off/on via the command line on a running image,so that its not on all the time?",
"sergio_101#7383;hey, .. youre the one who put TelePharo together,correct?",
"sergio_101#7383;What woud the syntax of a monicello update for a package look like?",
"Hi guys - if your laptop dies without saving your image - is there an easy way to recover what you were doing in Pharo 6?",
"the doits i executed in the playground. The changes file doesnt seem to show those doits either?",
"those in the the changes file - but Im wondering what the Pharo answer is to this now?",
"that the menu doesnt show). So that gets me further. Is this something I can always rely on?",
"Poking around - what is the ombu-sessions folder?",
"we have a form of full audit log anymore?",
"how do you mean log tools that you use?",
"like complete audit of every action you take?",
"after all... what even is a tool?",
"more obvious? I also wonder what happens if you make any settings changes - would those appear somewhere?",
"the change sorter does some of that (if it still exists; i think it does?",
"> but we could make that more obvious?,what is the use case?",
"anything of the sorts... do you know more detail?",
"sergio_101#7383;what would i say for `updateTheThing` ?",
"Is it still possible to load and fix code with underscore assignments?",
 "what exactly is the problem you are getting?",
"maybe some sort of network failure?",
"do you have metacello integration enabled?",
"what does `IceRepository shareRepositoriesBetweenImages.` say?",
"can you disable it and try again?",
"Is there a possibility to manage the heap usage of the vm from the image?",
"lists of method stamps?",
"any reason not to use the metadata-less version?",
 "how refinable are virtual method groups?",
"so the question is... to what extent is it possible to fine-tune this?",
 "What exact warning you are talking?",
"Anyone has cycles to take my FreeType2 crash analysis and do a bandaid + proper fix?",
"ok,any one have an idea what the headroom error is about?",
 "Is it a crash after the use of FFI as done in Pablo in Pharo70? Are you in Pharo 61?",
 "Pharo61 . Is Pharo70 already using the FFI approach?",
 "is there some formalism in defining undo commands for Commander?",
"you think?",
"is there an equivalent to 32-bit floats in pharo?",
 "is there a method bytecode editor tool for Calypso?",
"to enforce a single-execution thread to emulate Javascript semantics). Any pointers?",
"Hi,Is there documentation on source refactoring in Pharo 6.1?",
"ok ðŸ˜ƒ nobody is in charge of this ?",
 "Thinking more about `groupedBy:`,since it returns a `Dictionary`,what would it mean to preserve order?",
"mean you want the keys to be sorted?",
"any idea ?",
 "It seems to be as much as possible,given the restrictions of the groups,no?",
"What is it not doing that youd like it to do?",
"Anyone here whos been able to install/use PharoLauncher with some success on Windows ?",
"On another related subject,is there any all-in-one Pharo 7 image available?",
"Can you confirm that it works in a subdirectory of lets say c:?",
"Is there a handy data structure for (non-graphically) representing directed graphs?",
"Are the implementations of GetText for pharo usable?",
"Im confused about why this errors:,,any tip?",
"6.1 version for other purposes,will there be a compatibility problem ? or what ? and why voyage framwork doesnt work for me in 6.1 version ?",
 "can you report this bug in the mailing-list and open a bug entry?",
 "can you report your problems on the mailing-list and open bug entries?",
"What is the best way to install an application within Pharo?",
"something else has replaced Gofer?",
"Is there a current guide to building Pharo for iOS?",
"Is it possible to use Pillar on Windows ?",
"Hi all,is there a good documentation about UnifiedFFI ?",
 "there is no support for code rewriter in Calypso like in Nautilus ?",
"Is  there a way to get a block executed in the UI thread on a regular basis (at least 20+ times/second)?",
  "Google protobuf ?",
"Is it me or is Calypso UI in the Pharo7 image quite unreadable protocol wise in a dark theme?",
 "is it still built around makefiles?",
"Oh,weird thing. Anyone seen this?",
"Really?",
"the current system,followed by a proceed screen/debug. Why if it is in my own package?",
"Is there anything like n interactive JSON editor,with auto indentation and highlighting?",
"emacs ?",
"Is it possible to create a test object in the Playground?",
"What do you call a test object?",
"Does anyone know of a best practice for implementing game loops (or of a class already offering such)?",
"Hi! How to install Pharo 64 using the launcher ?",
"â“ Is there a (Morphic I guess) DropList widget in which you can search?",
"failure would return a different message?",
"latest = master or dev?",
"is that normal ?",
"- should iceberg and other clients take care that the change originates from a non-anonymous class ?",
 "Thanks for investigations. Can you open issue?",
"bleeding edge ? still buggy or usable ?",
 "tell me if it works on MacOs ?",
  "Any idea about dnu for visitRemoval:?",
"Well. To be pedantic.. some of the merge is done by libgit which is linked into the Pharo VM?",
 "is it possible to update the content of a FastTable while preserving what nodes were expanded?",
 "have you considered moving OS-Windows project to GitHub?",
"moment?",
 "or kind-of collect expanded information and then apply it to a new datasource?",
 "is it possible to stub messages by name?",
"#width) ...`?",
 "Why do you need it?",
 "proto as in Google protobuf?",
"nice! do you plan to support gRPC in a way?",
"but maybe it makes sense to use the existing infrastructure to generate code (or model)?",
"maintained by community only,correct?",
"is,,,the best way access SharedPool variables from the outside?",
"that often and everyone writes code in classes that import the pools?",
"Detecting the vm? What is the content of this directory?",
 "hi,what is your problem exactly ? Can it be reproduced ?",
"and what is this feature exactly ?",
"ha,but it doesnt work right ?",
"I dump the file somewhere,or is there a way to post collapsed in Discord?",
"is there an easy way how to count the number of objects in an object graph?",
"and by easy I mean... is there a ready-to-use solution,or do I have to roll my own?",
"Using DeepTraverser?",
"I was looking for DeepTraverser,but I can no longer find it in the image... is it part of some external project?",
"Can you profile memory usage with that?",
"I wanted to ask about the current state of the project DeltaWerken (by Stephan Eggermont)?",
"repository is completely empty. Anyone heard of it?",
"Why is there no forgotten password feature for smalltalkhub.com?",
"svg import support was at best a hack,and looked abandoned.,- What is the current best framework (useable in 6.x 64-bit) to work with vector graphics?",
"Ok - Ill have a look at whats there,and ask for advice on my approach. Should I continue in #bloc channel ?",
"Can you cross-post in Discord?,Does it have threads?",
"Is there some way to bake that in *before* building the model?",
"Also where does the repository/project for `Zodiac` (of `Zinc`) live?",
"Is there a way to use the interface across multiple displays?",
"Other than just stretching the window?",
"HDL. Any suggestions on how to do things like emulate IO hardware and have a display?",
"Thanks  ðŸ˜ƒ,Can you tell me more about the Language Boxes concept - does it still exist,where to find it?",
"PR  = ??",
"Python code inside of Pharo?",
"why it would allow you to run Python ?",
"do we have any python parsers that can run inside of Pharo?",
"yes but for Squeak ?",
"truffle vm?",
"Debiller 777#0364;is there a way to add set literal?",
"@Debiller 777#0364 how do you mean?",
"Debiller 777#0364;Is there way to create separate literal for it?",
"Debiller 777#0364;Can it replace native ST compiler?",
"not likely... maybe in the stack VM?",
"Debiller 777#0364;stack VM?",
"Debiller 777#0364;So I should edit it a little bit?",
"why do you think that?",
"wouldnt the same argument apply here?",
"Debiller 777#0364;Where I can find it?",
"Is the Pharo 6 or 7 VM supporting immutability?",
"What are you using immutability for?",
"why is my TestNandElement tests erroring because the selectors are going to the wrong object?",
"Should tonel.zip contains the code?",
"No idea...I just checked everything in Discord...yes...how to I get the selector right?",
"Does that help you?",
"You still save the output when setting the inputs?",
"Is there a test for builtin bools I can look at?",
"FalseTest and TrueTest?",
"In CompiledMethod,whats the difference between `#ast` and `#parseTree`?",
 "Does that mean that if I modify the `#ast` I will not be working on a copy?",
"So is it safe to say always use `#parseTree` when modifying?",
  "is the project public?",
"did you try in P6 or P7?",
"And is there a way to write less things in memory and more on disk?",
"and these two versions are supposed to be different,or the same?",
"or they are different and Windows joined them together in the downloaded zips?",
"What is the proper way to read a UTF-8 file containing a BOM?",
"Do I really have to do  ???",
"maybe I should add some forceful garbage collections?",
"When,if ever,would a user want to access a CMs #ast (as opposed to `#parseTree`) and could modifying it create problems?",
"Are there known Pharo7 debugger issues?",
"Hi. Is there a way  to import ArgoUML models?",
 "import into what?",
"also import of what? class diagrams? state machines? profiles?",
"and for what purpose? diagramming? manipulating directly with the metamodel?",
 "does ArgoUML use UML 2.x or UML 1.x?",
"What about Job?",
"is there a substrings-like method that considers full strings as separators?",
"three)`?",
"anything. Any idea what I did wrong?",
"but concretly you ask for review here ?",
"I mean integrated in an image but to get a fresh one + reviewed patch (PR ?",
 "is there a conference paper describing mocketry?",
 "also a paper for calypso?",
"Is there a way in pharo 6.1 to detect if the code is run inside a test?",
"new version?",
"the Catalog.  I am using a high resolution display and need to resize the cursor?",
"World settings.  But is unclear how to save the image in such a way that the Launcher starts up again correctly??",
"Is there any version of Os(Sub)Process that works on 64bit vms?",
"> By default in Pharo 7, the OS-Windows package is by default in P7? or is this different project?",
"and it executes some external command which opens external browser?",
"or can you orchestrate the browser like with selenium?",
"Is that expected for the latest 64bit vm to crash because of libgit? Or I fail to download a normal version?",
"how widespread is this language?",
"why it started as a squeak fork?",
"Hi is this the channel where we feed trolls?",
"but then another question arises - will it work?",
"going to a Ferrari dealership and saying,â€œcan you just drop this Camry engine in there because I really care about fuel economy?",
"out?",
"get those numbers?",
"analysis tools to work on your JSON?",
 "Did you check memfree before loading that JSON? How big is the JSON in the file?",
 "Did you measure eclipse memory usage?",
 "youre using windows maybe ?",
"Is there a reason why downloads of Pharo are throttled?",
"Opensmalltalk-vm/Cog soon(ish)?",
"akgrant0710#4807;I thought the sista builds were non-critical,i.e. they dont stop the pharo.cog.spur builds?",
"can you fix it?",
"Isnt that weird that Sista is red after a change in dependencies?",
"Because Sista has nothing more to do with dependencies than spur no?",
"group.  The sista builds are part of the Other linux builds group.  So if the sista build fails,it doesnt impact the main group.,What am I missing?",
 "could you describe MetaLink in one sentence?",
"AST at runtime be correct?",
 "try that again in laymans terms?",
"A mechanism for injecting custom code execution into a runtime of another code.?",
"but what can you do with metalinks besides code injection in the end?",
"nothing?",
"but i think (its only a personal opinion) that if you use non-intrusive (in a paper?",
"sergio_101#7383;another question.. which pieces do i need to recreate a pharo image and run my remote image on my local machine?",
"Pharo.image,Pharo.changes. .anything else?",
"@sergio_101#7383 I will check. What pharo you are using?",
"Are you sure this is a spur VM? Is your image 32 or 64bit? And is your VM 32 or 64bit?",
"connection.. if that makes sense. is there a some data residing in the client that i can flush when this happens so that the entire handshake happens all over again?",
"sergio_101#7383;what happens in this case?",
"something like: ./pharo Pharo.image eval (Smalltalk at: #ConfigurationOfPrintBot) loadDevelopment. does the running image execute that?",
"dirty way to save the image running in the background?",
"Do you have a SqueakSSL.dll file with your VM?",
"now but I dont really have a feel for how to decide which categories are appropriate. Is this covered in some book/blog/post somewhere?",
"I think that my problem is more that I dont know how to choose the right category names (what is accessing exactly?",
"frustrating that you cannot see what exactly failed. Do you think it would be nice if the growl morph could be clicked to see the exception?",
"processor?",
"sergio_101#7383;do the FileSystem methods have any way to overwrite files?",
"sergio_101#7383;hmmm.. `fileReference deleteIfAbsent: [] . `? <- is that lame?",
"Would there be a way to have Pharo prevent the automatic installation of updates on Windows?",
"Does someone knows the internals of PluggableButtonMorph?",
"Sure,what are the issues?",
"Also,does someone knows how I can profile the rendering of a Morph and its submorphs?",
 "You mentioned that you did some `BlockStyler` changes. What are they exactly?",
"being a message passed to a boolean versus another languages conditional statement?",
"longer to execute?",
"Hey everyone. Do you know the boring GT Inspector demo of  where he shows how to make a custom phonebook presentation?",
"an *image* is 32 or 64 bit?",
 "Yes but how do you launch a command to get if the image is 32 or 64bits if you dont have the right VM?",
"Question: how is one supposed to load PetitParser (not PetitParser2) in a Pharo 6.1?",
"loaded the same as Pharo5.x but it loads Glamour dependencies etc so,thats a bit of a hit and miss here. Advice?",
"Where is PetitMarkdown gone?",
"A bit harsh on the eyes. Could the line be behind the text?",
"EPASTInterpreter - apparently a subclass of OptimizedASTInterpreter. Does anyone know what that is,what package is it part of?",
"Thatâ€™s what I have been contemplating,anyways. Any thoughts or suggestions?",
"Shouldn get.pharo.org/64/vm70 download the sources as well?",
"image opens with 1px window size. Can this be corrected via an expression?",
"Pharo cest pas si facile!#4034;hello do you have topics for using json data ?",
"to do it? Should i use a loop or is there a simple command to do it ?",
"best way to get all deprecated classes ?",
"how to run moose_suite_6.0.app on Pharo5.0.app on mac 10.13.4 ?",
"Roassal(?) canvases in there?",
"Which is the current place where I can get `Beacon`?",
"Anybody thought about using Pharo for blockchain applications? For example on Steem?",
"has done a similar project where they needed to interact with a multithreaded c/c++ program and what their solution ended up being?",
"reasonable solution?",
"That sounds like a job for Smalltalk,Squeak,...,Pharo?",
"Has anyone successfully experimented with the techniques in the paper â€œGenerics and Reverse Generics in Pharoâ€?",
"the 3 examples with low dependencies aside from the image so we can reproduce easily.,,Thanks.   Anything like that available ?",
"Is there something like a hex explorer for a given bytestream,kind of like ResEdit back in the day?",
"forensics?",
"story.php?",
 "maybe?",
"just a matter of loading the data twice or more. How do we work together on this?",
"Anyone here have decent Polymorph experience?",
"Or anything to do with Pharo theming ?",
"Painful experience?",
"Are there ways to add new behavior to themes that doesnt already exist?",
"yes,no,it depends :). What kind of behaviour?",
"Can I send you what I have so far?",
"Is there something else to do?",
"First: Did you try to use Pharo or Pharo launcher?",
"What happen if you just type `./pharo`?",
"How did you install it?",
"whats Platinum UI,@darth-cheney#2128  ?",
"Do we have BCrypt for Pharo somewhere to hash passwords?",
"@darth-cheney#2128 Glad youre still experimenting - so cool! What Pharo does it load on? Are there prerequisites?",
 "I noticed that,but arent there also new methods in those themes? The ones that start with `glamour*`?",
"whos with me?",
 "What about it do you find annoying and how do we make it better?",
"Hi! Is there a separat mailing list for questions concerning the VM?",
 "So pharo-vm-dev@lists.pharo.org would be appropriate?",
"maybe they are and I dont know it?",
"Anyone know what the VAT situation with consortium bills is?",
 "what need to be fixed?",
"theme?",
"Im using the last version of Pillar.  How I can generate the spiralbook version ?",
"you mean the one using the square brackets associates latex template?",
"and then how do you build the lulu-format PDF ?",
"btw,shall we open a #pillar channel here ?",
"Im thinking of how to build the bot discussed above. Maybe you have somebody who can advise?",
"is the pharo ide built on any sort of gui toolkit like gtk?",
"so how does that work? does the windowing system just give pharo a blank canvas to write on?",
"<eyebrow> will it still use morphs?",
"Hi! Im interested in learning Smalltalk because of Alan Kays talks about it. How close is Pharo to Smalltalk?",
"and understand all the good ideas of Smalltalk?",
"Yo what/where is the package that colored nested blocks in source code?",
"The same happend with Squeak: from 2001. I really am (or maybe: have been?",
 "what lets throw it all away mentality?",
"What is the best book for a beginner about PharoJS?",
"Maybe Roassal?",
"Hi! Is it possible to somehow same a smalltalk program to file?",
 "and how can I export to file?",
"load the image to Pharo?",
"oh,the readme says something about a new image,how can I do it?",
"Hi,is this possible to have margin icons in the debugger,like the one we have in the class browser?",
"if so,where should i look?",
"can IconStyler work in the debugger?",
"Whats happened with the workspace?",
"in Pharo7 ?",
"and can it happen on any code?",
"there is a newdebugger mailing list??",
"github,SmalltalkHub,etc ...). Where is the last version ?",
"recreating a terminal window in Morphic or whatever?",
 "So if I run `bash` as a subprocess and dont wait for it to finish,how can I put something on `stdin`?",
"@darth-cheney#2128 Did you read this: ",
"Doesnt that cover your use case?",
"Can you describe what youre looking to achieve?",
"I see. In that case,did you try to postpone closing the stream until youre done completely?",
"else on the screen (not on it).,,Does someone knows how I can do this with Morphic?",
 "Where did you get that url?",
"seems down. What is the status of the project?",
"how do I rewrite code that relies on `aStream lineEndConvention: #lf` ?",
"image,say,or a .st file),and the buttons to open install etc change â€” where can I set/adjust these options for a given file type?",
"understand #name`. Apparently `self` is bound to `false`. How that could be?",
"what is script:?",
"what is the correct way to do this ?",
"If I have a a method `C>>exampleFoo`,how can I have a simple way to execute `C new exampleFoo` ?",
"is it me,or is pharo slow on windows?",
"really ?",
 "do you have comparable hardware?",
"Does pharo manage wheel click?",
"Is it possible to export a Pharo project to be opened by Dolphin Smalltalk?",
"You can do filein/fileout in Dolphin ?",
 "in which university are you?",
"t0suj4#6460;Have anyone tried pharo on Linux on Windows (WSL)?",
"x64?",
"you install ia32 libs?",
"Is it possible to abort the execution in the playground after a given time?",
"I tried to load PetitParser2 into p6 from catalog browser,but it failed. How can i load it?",
"What is your problem?",
"Gettext Is the official repository of GetText?",
 "I think I saw you talk about Gettext one day. (Maybe I just do not remember well). Do you use it?",
"The main repo is on smalltalkhub?",
"PharoExtras?",
"Do you use it on Pharo 7?",
"image??",
"window?",
"Why not use OS-Windows features instead of ProcessWrapper?",
"Someones knows what is HostSystemMenus?",
"Should we totaly remove this method?",
"appropriate choice for sensitive data like a password. Any possibilities to make this HTTPS-only?",
"hmm,no #collect:thenDetect: ?",
"Is there someone with Athens experience here?",
"Is there a portable way to add all elements of one dictionary to another?",
"@Wolf480pl#9328 How about `d2 associationsDo: [ :e | d1 add: e ]`?",
 "But It seems to have nothing to do with Morphic no?",
"Does anyone know if  **MetaRepoForPharo70already?",
 "Can you please activate it?",
 "What we can do is to move this new class to Athens-Balloon aswell as the extensions methods on the fillStyle classes?",
"is there an option in latest pharo to get back the old world menu?",
"could you tell me where in the code i could look to at least hack it back?",
"Now the question is how do we keep the menu bar as it is and get back the old world menu without duplicating too much the code?",
"Did you already tried to convince students to try something that respect no standand?",
"the experiment?",
"just out of curiosity,the positive feedback comes from which kind of users?",
"ahah you are not French ?",
"What is the best way to open a window with a text in Pharo 7 ?",
"is `GLMFoundationBrick` the right thing?",
"Editable or just as a wrapping stringmorph?",
"I do not run Pharo in a VM and I have no problem. What is your problem?",
"You use HTTPS or SSH?",
"image?",
"will open here: ?",
"Install?",
"is that method reliable to clone objects?",
"anyone uses veryDeepCopy?",
"why?",
"veryDeepCopy may not work for everything?",
"and deepCopy is less deep?",
"but if there are no cycles,is the object correctly cloned?",
"RPackage,but despite seeing it,an example would come handy. Any pointers to documentation?",
"What is the `SessionManager` equivalent to `Smalltalk addToStartupList: self after: AnotherClass`?",
"precedent (see `Process`),no?",
"disabled the Quit on Launch option. Now I have the Pharo Virtual Machine launched. Should i now follow the Mooc or is there something to learn before that?",
"Are smalltalk symbols similar to pointer or constants in other languages?",
"though  LOGame removeFromSystem could do the trick but ðŸ˜… !!,I have 2 questions:,1- Is there a way to undo that?",
"for if it happened in the future.,2- How can I get a list of all LOGame in the memory and destroy them?",
"How can I determine if Im in a 64-bit image?",
 "Instance of VirtualMachine did not understand #is64bit. Im on 60540. Is it new?",
"maybe there is a is32bit method somewhere else?",
"getting errors like `CompiledMethod(Object)>>errorSubscriptBounds:`. Is there a workaround for this?",
"Nonetheless Pharo still works so probably not a big concern,right?",
"There is a PR on the VM since months (years?",
"It is a 64bits image on a raspi?",
"how soon? before ESUG?",
"but want to further understand the logic behind it.,,can anyone explain what is wrong?",
"back by message value: to the block as an argument.,Do I understand correctly?",
"Hi everybody,is it possible to open a library channel for Woden (World Dynamic Engine) ?",
"is ESUG registration opened yet?",
"Maybe this is too confusing?",
"is there a timeago/moment like project for pharo? ()?",
"Another regular enquiry. Is there a solution to an image saved in headless state opens as 1x1 sized window?",
"For the headless image: maybe setting the size of the display with the command line?",
 "should your QA work in latest P6?",
 "is the new top bar backportable to P6,or is it hard-wired for P7?",
"are the menus being left open even after they lose mouse focus or I click on a different a bug or a feature?",
"if I want some of the tools (Playground,Iceberg,...) back into the default world menu,I need to add new menu entries,right?",
 "Would you say more about the problem youre having with Launcher?",
"for this (mail,mailinglist,discord or other?",
"discussed?",
"invalidates the imperative a smiling emoji might invalidate critique as well,dont you think?",
"problems ?",
"is that a bug or expected behavior?",
 "do you have a particular reason to use GFT and not iceberg?",
"Iceberg the way to go for git?",
 "Are your launcher extensions available somewhere?",
"If I find time to clean them for them not been a hack,would you mind if I push them to the launcher?",
"Dont we all remember that special day way back when?",
"does anyone has some notes on how to use smalltalkCI on gitlab?",
 "What is the purpose of these dockerfiles?",
"But why build in a docker image if you copy the redults to another image and drlete the first one?",
"How do you access the built image in the container?",
"Wouldnâ€˜t be possible to provide the images as data containers?",
"what is data container?",
"Is there a method to chunk a collection?",
"is there some way to see what is taking all my (image) memory when I hit low space warning?",
 "did you talk with  ?",
"Not yet. On the mailing list you mean?",
"directly use the instance variable? So is `^ self getFoo + 1` preferred over `^ foo + 1`?",
"Why would that be preferable? Is it not a coding style preference?",
"Is there a an equivalent of folding/flattening a collection already in the built in Pharo classes?",
 "Hi,can you send the piece of code used to open an image please?",
"Hi,when trying to load a mcz in a recent Pharo 7,I get this error (any ideas ?",
"Tyler (Aearnus)#7521;Does it translate to something in French?",
"who can I contact regarding ESUG registration & invoices?",
"When starting PharoLauncher I get a load of options. What to choose??",
"any ideas?",
"object?",
"Does anyone know what was the last decision about the Cryptography package?",
"smalltalkhub still the valid one?",
"Or do you mean generally prevent stubbing of unexisting methods?",
"what is it with Pharo becoming unresponsive after a window resize ?",
"Tyler (Aearnus)#7521;how do you escape a `` character in a string?",
"Tyler (Aearnus)#7521;does that work with newline characters too?",
"Why dont we have `asLinkedList`?",
"dont we have `asLinkedList`?",
"Tyler (Aearnus)#7521;hey,is there any way to make the UI larger? or display key bindings or something like that?",
"> Or do you mean generally prevent stubbing of unexisting methods?",
"anyone knows whats the `#name` field of a Smalltalk CI spec used for ?",
"grrrâ€¦Â can I have a less helpful failure message please?",
"you are new to pharo @Debiller 777#0364 ?",
"you come from squeak or other smalltalk ?",
"is there a time profiler tool where I can manually trace methods and tally results?",
 "if I want to propose a contribution to Magritte,I should use your github repo,right?",
"@darth-cheney#2128 What is the problem doing it in pharo?",
"because doing it in Pharo then *having* to do it again with less advanced and fun tools is depressing?",
"it is the one where you have some kind of python server right?",
"my lib or you made your own ?",
 "what have you made with pi ?",
"did you use the pharo or python syntax option ?",
"is it safe to override `Object>>release`?",
 "Why not?",
"hi,can anyone know how can I retrieve the comments class of class in pharo via code ?",
"any help?",
"Can you provide a more complite stack please?",
"you need the code ?",
"And can you past the code you executed?",
"Which version of Pharo do you use?",
"can you send me a link to the doc of asFileReference ?",
"can you paste the code you are using?",
"is it possible to print colored text in the transcript?",
"Is there a reason to change the common Pharo API?",
"supported?,- is it installed also on the global Transcript so it catches legacy transcript outputs?",
"What do you want to do: iterate over the whole list? to a certain number of elements (+ what if there are fewer)?",
"work?",
"and for the doWhileFalse [ do stuff here] is done only once when the sentinel value is found right ?",
 "First: why are you not using the defined LinkedList?",
"but in cascade code,the seperator should be ; right?",
 "Maybe I got the context wrong but you were referring to the looping?",
"But in C# method names are uppercase,no?",
"Can you File out your class?",
"Can you File out you class?",
 "do you have experience with programming in another language ?",
"it would make the code clearer:,are we in the prepend case? if yes,its easyâ€¦,no? then are we in the append case?",
"yes,its easyâ€¦,still no?",
"have you tried running your code and checking the debugger when it says Instances of Node are not indexable ?",
"does anyone keep notes for themselves inside their Pharo image? is there a tool for that?",
"am I missing something there ?",
"Yo how many of your Pharoers are in NYC? Is there some kind of NY Smalltalk User Group?",
"you know of companies using Pharo?",
"is there a way to backtrace (from some log or something),why a particular package was loaded?",
"`whenChanged:` or `whenChangedDo:`?",
"Whats the status of `Stdio` wrt. Zinc streams ?",
"`someString asByteArray utf8Decoded` â† can we do that without the unnecessary copy ?",
"But Im concerned that the extract and load part will be annoying in Pharo. Any experience with this?",
"What about outputting dataframes as a CSV?",
"how do we glue various things together?",
"how do you do it in python ?",
"What is the best way to show a gist of code with Pharo?",
"a certain task,then youd have to share the whole virtual machine with them,right?",
"any recommendations on tutorials for that?",
"which tutorials have you done until now?",
"Pharo by Example?",
"did you do the The Lights Out game?",
"Is there such a thing as a Pharo Cookbook? Like easy tasks that show how its done in Pharo?",
"- Writing documentation,pillar book I guess?",
"Yep,thatâ€™s the idea of the final chapter. Any gotchas with calling a Pharo app from a cron scheduler?",
"Does Iceberg only work with a certain version of Pharo?",
"How do I get that?",
"That is the default download from the website now (download). Are you familiar with it?",
"executable?",
 "check out,,",
 "Did you check out Deep into Pharo ()?",
"Q: What is the chief end of Pharo?",
"What about freezing the things you make?",
 "The coulda-shoulda-woulda power is strong in you. Why donâ€˜t you just try building something?",
"is there a not-outdated doc?",
"or are some chapters (esp. Commander) actually ok?",
"Anyone recognize this one?",
"For some reason a configuration or baseline is loading Scripting package,maybe related?",
 "do you have already the image opened?",
"but another instance?",
"does the folder have the write access?",
"and last: which cmd are you executing?",
"some days like before June 29th?",
"cannot verify get.pharo.orgÃ¢?Ts certificate,issued by Ã¢?o/C=GB/ST=Grea,ter Manchester/L=Salford/O=COMODO CA Limited/CN=COMODO RSA Domain Validation Sec,ure Server CAÃ¢??:,Self-signed certificate encountered.,WARNING: certificate common name Ã¢?ocluster023.hosting.ovh.netÃ¢?? doesnÃ¢?Tt matc,h requested host name Ã¢?oget.pharo.orgÃ¢??.,HTTP request sent,awaiting response... 200 OK,Length: 15652 (15K) [text/html],Saving to: Ã¢?oSTDOUTÃ¢??",
"Is down?",
"have there been any attempts to run the Pharo VM onto the Android NDK directly,or otherwise to bring Pharo to Android?",
"i think there is some experimental somewhere?",
"What do you mean by visualizing code?",
"you mean the debugger?",
"every methods but the longest ones mostly. Maybe  have a tool?",
"do you have a particular need? What exactly from a software do you wish to visualize?",
"which expression ?",
"any Pharo expression?",
"Plenty of videos here: ",
"plugin,but it was in the directory with the image and the exe,anyone else have this problem? Is there a simple fix?",
 "do you use windows?",
"Hello. Is there a tool to load/read CSS in Pharo ?",
"remove any of the #at:put: lines,it works perfectly. I dont know what I can do. Do you have an idea?",
"is there a way to silence or redirect the VM messages about the heartbeat ?",
"Is there a way to print colored text to the Transcript?",
"@darth-cheney#2128 are you on windows?",
"from VAST Glossary),,Do you know if there is something similar in Pharo?",
 "what is the difference between Symbol and Atom in VA?",
"This is the url: freesearch.do?",
"Zinc?",
 "have you had success with SmalltalkCIs support for coverage with tonel ?",
"alsoâ€¦Â Id like to silence the pthread_setschedparam warning under travisâ€¦ anyone managed that ?",
"4 days ago ",
"maybe its only exported when the code changed ?",
"maybe its not exporting for P7?",
"Could you make a matrix chat client with Pharo?",
"I faintly recall that P7 had some changes in TestCoverage classes?",
  "can you give a pointer of commander+Spec+shortcut?",
 "Why did Beacon change from `log` to `emit`?",
"does Pharo support Windows named pipes?",
"Hello,does know where I can find documentation on how to use Network-Mail package ?",
"Hi,,does anyone know why `Date class>>#readFrom:` throws an Error if the date is in Format dd-mm-yyyy?",
"IDK but how could both mm--dd-yyyy and dd-mm-yyyy be accepted?",
"Is there an API to modify a metacello baseline?",
 "Do you know any snippets that deal with the meta model?",
"also maybe look at old Versionner?",
"Igor DejanoviÄ‡#2049;Do anyone use tablet pen (e.g. Wacom) instead of mouse with Pharo?",
"Was FastTable extensions done during GSOC 2017 integrated in Pharo ?",
 "Something like this?",
"empty,packages: { self name },repositories: #(),dependencies: #() Could calculate from Dependency Analyzer?",
"am I the only one?",
"Am I the only one?",
"@Igor DejanoviÄ‡#2049 can you reproduce that with mouse?",
"anyone know how to raise the allowed time for a test method to run ?",
"is there a tool that can generate UFFI bindings given a C/C++ project?",
"Is there a way to restart jenkins on my PR?",
"is there any benfit/downside/neutral to use symbols vs strings in pragmas?",
"with the stream monikerâ€¦ but why?",
"could the files be the proper `/dev/stdin` etc instead of files under `$PWD` ?",
"is there a notion of standard input/output on windows ?",
"akgrant0710#4807;  Ive posted a reply on pharo-dev with the subject: Stdio>>#standardIOStreamNamed:forWrite: bug?",
"Just wondering,how many of you are disabling the completion automatic popup ?",
"really?",
"There is a max on Array,but apparently no argmax (position of the max) ?",
"maybe just use `indexOf:` and `detectMax:` ?",
"it went on long enough for this to happen. should  I be concerned? and Go in and delete anything?",
"folder ?",
"can you launch the image?",
"Who are the folks in the community who work on themes/theming,if anyone?",
"hmmâ€¦ metacello loading from a local git repo got broken ?",
"am I blind or is there no parser for DateAndTime?",
 "what project is this part of?",
"SmalltalkHub is down ?",
"Is anyone using Pharo 7 in production? How stable is it?",
"worried at all that you would be hampered by seemingly inevitable bugs,or even worse lose an image/data? Did you encounter anything like that?",
"configurations that did not cover Pharo alpha. Did you experience that?",
"Is there some special thing about events that Im not understanding here?",
"Any idea of when they expect it to be fixed?",
"SmalltalkHub is also concerned with the INRIA shutdown ?",
"Is there a git repository for magritte?",
 "Is this repository not supposed to contain the code as well?",
 "Any reason this has to be that way?",
"So I could use the git migration tool and could prepare a pull request. Would this be something good?",
"I dunno who is the author of Magritte ?",
 "Or do you have any other objections?",
"How can I read tonel files with pharo6?",
"You mean programmatically ?",
"Yes. Or should it work out of the box with latest 6.1?",
 "I noticed you are closing a lot of issues. Have they been resolved?",
"Did anybody use QC-Magritte?",
"About what is the latest book?",
"the game using the  CTRL-SHFT-ALT-click command,but keep picking off cell instances,not the game instance. How can I kill the game instance?",
"I have some code in a Playground that I would like to save. Is that possible?",
"application to a friend,and he cannot open it. Anyone has seen this?",
"what was the last Pharo version that supported NativeBoost?",
"P5?",
"P4?",
"What would be the proposal then? If there is no valid prior message then cascading would a syntax error?",
 "you can cascade unary and keyword messages,why should binary messages be special?",
"better than polluting the repository).  Would you mind taking another look?",
"understand how to use the `./pharo Pharo.image config` way to deal with github ?",
"Would there be some kind of reasonable way to make a backend that draws to a terminal output?",
 "what is your problem?",
"Traction as in community traction?",
  "Got a link to anything about it?",
"Is there a way to convert a filetree project into a tonel one ?",
"By the way,if a class is represented as a folder,then it is a filetree project?",
"> By the way,if a class is represented as a folder,then it is a filetree project?",
"into a tonel one ?, there should be a plugin in Iceberg for that ... I think right click on a repo or something?",
"how can I prevent introducing a recursion with a deprecation rewrite rule ?",
"how can I increase the test timeout for SUnit in P7?",
 "whats your recommendation,to user tonel or filetree-format?",
"requests for your changes. Nobody should commit to master if it isnt for fixing something. Ok?",
"turn out not to be as many commits as I thought - only 66 commits beyond what was in StHub. Does that sound right to you?",
"issue numbers will (probably) not line up w the upstream issue numbers and may cause confusion. Ideas?",
 "How can these be integrated in jenkins?",
"does a base class need to be loaded before extension? or does the order not matter?",
 "So how does that help having a diagram in jenkins?",
 "Back then there was a tool that produced data files for Emma (?",
"Is there a way to have SUnit run tests more often using different configurations?",
"does it handles history ?",
"Does it migrates _all_ the .mcz in the repository to Git ?",
"how important is that?",
"Should I use this fast import ?",
"What `authors` is exactly ?",
"`peteruhnak/breaking-mcz` is the repostiory on smalltalkhub ?",
"side?",
"there a cookbook/cheatsheet document somewhere that says how to do the Pharo version of `git init` and what to do in my classes to put them in that repo?",
"basic Pharo git commands to commit,push and fetch?",
"Hello Iâ€™m trying to learn smalltalk but i havenâ€™t found any place to go where should I start?",
")????",
 "what do you want to do?",
"Yo is there some kind of extension that will turn `_` into the left arrow in editors like Cuis does?",
"So which ones should I learn with though?",
"Will the things I learn in the mooc work in squeak too? And what are the main differences between squeak and pharo ?",
"certainly. Now why do you bother about Squeak?",
"What are some of the main differences???",
"So squeak is standing still while pharo is evolving ???",
"what???",
"Ok  I guess then?",
 "for Pharo and it seems to have worked well. If you close anymore that are not obviously resolved will you use the tag?",
"nobody cares the next 3 years. So why keep it?",
 "So?",
"?",
"Have you seen this ?",
"I got this when trying to create a new Pharo 7 image using the launcher. Am I the only one?",
 "What was the motivation behind renaming `BaselineOfMagritte3` to `BaselineOfMagritte3`?",
"one:,, if you look through the debugger,does pharo actually tells you that it doesnt exist?",
"maybe you dont have permissions to access the file?",
"to get around this?",
 "Why is Magritte depending on a specific version of Grease in its baseline? Is that a best practice?",
"Well. Now I just feel silly.  Thank you so much!   Is there a setting that controls that key-click combo?",
"reproducible hence the pinning. If you point to HEAD why doing a release?",
"ConfifurationOf obsolete? Can we build tools equivalent to Versionner with them? Although if we fix dependencies in baselines in general,will there be no â€œbleeding edgeâ€ equivalent to help during development? Also,in the case we were talking about,doesnâ€™t the fact that one didnâ€™t ask for a specific commit of the main project already defeat reproducibility?",
"Anyone know a good package for dissecting a CSV file (with customisable separators) for Pharo 7?",
 "From where did you get that binary stream?",
"hi,is there a way to count the lines of code (or to have some kind of metrics about the code size) in Pharo 5?",
 "What is a patchable version tag?",
"Why do you need to subclass the TBSMagritteReport ?",
"BTW is there a way not to get the comment of a component in readonly: true?",
"Does anyone know how to fix it?",
"How do I tag that the bug is fixed?",
 "I might help even I donâ€˜t know about TWBSMagritte. Where did you load it from?",
 "I only dabbled with TBS but I might have a better idea if I can download the code. Is it available?",
 "hi! can talents be used in P61?",
"any idea/pointers/... on what I can do to prevent that?",
"from catalog?",
"Pharo 6.1?",
"So did you publish the fix I did?",
 "did not migrate BootstrapMagritte to github?",
"May be we should host it as a separate project under the same magritte-metamodeling umbrella?",
"Where is ConfigurationOfPharoWeb???",
"Scripts?",
"in Pharo 6.1,,Then anything you have to tell the readers is to load PharoWeb from catalog.... no?",
"Is this the right one?",
"Was BootstapMagritte already checked for compatibility with Pharo 6.1 ?",
"mediums show clearly. What is complex in having a place for repos peole could look at instead putting frameworks and their client implementations in one repo?",
"What is DuneSt btw.?",
"Can I tell metacello that my direct requirement should take precedence over the indirect one ?",
"which PR?",
"Is there an RSS package for pharo?",
"Can anyone advise how the server at ws-demo is set up. I assume it is running headlessly as a service?",
"Also,has anyone tried running Pharo in an AWS Lambda container,i.e. serverless?",
"If you save your image using Save as...,why does the launcher not show these additional images?",
"show up?",
"proportions?",
"Is there a REPL for pharo on the command line. Maybe something using readline?",
"Hello! Is there some sort of mp3 decoder written for Pharo? Perhaps something that relies on some external libraries?",
"yourself: NamlServlet.jtp?",
"to create models controlled from within Pharo including importing the model with XMI and generating the code.  Is there a copy of your code for doing this available?",
"Are there Pharo themed T-shirts,stickers,etc. available anywhere?",
"Who is expert in Roassal? ",
"who is an expert in Smalltalk? ",
"Who is expert in Smalltalk? ",
"Who is expert in Roassal?",
"Who is expert in Smalltalk? ",
"Who is expert in BatSignal?",
"Who is expert in BatSignal?",
"expert in BatSignal? ",
"Who is expert in Array?",
"Who is expert in BatSignal?",
"Who is expert in Array? ",
"Who is expert in BatSignal?",
"what is for this method  DSClientDataPost>>#accept:? ",
"what is for this method DSClientDataPost>>#accept:? ",
"Who is expert in Hiedra ? ",
"who is expert in Hiedra? ",
"who is expert in String? ",
"Who is expert in String? ",
"Who is expert in Roassal? ",
"are you here ? ",
"are you here ? ",
"are you here ? ",
"are you here ? ",
"are you here ? ",
"Who do you think is expert in RTView? ",
"Who do you think is expert in Metacello? ",
"Who do you think is expert in MonticelloRepositoryBrowser? ",
"Who do you think is expert in VersionBrowser ? ",
"Who do you think is expert in doesOverride:? ",
"Who do you think is expert in EpCodeChange ? ",
"Who do you think is expert in EpCodeChange>>#doesOverride:? ",
"Who do you think is expert in EpAndFilter ? ",
"Who do you think is expert in DebuggerModel ? ",
"Who do you think is expert in Transcripter ? ",
"Who do you think is expert in BooleanFilter? ",
"Who do you think is expert in AST-Core ? ",
"What is CodeExport ? ",
"What is Object? ",
"Who is expert in Object ? ",
"Who is expert in Athens-Cairo ? ",
"Who is expert in Athens-Cairo and Athens-Examples ? ",
"Who is expert in Athens ? ",
"Who is expert in Athens-Cairo and Athens-Examples ? ",
"Who is expert in Athens ? ",
"Who is expert in Athens-Cairo and Athens-Examples ? ",
"Who is expert in Athens ? ",
"Who is expert in Athens-Cairo ? ",
"Who is expert in Athens-Cairo and Athens-Examples ? ",
"Who is expert in Athens ? ",
"Who is expert in Object ? ",
"Who is expert in Athens-Cairo ? ",
"Who is expert in Athens-Cairo and Athens-Examples ? ",
"What is Object? ",
"Who is expert in Object ? ",
"Who is expert in Athens-Cairo ? ",
"Who is expert in AST-Core ? ",
"What is CodeExport ? ",
"Who is expert in AST-Core ?",
"Who is expert in BooleanFilter? ",
"Who is expert in Transcripter ? ",
"Who is expert in BooleanFilter? ",
"Who is expert in DebuggerModel ? ",
"Who is expert in Transcripter ? ",
"Who is expert in BooleanFilter? ",
"Who is expert in EpAndFilter ? ",
"Who is expert in DebuggerModel ? ",
"Who is expert in Transcripter ? ",
"Who is expert in EpAndFilter ? ",
"Who is expert in DebuggerModel ? ",
"Who is expert in EpCodeChange>>#doesOverride:? ",
"Who is expert in EpAndFilter ? ",
"Who is expert in DebuggerModel ? ",
"Who is expert in EpCodeChange>>#doesOverride:? ",
"Who is expert in EpAndFilter ? ",
"Who is expert in EpCodeChange ? ",
"Who is expert in EpCodeChange>>#doesOverride:? ",
"Who is expert in EpAndFilter ? ",
"Who is expert in EpCodeChange ? ",
"Who is expert in EpCodeChange>>#doesOverride:? ",
"Who is expert in doesOverride:? ",
"Who is expert in EpCodeChange ? ",
"Who is expert in EpCodeChange>>#doesOverride:? ",
"Who is expert in doesOverride:? ",
"Who is expert in EpCodeChange ? ",
"Who is expert in VersionBrowser ? ",
"Who is expert in doesOverride:? ",
"Who is expert in EpCodeChange ? ",
"Who is expert in MonticelloRepositoryBrowser? ",
"Who is expert in VersionBrowser ? ",
"Who is expert in doesOverride:? ",
"Who is expert in Metacello? ",
"Who is expert in MonticelloRepositoryBrowser? ",
"Who is expert in VersionBrowser ? ",
"Who is expert in Metacello? ",
"Who is expert in MonticelloRepositoryBrowser? ",
"Who is expert in RTView? ",
"Who is expert in Metacello? ",
"Who is expert in MonticelloRepositoryBrowser? ",
"Who is expert in RTView? ",
"Who is expert in Metacello?"]